[
	{
		"title": "How To Circumvent Online Censorship",
		"body": "<h1>How To Circumvent Online Censorship</h1><p>Many governments, companies, schools, and public access points use software to prevent Internet users from accessing certain websites and Internet services. This is called Internet filtering or blocking and is a form of censorship. Content filtering comes in different forms. Sometimes entire websites are blocked and sometimes content is blocked based on keywords contained in it. One country might block Facebook entirely, or only block particular Facebook group pages?or it might block any page or web search with certain words in it.</p><img src=\"internetb1.png\"><p>Regardless of how content is filtered or blocked, you can almost always get the information you need by using a circumvention tool. Circumvention tools usually work by diverting your web or other traffic through another computer, so that it bypasses the machines conducting the censorship. </p><p>There are different ways of circumventing Internet censorship, some of which provide additional layers of security that you may need. The tool that is most appropriate for you depends on your threat model. If you?re not sure what your threat model is, you should work it out using the <a href=\"umbrella://lesson/managing-information\">Managing Information lesson</a>. Users with a high threat model who need to ensure total anonymity online should use tools outlined in the Advanced section of this lesson. </p>",
		"category": "Communications",
		"subcategory": "The Internet",
		"difficulty": "Beginner"
	},
	{
		"title": "HTTPS",
		"body": "<h1>HTTPS</h1><p>HTTPS is the secure version of the HTTP protocol used to access websites. Sometimes a censor will block the insecure version of a site only, allowing you to access that site simply by entering the version of the domain that starts with HTTPS. This is particularly useful if the filtering you're experiencing is based on keywords or only blocks individual web pages. HTTPS stops censors from reading your web traffic, so they cannot tell what keywords are being sent, or which individual web page you are visiting (censors can still see the domain names of all websites you visit).</p><img src=\"internetb2.png\"><p>If you suspect this type of simple blocking, try entering https:// before the domain in place of http://.</p><p>Try EFF?s <a href=\"https://www.eff.org/https-everywhere\">HTTPS Everywhere</a> plug-in to automatically turn on HTTPS for those sites that support it.</p>",
		"category": "Communications",
		"subcategory": "The Internet",
		"difficulty": "Beginner"
	},
	{
		"title": "Website variations",
		"body": "<h1>Website variations</h1><p>Another way that you may be able to circumvent basic censorship techniques is by trying an alternate domain name or URL. For example, instead of visiting http://twitter.com, you might visit http://m.twitter.com, the mobile version of the site. Censors that block websites or web pages usually work from a blacklist of banned websites, so anything that is not on that blacklist will get through. They might not know of all the variations of a particular website's domain name?especially if the site knows it is blocked and registers more than one name.</p>",
		"category": "Communications",
		"subcategory": "The Internet",
		"difficulty": "Beginner"
	},
	{
		"title": "Web-based proxies",
		"body": "<h1>Web-based proxies</h1><p>A web-based proxy (such as <a href=\"https://proxy.org/\">https://proxy.org/</a>) is one of the simplest ways of circumventing censorship. It is a website that lets its users access other, blocked or censored websites. In order to use a web-based proxy, all you need to do is enter the filtered address that you wish to use into the box in the proxy webpage; the proxy will then display the requested content inside its own webpage.</p><img src=\"internetb3.png\"><p>Web-based proxies are a good way to quickly access blocked websites, but they have certain disadvantages, as well.<ul><li>They often don?t provide any security and will be a poor choice if your threat model includes someone monitoring your internet connection.</li><li>They do not always display pages correctly, and many web-based proxies will fail to load complex websites, including those that feature streaming audio and video content.</li><li>And, of course, web-based proxies only work for webpages. You cannot, for example, use an instant messaging program or an email client to access blocked services through a web-based proxy.</li><li>Finally, web-based proxies themselves pose a privacy risk for many users, depending on their threat model, since the proxy will have a complete record of everything you do online.</li></ul></p><p>There are numerous proxy tools that use encryption, providing an additional layer of security, as well as the ability to bypass filtering. Although the connection is encrypted, the tool provider may have your personal data, meaning that these tools do not provide anonymity. They are, however, more secure than a plain web-based proxy. The simplest form of an encrypted web proxy is one that starts with ?https??this will use the encryption usually provided by secure websites. </p>",
		"category": "Communications",
		"subcategory": "The Internet",
		"difficulty": "Beginner"
	},
	{
		"title": "Virtual Private Networks",
		"body": "<h1>Virtual Private Networks</h1><p>A Virtual Private Network (VPN) encrypts and sends all Internet data between your computer and another computer. This computer could belong to a commercial or non-profit VPN service, your company, or a trusted contact. A proxy server is mainly for web traffic only, but a VPN encrypts and protects all traffic. The main difference is that a VPN server encrypts your data, but a proxy server does not. A VPN also lets you use more than just the Internet ? you can use it to access webpages, e-mail, instant messaging, VoIP and any other Internet service. </p><img src=\"internetb4.png\"><h2>Psiphon3</h2><p>Psiphon3 is a secure, public circumvention tool that combines VPN, SSH and HTTP Proxy technology to provide you with uncensored access to Internet content. It is available free online for Windows and Android. You can learn how to use it in the <a href=\"umbrella://lesson/psiphon\">Psiphon3 tool guide</a>.<br>Because Psiphon 3 is VPN-based, it is able to proxy all of your Internet traffic, not just websites. It should be noted that although Psiphon is does not allow individual user?s IP addresses to be associated with any individual website visited, Psiphon is intended primarily as a censorship evasion tool, rather than one that guarantees anonymity.</p><p>For information about other VPN services and to figure out which one might be right for you, click <a href=\"http://torrentfreak.com/which-vpn-services-take-your-anonymity-seriously-2014-edition-140315/\">here</a>. Do not use a VPN that you do not trust.</p><p>While a VPN protects your traffic from being intercepted locally, your VPN provider can still keep logs of what websites you access or even provide a third party with the ability to snoop directly on your web browsing. Depending on your threat model, the possibility of a government listening in on your VPN connection or obtaining the logs may be a significant risk and, for some users, could outweigh the short-term benefits of using a VPN. These users, or anyone who requires total anonymity online, should use Tor, as described in the Advanced section of this lesson.</p>",
		"category": "Communications",
		"subcategory": "The Internet",
		"difficulty": "Beginner"
	},
	{
		"title": "Circumventing censorship from your smartphone",
		"body": "<h1>Circumventing censorship from your smartphone</h1><p>Using your smartphone to go online is often risker than using a computer. You can reduce your risks through the use of these tools.</p><p>Using a VPN on your mobile will give you uncensored access to Internet content while encrypting what you do.  We recommend using the Psiphon3 tool, outlined above, which works on Androids as well as Windows.</p><p>Users with a high threat model who need to ensure total anonymity online should use tools outlined in the Advanced section of this lesson.</p><h2>Proxies</h2><p>Using proxies on your mobile phone will allow you to access otherwise blocked websites. You can access proxies by downloading the mobile version of Firefox ? <a href=\"http://f-droid.org/repository/browse/?fdid=org.mozilla.firefox\">Firefox mobile</a> along with the <a href=\"https://guardianproject.info/apps/proxymob-firefox-add-on/\">Proxy Mobile</a> add-on which makes proxying with Firefox easy. It is helpful in cases of censorship, but still may reveal your requests unless the connection from your client to the proxy is encrypted. This can be used on Androids as well as iPhones.</p><h2>Virtual Private Network (VPN)</h2><p>Using a VPN on your mobile will give you uncensored access to Internet content while encrypting what you do.  We recommend using the <a href=\"umbrella://lesson/psiphon\">Psiphon3</a> tool, outlined above, which also works on Androids. </p><p>Users with a high threat model who need to ensure total anonymity online should use tools outlined in the Advanced section of this lesson.</p>",
		"category": "Communications",
		"subcategory": "The Internet",
		"difficulty": "Beginner"
	},
	{
		"title": "What now?",
		"body": "<p>Swipe right for this lesson's checklist</p><p>Go to the Advanced lesson for advice on how to ensure you stay anonymous online.</p><a href=\"umbrella://lesson/the-internet/1\" class=\"button yellow\">Go to Advanced Lesson</a><h3>RELATED LESSONS/TOOLS</h3><p><ul><li><a href=\"umbrella://lesson/managing-information\">Managing Information lesson</a></li><li><a href=\"umbrella://lesson/psiphon\">Psiphon3 tool guide</a></li><li><a href=\"umbrella://lesson/proxy-mobile\">Proxy Mobile tool guide</a></li></ul></p><h3>FURTHER READING</h3><p><ul><li><a href=\"https://ssd.eff.org/en/module/how-circumvent-online-censorship\">EFF - How to circumvent online censorship</a></li><a href=\"https://ssd.eff.org/en/module/choosing-vpn-thats-right-you\">EFF - Choosing the VPN that's right you</a><li><a href=\"en.flossmanuals.net/bypassing-censorship/\">Floss manuals - Bypassing censorship</a></li><li><a href=\"https://opennet.net\">OpenNet - Outlining internet restrictions</a></li></ul></p>",
		"category": "Communications",
		"subcategory": "The Internet",
		"difficulty": "Beginner"
	}
]