[
	{
		"title": "Digital",
		"body": "<h3>If you are having a digital security emergency, the following are useful resources.</h3><h1>IMMEDIATE SUPPORT</h1><p> Normally available for support within the first 24 hours</p><h2>Digital Security First Aid Kit</h2><p><b>Where:</b> Global<br><br><b>Type of Threat:</b> Digital security incidents, website/social media breaches, seized devices, DDoS mitigation, malware<br>Accept Urgent Appeals? No<br><br><b>Description:</b> The Digital First Aid Kit aims to provide preliminary support for people facing the most common types of digital threats. The Kit offers a set of self-diagnostic tools for human rights defenders, bloggers, activists and journalists facing attacks themselves, as well as providing guidelines for digital first responders to assist a person under threat.<br><br><b>Web site:</b> <a href=\"https://digitaldefenders.org/digitalfirstaid/\">https://digitaldefenders.org/digitalfirstaid/</a></p><h2>Digital Security Helpline</h2><p><b>Where:</b> Global<br><b>Type of Threat:</b> Digital security incidents, website/social media breaches<br><b>Accept Urgent Appeals?</b> No<br><br><b>Description:</b> The Digital Security Helpline is a free of charge resource for civil society around the world. It is run by the international human rights organization Access. It provides rapid response on digital security incidents, tool recommendations and support for securing technical infrastructure, websites and social media against attacks.<br><br><b>Web site:</b> www. accessnow.org<br><b>Email:</b> help@accessnow.org</p><h2>Tactical Technology Collective</h2><p><b>Where:</b> Global<br><b>Type of Threat:</b> Digital and information security tools and manuals<br><b>Accept Urgent Appeals?</b> No<br><br><b>Description:</b> We have three focal areas: understanding & shaping issues; digital security and privacy; and data politics. They work to raise awareness, build practical skills and offer both critical reflection and inspiration in all of these areas. Through trainings and workshops they provide direct support to over 2000 advocates a year, either through intensive training in small groups, or through 'flash trainings' or clinics at large-scale gatherings and conferences.<br><br><b>Web site:</b> <a href=\"www.tacticaltech.org\">www.tacticaltech.org</a><br><b>Email:</b> ttc@tacticaltech.org<br>Berlin, Tel: (+49) (0) 30 41 71 53 33<br>Bangalore, Tel: (+ 91) (0)80 4153 1129</p>",
		"category": "Emergency Support",
		"difficulty": "Beginner"
	}
]