[
	{
		"title": "Physical",
		"body": "<h3>If you are having a physical security emergency, the following are useful resources.</h3><h1>IMMEDIATE SUPPORT</h1><p>Normally available for support within the first 24 hours<br><br><b>Where:</b> Global Embassy Listings</p> <a href=\"https://embassy-finder.com\">https://embassy-finder.com</a><h2>Front Line</h2><p><b>Where:</b> Global<br><br><b>Type of Threat:</b> Threats of Violence, Physical Assault, Imprisonment, Lawsuit, Infringement on Rights<br><br><b>Language:</b> Arabic, English, French, Russian, Spanish<br><br><b>Accept Urgent Appeals?</b> Yes!<br><br><b>Description:</b> Front Line protects Human Rights Defenders through a 24hour emergency hotline (phone and encrypted email), international advocacy, security training and training manuals, grants and fellowships (including emergency funding), and evacuation support. Front Line?s Dublin Platform links grassroots human rights defenders with UN mechanisms, international human rights networks, and each other.<br><br><b>Web site:</b> frontlinedefenders.org<br>Dublin, Tel: (+353) 1 212 3750<br><b>Email:</b> info@frontlinedefenders.org<br>Brussels, Tel: (+32) 2 230 93 83<br><b>Secure Online Communication:</b> web https://secure.hyperlink.ie/frontline/<br>comment.en.html<br><br>24 hour emergency support, Tel: (+353) 1 21 00 489</p><h2>Rory Peck Trust</h2><p><b>Where:</b> Global<br><br><b>Type of Threat:</b> Freelance journalists who suffer: Physical Assault, Imprisonment, Infringement on Rights, Discrimination, Attack on Freedom of Expression<br><br><b>Language:</b> English<br><br><b>Accept Urgent Appeals?</b> Yes!<br><br><b>Description:</b> The principal objectives of the Trust are to provide practical assistance and support to freelance newsgatherers and their families worldwide, to raise their profile, promote their welfare and safety, and to support their right to report freely and without fear.<br><br><b>Web site:</b> <a href=\"www.rorypecktrust.org\">www.rorypecktrust.org</a><br>London, Tel: (+44) 203 219 7860</p><h2>U.S. Centers for Disease Control and Prevention</h2><p><b>Where:</b> Global<br><br><b>Type of Threat: </b>Disease, outbreak, medical health protection<br><b>Language: </b>English<br><b>Accept Urgent Appeals? </b>No<br><br><b>Description:</b> The U.S. government agency is a public source for information on common diseases, disorders, and treatments. The CDC website provides information about sickness and disease, healthy living, safety and emergency care, and disaster preparedness and response.<br><br><b>Web site:</b> www.cdc.gov<br>Atlanta, Tel: +1-800-232-4636 (24-hour health information hotline, Monday through Friday)</p><h1>DELAYED SUPPORT</h1><p>Normally available for support after first 24 hours</p><h2>Amnesty International</h2><p><b>Where:</b> Global<br><br><b>Type of Threat:</b> Physical Assault, Imprisonment, Infringement on Rights, Discrimination, Attack on Freedom of Expression<br><br><b>Language:</b> Arabic, English, French, Spanish<br><br><b>Accept Urgent Appeals?</b> Yes!<br><br><b>Description:</b> Amnesty International leads a global movement of research, solidarity, and action on behalf of victims of human rights violations. Amnesty International campaigns to end discrimination, abuse, and infringements on human rights, physical and mental integrity, and the freedom of thought and expression.<br><br><b>Web site:</b> www.amnesty.org<br>New York, Tel: (+1) 212 807-8400<br>London, Tel: (+44) 20-74135500</p><h2>Asian Human Rights Commission</h2><p><b>Where:</b> East Asia; South & Southeast Asia<br><br><b>Type of Threat:</b> Physical Assault, Imprisonment, Infringement on Rights, Discrimination, Attack on Freedom of Expression<br><b>Language:</b> Bahasa, Burmese, Chinese, English, French, German, Italian, Japanese, Korean, Tagalog<br><br><b>Accept Urgent Appeals?</b> Yes!<br><br><b>Description:</b> The Asian Human Rights Commission monitors, investigates, advocates, and takes solidarity action around human rights violations across Asia. AHRC?s Urgent Appeal Programme mobilizes thousands of individu- als to speak out around particular cases. (Directed by Ashoka Fellow Basil Fernando.)<br><br><b>Web site:</b> www. ahrchk.net<br>Hong Kong, Tel: 852-2698 6339<br><b>Email:</b> ahrchk@ahrchk.org</p><h2>Committee to Protect Journalists</h2><p><b>Where:</b> Global<br><br><b>Type of Threat:</b> Threats of Violence, Physical Assault, Imprisonment, Lawsuit, Infringement on Rights, Discrimination, Attack on Freedom of Expression<br><br><b>Language:</b> English<br><br><b>Accept Urgent Appeals?</b> Yes<br><br><b>Description:</b> The Committee to Protect Journalists promotes press freedom worldwide by defending the rights of journalists to report the news without fear of reprisal. CPJ reveals abuses against the press, acts on behalf of imprisoned or threatened journalists, and warns journalists of attacks on press freedom. CPJ?s Journalist Assistance Program offers emergency sup- port around medical attention, relocation, legal aid, and evacuation.<br><br><b>Web site:</b> <a href=\"www.cpj.org\">www.cpj.org</a><br>New York, Tel: (+1) 212 465-1004<br><b>Email:</b> JournAsst@cpj.org</p><h2>Conectas</h2><p><b>Where:</b> Brazil; Latin America, Africa, Asia<br><br><b>Type of Threat:</b> Threats of Violence, Imprisonment, Lawsuit, Infringement on Rights, Discrimination<br><br><b>Eligible:</b> Human Rights advocates (activists and academics)<br><br><b>Language:</b> English, Portuguese, Spanish<br><br><b>Accept Urgent Appeals?</b> No<br><br><b>Description:</b> Conectas? Justice Program supports strategic litigation and pro bono legal services to support vulnerable groups and victims of human rights violations. Conectas? Global South Program links human rights aca- demics and activists in Africa, Asia, and Latin America to share knowledge, connect them to the UN, and strengthen the new generation of human rights defenders. (Directed by Ashoka Senior Member Oscar Vilhena.)<br><br><b>Web site:</b> conectas.org <br>Sao Paulo, Tel: (+5511) 3884-7440<br><b>Email:</b> conectas@conectas.org</p><h2>CIVICUS & Civil Society Watch</h2><p><b>Where:</b> Global<br><b>Type of Threat:</b> Physical Assault, Imprisonment, Lawsuit, Infringement on<br>Rights, Discrimination, Attack on Freedom of Expression<br><br><b>Language:</b> English<br><b>Accept Urgent Appeals?</b> Yes<br><br><b>Description:</b> CIVICUS strengthens civil society and civic action around the world through an international alliance of more than 1000 members across 100 countries. Civil Society Watch (CSW) mobilizes rapid responses in situations in which rights and liberties of citizens are threatened or limited. CSW makes statements of protests, letter-writing campaigns, press campaigns, public marches, and missions to verify acts of violations of rights.<br><br><b>Web sites:</b> www.civicus.org; www.civilsocietywatch.org<br><b>Emails:</b> info@civicus.org; cswatch@civicus.org<br>South Africa, Tel: (+27 11) 833-5959</p><h2>European Interagency Security Forum</h2><p><b>Where:</b> Global<br><b>Type of Threat:</b> Humanitarian aid workers facing security threats in the field<br><b>Accept Urgent Appeals?</b> No<br><br><b>Description:</b> EISF?s aim is to improve holistic security risk management (SRM) approaches allowing sustainable access of aid workers to populations in need. The EISF Secretariat works in collaboration with its? Members to produce original research, arrange biannual forum meetings and regular workshops and facilitate information sharing between members and the wider NGO community.<br><br><b>Web site: </b><a href=\"www.eisf.eu\">www.eisf.eu</a> London,<br>Tel: (+44) 203 195 1360<br><b>Email:</b> eisf-coordinator@eisf.eu</p><h2>Federation for Human Rights</h2><p><b>Where:</b> Global<br><b>Type of Threat:</b> Physical Assault, Imprisonment, Infringement on Rights, Discrimination, Attack on Freedom of Expression<br><br><b>Language: </b>Arabic, English, French, Spanish<br><b>Accept Urgent Appeals?</b> No<br><br><b>Description:</b> FIDH works with over 141 non-governmental organizations in over 100 countries towards improvements in victim protection, prevention of human rights violations, and judicial punishment of perpetrators. Over the past 25 years they have organized over 1000 missions in 100 countries. FIDH works closely with the World Organisation Against Torture (OMCT) through its Observatory for the Protection of Human Rights Defenders.<br><br><b>Web site:</b> <a href=\"www.fidh.org\">www.fidh.org</a> <br>Paris, Tel: (+33) 1 43 55 25 18</p><h2>Fund for Global Human Rights</h2><p><b>Where:</b> India, Pakistan, Liberia, Sierra Leone, Guinea, Democratic Republic of Congo, Burundi, Uganda, Mexico, Guatemala, Algeria, Morocco, Tunisia<br><b>Type of Threat:</b> Threats of Violence, Physical Assault, Imprisonment, Infringement on Rights, Discrimination, Attack on Freedom of Expression <br><b>Language:</b> Arabic, English, French, Spanish<br><br><b>Accept Urgent Appeals?</b> No<br><br><b>Description:</b> The Fund for Global Human Rights channels financial resources to on-the-ground human rights organizations, strengthening human rights movements and communities around the world. The Fund for Global Human Rights pools funding from international donors, funds local and regional human rights groups, and creates networks to link often isolated activists.<br><br><b>Web site:</b> <a href=\"www.globalhumanrights.org\">www.globalhumanrights.org</a><br>Washington, DC, Tel: (+1) 202 347-7488<br><b>Email:</b> info@globalhumanrights.org</p><h2>Human Rights First</h2><p><b>Where:</b> Global<br><b>Type of Threat:</b> Threats of Violence, Physical Assault, Imprisonment, Infringement on Rights, Discrimination, Attack on Freedom of Expression<br><b>Language:</b> English<br><br><b>Accept Urgent Appeals?</b> Yes<br><br><b>Description:</b> Human Rights First protects people at risk, including victims of human rights violations and discrimination. Their Human Rights Defenders program supports human rights defenders targeted for threats and attack through advocacy and mobilizing their volunteer network.<br><br><b>Web site:</b><a href=\"www.humanrightsfirst.org\">www.humanrightsfirst.org</a><br>New York, Tel: (+1) 212 845-5200</p><h2>Human Rights Watch</h2><p><b>Where:</b> Global<br><b>Type of Threat:</b> Threats of Violence, Imprisonment, Lawsuit, Infringement on Rights, Discrimination, Attack on Freedom of Expression<br><br><b>Language:</b> Arabic, Chinese, English, French, German, Hebrew, Korean, Persian, Portuguese, Russian<br><b>Accept Urgent Appeals?</b> Yes<br><br><b>Description:</b> Human Rights Watch stands with victims and activists to prevent discrimination, uphold political freedom, protects people from inhumane conduct in wartime, and brings offenders to justice by exposing human rights violations and holding abusers accountable. HRW?s principal advocacy strategy is to shame offenders through press attention, exert dip- lomatic and economic pressure, and build coalitions around specific human rights issues.<br><br><b>Web site:</b> <a href=\"www.hrw.org\">www.hrw.org</a><br>New York, Tel: (+1) 212-290-4700<br><b>Email:</b> hrwnyc@hrw.org</p><h2>International Service for Human Rights</h2><p><b>Where:</b> Global<br><b>Type of Threat:</b> Threats of Violence, Physical Assault, Imprisonment, Lawsuit, Infringement on Rights, Discrimination, Attack on Freedom of Expression<br><b>Language:</b> English<br><br><b>Accept Urgent Appeals?</b> No<br><br><b>Description:</b> ISHR provides information, training, and support to human rights defenders around the world. Their Human Rights Defenders Offices strengthens UN procedures to support Human Rights Defenders, and is promoting similar mechanisms in Africa and the Americas. They do not take urgent appeals, as they focus on training and aggregating knowledge.<br><br><b>Web site:</b> www.ishr.ch Geneva, Tel: (+41) 22 733 51 23</p><h2>Observatory for the Protection of Human Rights Defenders</h2><p><b>Where:</b> Global<br><b>Type of Threat:</b> Threats of Violence, Physical Assault, Imprisonment, Lawsuit, Infringement on Rights, Discrimination, Attack on Freedom of Expression<br><b>Language:</b> English, various<br><br><b>Accept Urgent Appeals?</b> Yes<br><br><b>Description:</b> The Observatory is among the largest coalitions of NGOs (nearly 300 local, national, and regional organizations) fighting against arbitrary detention and executions, torture, forced disappearances, and other forms of violence. The Observatory has denounced and stopped attacks against human rights defenders through urgent appeals, fact-finding missions, lobbying, training, and reports. They do take urgent appeals.<br><br><b>Web site:</b> www.omct.org click on ?Human Rights Defenders?<br><b>Email:</b> omct@omct.org<br>Switzerland, Tel: (+41) 22 809 4939</p><h2>Peace Brigades International</h2><p><b>Where:</b> Latin America; South & Southeast Asia; Eastern Europe & Central Asia; North America<br><b>Type of Threat:</b> Threats of Violence, Imprisonment, Infringement on Rights, Discrimination, Attack on Freedom of Expression<br><br><b>Accept Urgent Appeals?</b> No<br><br><b>Description:</b> Peace Brigades International offers protective accompaniment to human rights organizations to deter potential attacks and provide moral support. While PBI does not work directly for threatened organizations, they build international support networks and pressure governments to protect their citizens. PBI also supports Peace Education Programs.<br><br><b>Web site:</b> <a href=\"www.peacebrigades.org\">www.peacebrigades.org</a><br>London, Tel: +44 20 7065 0775</p><h2>Urgent Action Fund for Women?s Human Rights and Urgent Action Fund Africa</h2><p><b>Where:</b> Global<br><br><b>Type of Threat:</b> Threats of Violence, Physical Assault, Imprisonment, Lawsuit,Infringement on Rights, Discrimination, Attack on Freedom of Expression<br><b>Language:</b> Arabic, Albanian, Bahasa, English, French, Nepali, Spanish, Russian,<br><br><b>Accept Urgent Appeals?</b> Yes!<br><br><b>Description:</b> UAF and UAF-Africa operate Rapid Response Grant-making programs to support women activists around: a) peace-building in situations of armed conflict, escalating violence, or politically volatile environments;b) potentially precedent-setting legal and legislative actions; and c) protection of women human rights defenders. Their Research, Publications, and Advocacy program is a resource for activists, funders, and allies of women?s human rights activism.<br><br><b>Web site:</b> www.urgentactionfund.org<br>USA, Tel: (+1) 303 442-2388 (all requests outside Africa)<br>Kenya, Tel: (+254) 20 2931095 (all requests in Africa)<br><b>Email:</b> urgentact@urgentactionfund.org; proposal@urgentactionfund-africa.or.ke</p><h2>Witness</h2><p><b>Where:</b> Global<br><b>Language:</b> English<br><br><b>Accept Urgent Appeals? </b>No<br><br><b>Description:</b> WITNESS uses video and online technologies to open the eyes of the world to human rights violations. We empower people to transform personal stories of abuse into powerful tools for justice, promoting public engagement and policy change. WITNESS regularly conducts on-site trainings with our Core Partners, teaching them how to document human rights abuses safely and effectively with video and how to use video to further their advocacy goals.<br><br><b>Web Site:</b> <a href=\"www.witness.org\">www.witness.org</a><br>New York, Tel: (+1) 718.783.2000</p><h1>B. LEGAL NETWORKS</h1><h2>Advocates for International Development (A4ID)</h2><p><b>Description:</b> Advocates for International Development (A4ID) mobilizes the skills and expertise of the legal profession to combat poverty and inequality of opportunity worldwide. A4ID promotes awareness of social, economic, and legal issues while strengthening the capacity of citizen sector organizations.<br><br><b>Web site: </b><a href=\"www.a4id.org\">www.a4id.org</a><br><b>Email:</b> info@a4id.org</p><h2>Cyrus R. Vance Center for International Justice</h2><b>Where:</b> Latin America, Africa, Global<br><br><b>Description:</b> The Cyrus R. Vance Center for International Justice supports lawyers worldwide who promote access to justice, equitable judicial systems, socially-oriented public policies, and confidence in the legal profession. The Vance Center championed the Pro Bono Declaration for the Americas and manages the Global Network for Justice Initiatives (GNJI).<br><br><b>Web site:</b> www.nycbar.org/VanceCenter/index.htm; <a href=\"www.gnji.net\">www.gnji.net</a><br>New York, Tel: (+1) 212 382-4718</p><h2>Human Rights Law Network</h2><p><b>Where:</b> India, South Asia<be>Description: HRLN uses the legal system to advance human rights. HRLN lawyers collaborate with human rights organizations and grass-roots develop- ment collectives to defend the rights of marginalized and vulnerable groups. HRLN provides pro bono legal services and conducts public interest litigation, engages in advocacy and campaigns, conducts legal awareness programs, investigates violations, and publishes ?Know Your Rights? materials.<br><br><b>Web site:</b> www.hrln.org<br>New Delhi, Tel: +91-11-24374501, 24376922</p><h2>International Senior Lawyers Project</h2><p><b>Where:</b> Global<br><br><b>Description:</b> ISLP provides volunteer legal services from skilled and experienced attorneys to advance democracy and the rule of law, protect human rights and promote equitable economic development worldwide. Through the pro bono work of retired and active practitioners, working independently and in law firms, ISLP helps governments and citizens develop and implement legal reforms, assists programs that advance the social and economic well-being of people in developing countries, and builds the capacity of local organizations and professionals to meet the needs of their communities.<br><br><b>Web site:</b> <a href=\"www.islp.org\">www.islp.org</a><br>New York, Tel: (+1) 212 895-1359</p><h2>Lex Mundi Pro Bono Foundation</h2><p><b>Description:</b> The Lex Mundi Pro Bono Foundation engages Lex Mundi?s global network of 160 top-tier business law firms present in over 100 countries to provide pro bono legal assistance to social entrepreneurs.<br><br><b>Web site:</b> <a href=\"www.lexmundiprobono.org\">www.lexmundiprobono.org</a><br>Washington, DC, Tel: (+1) 202 429-8169</p><h2>Public Interest Law Initiative (PILI)</h2><p><b>Where:</b> Central & Eastern Europe, Russia<br>Description: PILI advances human rights around the world by stimulating public interest advocacy and developing the institutions necessary to sustain it. PILI is strengthening the use of law as an instrument for achieving social justice.<br><b>Web site:</b> <a href=\"www.pili.org\">www.pili.org</a><br>Budapest, Tel: (+36) 1 461-5700<br>Moscow, Tel: (+7) 795 628 00 20<br>New York, Tel: (+1) 212 803-5381</p><h1>C. INTERNATIONAL MECHANISMS</h1><p>In addition to citizen sector organizations, inter-governmental institutions offer additional support to human rights defenders and individuals who have suffered human rights violations.</p><h2>U. N. Special Representative on Human Rights Defenders</h2><p><b>Where:</b> Global<br><b>Accept Urgent Appeals?</b> Yes<br><br><b>Description:</b> The UN Special Representative on Human Rights Defenders supports and gathers information on behalf of human rights defenders around the world. The Special Representative operates in complete independence of any state, is not a UN staff member, and does not receive a salary.<br><b>Web site:</b> http://<a href=\"www2.ohchr.org/english/issues/defenders/\">www2.ohchr.org/english/issues/defenders/</a><br>Geneva, Tel: (+41) 22 917 1234<br><b>Email a complaint:</b> urgent-action@ohchr.org<br><br><b>Additional Resources:</b><ul><li>Guidelines for submitting complaints<br>http://www2.ohchr.org/english/issues/ defenders/complaints.htm</li><li>UN Declaration on Human Rights Defenders<br>http://<a href=\"www2.ohchr.org/english/issues/defenders/\">www2.ohchr.org/english/issues/defenders/</a>declaration.htm</li></ul></p><h2>U.N. Office of the High Commissioner for Human Rights</h2><p><b>Where:</b> Global<br><b>Accept Urgent Appeals?</b> Yes<br><b>Description:</b> The UN Office of the High Commissioner for Human Rights (OHCHR) promotes and protects the enjoyment and full realization by all people of all rights established in the Charter of the United Nations, including the Universal Declaration of Human Rights.<br><br><b>Web site:</b> http://<a href=\"www2.ohchr.org/english/issues/defenders/\">www2.ohchr.org/english/issues/defenders/</a><br>Geneva, Tel: (+41) 22 917 0656<br><b>Email a complaint:</b> civilsocietyunit@ohchr.org<br><br><b>Additional Resources:</b><ul><li>Universal Decl. of Human Rights http://<a href=\"www.unhchr.ch/udhr/index.htm\">www.unhchr.ch/udhr/index.htm</a></li><li>International human rights instruments www2.ohchr.org/english/law/</li></ul></p><h2>Inter-American Commission of Human Rights (Washington, DC) and Inter-American Court of Human Rights (San Jose)</h2><p><b>Where:</b> the Americas<br><b>Languages:</b> English, French, Portuguese, Spanish<br><b>Accept Urgent Appeals?</b> Yes<br><br><b>Description:</b> The Inter-American Commission a) receives, analyzes, and investigates petitions alleging human rights violations; b) observes the general human rights situation in member states; c) carries out on-site visits to analyze specific situations; and d) submits cases to the Inter-American Court for litigation. The Inter-American Court issues and enforces judgments. Both are comprised of representatives from members of the Organization of American States.<br><b>Note:</b> Individuals and citizen sector organizations may directly petition the Inter-American Commission, only after exhausting all options within their State to address the situation.<br><br><b>Web Sites:</b> Inter-American Commission <a href=\"www.cidh.org\">www.cidh.org</a><br>Inter-American Court www.corteidh.or.cr</p><h2>African Commission on Human and People?s Rights</h2><p><b>Where:</b> Africa<br><b>Languages:</b> English, French<br><b>Accept Urgent Appeals?</b> Yes<br><br><b>Description:</b> The African Commission promotes and protects human rights across Africa through investigations of alleged violations, recommendations to the State(s) involved, and ensuring appropriate measures are taken. Recommendations are submitted to the Organisation of African Unity (OAU) to monitor compliance.<br><br><b>Note:</b> Individuals, citizen sector organizations, and States party to the African Charter may directly petition the Inter-American Commission, only after exhausting all options within their State to address the situation.<br><br><b>Web Sites:</b> African Commission <a href=\"www.achpr.org\">www.achpr.org</a><br>Banjul, Tel 220 39 29 62 Africa Union (Addis Ababa) www.africa-union.org</p><h2>European Court of Human Rights</h2><p><b>Where:</b> Europe<br>Languages: English, French<br><b>Accept Urgent Appeals?</b> Yes<br><br><b>Description:</b> the European Court of Human Rights ensures that States respect the rights guaranteed by the European Convention on Human Rights. The European Court examines complaints (known as ?applications?) lodged by individuals, and issues binding judgments where the State is found in violation of these rights.<br><br><b>Note:</b> Individuals may file complaints directly to the Court, only after exhausting all options within their State to address the situation.<br><br><b>Web Site:</b> www.echr.coe.int/ECHR</p><h2>International Criminal Court</h2><p><b>Description:</b> Founded in part by the United Nations and based in The Hague, the International Criminal Court tries individuals accused of inter- national crimes including genocide, crimes against humanity, and war crimes. Only States and the international communicate can bring cases to the ICC. The ICC is an independent body and is based on a treaty, joined by 105 countries.<br><br><b>Web Site:</b> www.icc-cpi.int</p>",
		"category": "Emergency Support",
		"subcategory": "Psyhical",
		"difficulty": "Beginner"
	}
]