[
	{
		"title": "Threats of Physical Harm",
		"body": "<h1>Threats of Physical Harm</h1><p>Finally, understand that there is always one way that attackers can obtain your password: They can directly threaten you with physical harm or detention. If you fear this may be a possibility, such as if you are going to be travelling across hostile borders with sensitive information, consider ways in which you can hide the existence of the data or device you are password-protecting, rather than trust that you will never hand over the password. One possibility is to maintain at least one computer/email/keepass account that contains largely unimportant information, whose password you can reveal quickly.</p><p>If you have good reason to believe that someone may threaten you for your passwords, it's good to make sure your devices are configured so that it won't be obvious that the account you are revealing is not the ?real? one. Is your real account shown in your computer's login screen, or automatically displayed when you open a browser? If so, you may need to reconfigure things to make your account less obvious.</p><p>In such circumstances, you should also treat your password manager as a sensitive file, and hide/protect it as we describe in the <a href=\"umbrella://lesson/protecting-files\">Protecting Files lesson</a>.</p>",
		"category": "Information",
		"subcategory": "Passwords",
		"difficulty": "Expert"
	},
	{
		"title": "Challenging password demands",
		"body": "<h1>Challenging password demands</h1><p>In some jurisdictions, such as the United States or Belgium, you may be able to legally challenge a demand for your password. In other jurisdictions, such as the United Kingdom or India, local laws allow the government to demand information is given to them. More information on safety precautions to take while travelling can be read in the <a href=\"umbrella://lesson/journeys\">Journeys</a> lesson.</p><p>Please note that intentional destruction of evidence or obstruction of an investigation can be charged as a separate crime, often with very serious consequences. In some cases, this can be easier for the government to prove and allow for more substantial punishments than the alleged crime originally being investigated.</p> ",
		"category": "Information",
		"subcategory": "Passwords",
		"difficulty": "Expert"
	},
	{
		"title": "What now?",
		"body": "<p>Swipe right for this lesson's checklist</p><p>Go to the Beginner lesson for advice on how to create a strong password.</p><a href=\"umbrella://lesson/passwords/0\" class=\"button green\">Go to Beginner Lesson</a><p>Go to the Advanced lesson for advice on how to manage your passwords.</p><a href=\"umbrella://lesson/passwords/1\" class=\"button yellow\">Go to Advanced Lesson</a><h3>RELATED LESSONS/TOOLS</h3><p><ul><li><a href=\"umbrella://lesson/protecting-files\">Protecting Files lesson</a></li><li><a href=\"umbrella://lesson/journeys\">Journeys lesson</a></li></ul> </p><h3>FURTHER READING</h3><p><ul><li><a href=\"https://www.eff.org/wp/defending-privacy-us-border-guide-travelers-carrying-digital-devices\">EFF - Defending Privacy at the U.S. Border guide</a></li></ul></p>",
		"category": "Information",
		"subcategory": "Passwords",
		"difficulty": "Expert"
	}
]