[
	{
		"title": "Why Meetings?",
		"body": "<p>For many people activists, journalists or aid workers, meetings can be high-risk encounters. Meetings can expose the identity or work of either you or the person you meet with, and have often been the scene of arrests. For this reason, it is vital to put the highest level of planning and preparation into meetings involving vulnerable human rights defenders or whistleblowers.</p>",
		"category": "Operations",
		"subcategory": "Meetings",
		"difficulty": "Beginner"
	},
	{
		"title": "Location Selection",
		"body": "<p>You should choose the area you plan to meet in carefully. It should be an area the person you are meeting (and you if possible) is comfortable in and knows well. If you don?t know it ? get to know it. You should be able to plan out your approach, possible escape and nearby safe spots such as partners, supportive local population, and embassies.</p><p>Once you have chosen the area, you need to choose the specific meeting location. Often the most obvious locations such as their office/home offer a false sense of security and you can be more likely to be under surveillance there. It may be better to meet in a public place such as a café. In choosing a café, be careful of the usual spots that human rights defenders frequent ? Perhaps adversaries are aware of this this too. Try to choose a location not frequented by people likely to be targeted by surveillance. If you don?t know a location and will not get a chance to see it before you arrive, use the internet to try and view pictures and gather information about it.</p><p>Think about various aspects that may allow you to fit in:<ul><li>Who are the clientele who use it?</li><li>What do they wear?</li><li>What size groups do they sit in?</li><li>Are the tables so close to each other that you can be easily overheard?</li><li>Is it likely to be crowded?</li><li>Would you look suspicious entering there?</li></ul><p>Try to check if there?s there a place to sit where you can observe the whole location but still have your back to a wall and be close to / have a clear path to an escape route. You should always have an alternative backup meeting place nearby and if you feel there is a risk of surveillance or problems at your first choice location ? be ready to switch to it at the very last minute.</p>",
		"category": "Operations",
		"subcategory": "Meetings",
		"difficulty": "Beginner"
	},
	{
		"title": "Scenarios to Consider",
		"body": "<p>There are a few scenarios you should play out in your head before you go to your meeting. Some may not put you at any extra risk but it?s useful to have thought them through in advance.</p><p><ul><li>Will you or they have to travel through checkpoints? If so what is your story?</li><li>What will you do if are delayed?</li><li>What if the person is early /late/ arrives unexpectedly with a third party who you don?t know or trust?</li><li>What is your contact plan for if the person doesn?t show at all?</li><li>What if the person is temporarily insecure ? someone else is talking to them, they have been stopped by authorities/ recognised/ are drawing attention to themselves?</li><li>How much information you are going to give the person you are meeting?</li><li>What if they pass you something (documents/USB etc.)? Where will you put it to keep it out of sight?</li><li>What do you expect the person?s reaction to the meeting to be ? fear/ anger/ anxiety?</li><li>What will you do if you start to get interest from a third party, whether general or threatening?</li></ul></p>",
		"category": "Operations",
		"subcategory": "Meetings",
		"difficulty": "Beginner"
	},
	{
		"title": "Arrival at a Meeting",
		"body": "<p>If possible you should remove batteries from phones before travelling to the meeting location, so as to avoid remote tracking. (See the Mobile Phones lesson for more advice on mitigating the risks of phones)</p><p>Ideally all parties would conduct counter-surveillance when travelling to the meeting. See the Counter-Surveillance lesson for advice on how to do this. If the person you are meeting is not trained in this, and you are unsure of their security, one of your colleagues may be able to check whether your contact has been followed. You should ensure you are clear before you arrive. If possible you should arrive first and check the area is clear ? check the toilets, emergency exits and likely approaches.</p><p>Try to sit where you can observe the whole location but still have your back to a wall and be close to/ have a clear path to an escape route. If you have a second colleague available who is not needed in the meeting, they can take a seat nearby with a clear view of you and exits.</p><p>Do not commit to staying somewhere by buying something until you are sure you are clear ? You might attract suspicion leaving otherwise. Agree a subtle and simple signal to alert your colleague if you feel something is wrong.</p>",
		"category": "Operations",
		"subcategory": "Meetings",
		"difficulty": "Beginner"
	},
	{
		"title": "The Meeting Itself",
		"body": "<p>It is important to keep control of the flow of the meeting. After introductions you should begin by mentioning security to the person: agree on your alternate time and place for the meeting if a problem occurs; let them know what you can and cannot do to help them if there is a problem; agree on a discreet signal in case there is a problem.</p><p>Avoid ordering meals and pay for what you do get straight away and in cash ? This avoids your identification and allows you to make a speedy exit if needed.</p><p>Observe people who enter after the person you are meeting, as well as anyone who sits close to you ? use knowledge of surveillance teams to assess them. Always trust your instincts ? prepare to leave immediately if you feel something is not right.</p><p>Avoid incriminating yourself. If possible, avoid writing on paper ? you can always ask for details to be sent via encrypted email later. (See the Email lesson for advice on how to send encrypted email.) If notes are necessary, try not to write anything sensitive in the first ten minutes and in general keep the amount of sensitive notes you take/actually record to a minimum whenever possible. Consider using codenames (esp. for testimony or sensitive information). When finished with your notes, always remember to destroy them safely and dispose of it in places away from the meeting location. Do not let waitresses or waiters overhear your conversation.</p>",
		"category": "Operations",
		"subcategory": "Meetings",
		"difficulty": "Beginner"
	},
	{
		"title": "Eavesdropping",
		"body": "<p>Unfortunately bugging equipment is very cheap, widespread and effective. It is very, very hard to find eavesdropping equipment that has been planted against you ? many look like ordinary electronic items. In some countries, many high profile hotels are targets for regular bugging due to the frequent presence of business people, diplomats, NGOs etc.</p><p>The best tactic in avoiding such devices is to be unpredictable and change locations frequently if you are on high-risk travel and need to avoid surveillance. Be very wary of conducting sensitive activities in fixed locations (such as the office of a partner or a hotel room) for too long or repetitively. Limiting the provision of information in advance (for example, of which rooms will be used for conferences in specific hotels) is also useful as it reduces the time a hostile organisation has to plant a device. Outside in the open air can also be a good place to discuss sensitive matters. Make sure you are not overlooked.</p>If dealing with sensitive matters, always assume the room is bugged. Ensure that all mobile phones are turned off and batteries removed (as they can be turned on remotely without you knowing and used as a listening device). If possible you should remove batteries from phone before arriving at meeting location. (See the Mobile Phones lesson for more advice on avoiding the risks of phones) Masking noises like a loud radio or TV can be useful for reducing overheard conversations, although the most advanced devices can eliminate these extra sounds.</p><p>Unplug all unnecessary electronic devices from the electrical sockets. (If possible, turn off the electricity at the mains and check behind all electrical plug and light switch sockets.) Pay particular attention to smoke alarms, lamps, clocks etc. Don?t forget about staff such as cleaners or waiters who may be able to overhear what is going on.</p>",
		"category": "Operations",
		"subcategory": "Meetings",
		"difficulty": "Beginner"
	},
	{
		"title": "Leaving a Meeting",
		"body": "<p>It is best to get the person you are meeting to leave first ? that way you can check for any third party reactions to see if they?re clean as they leave. Wait about ten minutes before you leave. If possible your colleague (who should still look unconnected to you) should remain behind for a further ten minutes to check that you are clean.</p>",
		"category": "Operations",
		"subcategory": "Meetings",
		"difficulty": "Beginner"
	},
	{
		"title": "What now?",
		"body": "<p>Swipe right for this lesson?s checklist</p><h3>RELATED LESSONS/TOOLS</h3><p><ul><li><a href=\"umbrella://lesson/counter-surveillance\">Counter-Surveillance lesson</a></li><li><a href=\"umbrella://lesson/mobile-phones\">Mobile phones lesson</a></li><li><a href=\"umbrella://lesson/email\">Email lesson</a></li></ul></p>",
		"category": "Operations",
		"subcategory": "Meetings",
		"difficulty": "Beginner"
	}
]