[
	{
		"title": "Countering Physical Surveillance",
		"body": "<h1>Countering Physical Surveillance</h1><p>Physical surveillance continues to be a significant danger to those working on human rights. Other than a human source, it is the only way to build detail on what is occurring at meetings. It is obviously important to know how to identify if you, your colleagues, or partners are under surveillance.</p><p>Counter-surveillance is the process of detecting and mitigating hostile surveillance. This lesson lets you know how to practice counter-surveillance at one of the most important times ? when you are out and about on foot, such as going to a sensitive meeting.</p><p>For advice on how to practice counter-surveillance when in a vehicle, go to the Expert lesson.</p><img src=\"surveillance2.png\">",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Advanced"
	},
	{
		"title": "What do they look like?",
		"body": "<h1>What do they look like?</h1><p>There are a number of indicators that might let you know if a person is conducting surveillance on foot.</p><p>Look out for:<ul><li>Bulky, loose clothing</li><li>Outdoor clothing</li><li>Military-style sports watch</li><li>Radio broadcast switch on their wrist</li><li>Earpiece with/without a wire</li><li>Comfortable footwear</li></ul></p><p>Surveillance teams often try to use people who would easily be overlooked. Don?t disregard people such as:<ul><li>Females</li><li>Couples/groups</li><li>People wearing expensive clothes</li><li>Young/old looking people</li><li>People jogging</li><li>Beggars</li><li>Hotel maids, gardeners</li><li>Road workers</li><li>Commercial outfits (e.g. electricity company)</li><li>Unlikely minorities</li><li>People with a pram/dog/shopping bags</li></ul></p><p>Tells? that might give away someone who is conducting surveillance on foot include:<br><ul><li>Readjusting personal equipment</li><li>Touching earpiece</li><li>Visibly talking into their microphones</li><li>Glazed eyes</li><li>Unusual behaviour or demeanour</li><li>Trying to avoid the target?s gaze</li><li>Looking around corners/through windows</li><li>Mirroring behaviour</li><li>Stopping in unusual places</li></ul></p><p><b>Identifying Teams</b></p><p>If you identify one potential surveillance member, you can use that knowledge to identify others. Members of a surveillance team can cross-contaminate other members:<ul><li>By speaking directly to them</li><li>By looking in their direction</li><li> By using hand signals</li><li> By appearing or dressing in a similar manner</li></ul></p><img src=\"surveillance3.png\">",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Advanced"
	},
	{
		"title": "What can you do to spot them?",
		"body": "<h1>What can you do to spot them?</h1><p>The most important thing to remember when conducting counter-surveillance is that you need to be discreet ? you do not want any potential surveillance teams to know that you are looking for them. This would raise suspicions further about what you intended to do. <b>The primary aim is to ascertain whether or not you are being followed, not to lose them. </b></p><p>Remember, if you discover you are in fact under surveillance, you have three options:<ul><li><b>Change your plans:</b>This is the safest and recommended option ? it will allow you to keep your original plans to yourself and reassure whoever had you under surveillance that you aren?t up to anything suspicious or worthy of surveillance.</li><li><b>Lose the surveillance covertly:</b>This is losing the surveillance team without them knowing you were aware of them by making it look accidental. This should be used if you absolutely must keep your plans and you feel it is safe to do so.</li><li><b>Lose the surveillance overtly:</b>This trying to identify or lose the surveillance team in a way that makes them aware of what you are trying to do. This is a risky tactic because it confirms to the team that you are indenting to do something that you don?t want them to see and so are increases the likelihood of you being under continued surveillance. You should only conduct your counter-surveillance overtly if absolutely vital and it is not possible to do so covertly.</li></ul></p>",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Advanced"
	},
	{
		"title": "Five Rules of Counter-Surveillance",
		"body": "<h1>Five Rules of Counter-Surveillance</h1><h3>1. Trigger</h3><p>This is the person who initially alerts the rest of the surveillance team when the target is on the move. The easiest person to find.</p><h3>2. 10 to 2</h3><p>The person carrying out the surveillance will try to stay out of a the 10 t0 2: the immediate eye line of the person they have put under surveillance</p><h3>3. 3 times</h3><p>This is the number of sightings of a surveillance team member you are aiming to achieve before you can confirm that you are under surveillance.</p><h3>4. 3 sides of a square</h3><p>This is the minimum number of turns you take to filter and reduce the possibility of seeing the same person by coincidence.</p><h3>5. Breaking the box</h3><p>This is the process of breaking out of the surveillance a team will try to keep you in. By breaking the box you increase the likelihood that they will make mistakes which you can observe and use to identify them.</p>",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Advanced"
	},
	{
		"title": "Tactics: Identify the Trigger",
		"body": "<h1> Tactics: Identify the Trigger</h1><p>The trigger is the surveillance team member who initially alerts the rest of the surveillance team members (who will be spread out in a box around the target). They are unlikely to move when you leave your location as that may draw attention to themselves.</p><p>The easiest place for them to be located is in or outside your location. They will usually try to stay stationary. If the place you have entered has a number of exits then a number of team members may be spread around each as a trigger. Think about where you would be if you were on a surveillance team ? look for locations and situations where it would not be suspicious for a surveillance person to be hanging around.</p>",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Advanced"
	},
	{
		"title": "Tactics: How to find the eyeball on foot",
		"body": "<h1>Tactics: How to find the eyeball on foot</h1><p>The eyeball refers to the member of the surveillance team who currently has you in their sights. Firstly - don?t look over your shoulder! Instead try to create situations to look observe all around you naturally ? including behind you:<ul><li>Try using windows ? either looking through them or in their reflection ? or car mirrors;</li><li>Hold open doors for other people to enter and let them overtake you;</li><li>Cross a busy street and see who follows you;</li><li>Stop to look at posters or bus timetables, use an ATM, or buy something from a street vendor.</li></ul></p>",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Advanced"
	},
	{
		"title": "Tactics: Create a force-past",
		"body": "<h1>Tactics: Create a force-past</h1><p>A force-past is when you create a situation in which someone following you would have to go past you or expose their position. There are several easily created force-past points:<ul><li>Traffic crossing point</li><li>Bus stop</li><li>Taking an escalator</li><li>Using a lift to go up (until all passengers have left), then go down and exiting via an underground car park</li><li>Rapidly turning a corner then suddenly entering into a shop</li><li>Go into a shop/pub/building through one entrance and then rapidly exit via another</li><li>Corner hanging ? turn a corner then rapidly stop</li><li>Change your clothing to make it harder to identify you</li></ul></p>",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Advanced"
	},
	{
		"title": "Three Sides to a Square",
		"body": "<h1>Three Sides to a Square</h1><p>This is a technique used to identify several members of a team, create pressure on them and thin down their surveillance. It can be conducted alone or with a team.</p><p>It means taking a longer route than would logically make sense for someone going from point A to B.</p><p>Pick three or more reasons to be a) using such an unusual route and b) stopping along the way. These reasons should take the following things into account:<ul><li>It should be genuine and not suspicious ? there should be a believable reason for the detour. Remember, this is because you do not want any possible surveillance to know that you are checking for surveillance;</li><li>It should force a surveillance team member to go into the location with you to establish what you are doing, who you are meeting, or check for any signs that you may have a counter-surveillance team with you;</li><li>It should be a position where you can:<ul><li>Observe what is occurring</li><li>Observe the various exits/entrances</li><li>Be out of the target?s 10 to 2 eye line</li></ul></li><li>You should be able to quickly get on the move again ? so pay bills in advance, don?t get hot food, etc.</li></ul></p>",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Advanced"
	},
	{
		"title": "Tactics: Get on a bus",
		"body": "<h1>Tactics: Get on a bus</h1><p>It is difficult for surveillance teams to keep up if you suddenly get on a bus, going from on foot to mobile. This is particularly true because buses are slower than other vehicles so are difficult to follow by car too. Ensure you have change for the fare. Sit as far back in the bus as possible and if it?s left-hand drive, sit on the right side of the bus to be able to observe any vehicles which might over take the bus</p><p>If conducting overt anti-surveillance ? get on, get off at the next stop, and then rapidly get on the next bus. If you want to appear covert ? get on a bus with one number, then get off and get a bus with another number, to make it look like you might be lost.</p>",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Advanced"
	},
	{
		"title": "Tactics: Get in a train or taxi",
		"body": "<h1>Tactics: Get in a train or taxi</h1><p>Trains are difficult to follow with multiple forms of surveillance because they are faster than other vehicles. When getting on the train, hang back and try to be the last person to get on. Stand at the end of the platform where the train driver stops and where you will have a good view. Try buying a ticket to a destination and observe  - get off before that destination.</p><p>If conducting overt anti-surveillance ? get off then rapidly change trains. If you want to appear covert ? get on a train with one destination, then get off and get a train with another destination, to make it look like you might be lost.</p><p>Taxis can be useful for local knowledge and the fact that in some countries they can use bus lanes which surveillance vehicles might not be able to use without drawing attention to themselves.</p>",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Advanced"
	},
	{
		"title": "What now?",
		"body": "<p>Swipe right for this lesson's checklist</p><p>Go to the Beginner Lesson for advice on how to identify and deal with surveillance of your office.</p><a href=\"umbrella://lesson/counter-surveillance/1\" class=\"button green\">Go to Beginner Lesson</a><p>Go to the Expert Lesson for advice on how to practice counter-surveillance when you are out in a vehicle.</p><a href=\"umbrella://lesson/counter-surveillance/3\" class=\"button purple\">Go to Expert Lesson</a><h3>RELATED LESSONS/TOOLS</h3><p><ul><li><a href=\"umbrella://lesson/meetings\">Meetings</a></li></ul></p>",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Advanced"
	}
]