[
	{
		"title": "Phase One  - Planning",
		"body": "<p>Evacuation planning and rehearsals should be carried out regularly. Security situations can deteriorate rapidly, often without warning.  The evacuation plan should be prepared and all staff should understand an outline of it. The following issues should be considered when preparing your evacuation plan.</p><p><ul><li><b>Under what circumstances will you evacuate?</b> Outline the situations and indicators under which you will put this evacuation plan into action. Identify the situations under which you will:<ul><li><b>Suspend</b> work activities in response to security concerns;</li><li><b>Hibernate</b> by staff remaining where they are but keeping a low profile;</li><li><b>Relocate</b> with staff moving internally within the country or to a safe-house to escape security concerns, or;</li><li><b>Evacuate</b> with staff stopping work and leaving the country due to severe security concerns.</li></ul></li><li><b>Who will be evacuated</b> - It is essential that all staff members clearly understand their and their families? eligibility for evacuation or relocation assistance.<ul><li><b>Priority 1</b> ? International staff family members</li><li><b>Priority 2</b> ? Staff members who are in immediate personal danger due to the conditions of the crisis</li><li><b>Priority 3</b> ? Individuals other than essential staff</li><li><b>Priority 4</b> ? Essential staff</li></ul></li><li><b>Where will staff be evacuated to?</b>Identify a first-choice destination and an alternate destination for evacuation or relocation.  Organise an emergency safe-house or safe-haven if needed. Determine visa requirements, and the logistics that will be needed upon arrival.</li><li><b>How will staff be evacuated?</b>Establish a notification system and an assembly point.  Detail the route and method of evacuation. Check to ensure that these routes can be travelled under emergency conditions. Coordinate plans with embassies, UN agencies, and other NGOs as appropriate.</li><li><b>What goes and what stays?</b>Identify which documents, such as contracts, payroll records, etc. will be needed to re-establish operations once relocated or upon re-entry.  Other documents should be marked for destruction, or left behind, as appropriate.  Consider how evacuated documents will be perceived if seized by a particular person or group.  They may contain information that could put those evacuating at risk, and would be better destroyed.</li><li><b>Who is responsible for the various tasks during an evacuation?</b> During crises key staff will be fully occupied so responsibilities for evacuation should be clearly defined during the planning stage.</li><li><b>What will be the expected impact of evacuation on the operation?</b>Will the office be closed and, if so, how?  What are the policies and plans for continuing operations through national staff members acting on their own?  Or through contractors, if feasible and appropriate?</li></ul></p>",
		"category": "Operations",
		"subcategory": "Evacuation",
		"difficulty": "Beginner"
	},
	{
		"title": "Phase Two  - Alert",
		"body": "<p>Mounting tensions and/or instability may lead you or your organisation to issue a recommendation to limit operations, increase security measures, and review the evacuation plan.  Work outside the immediate vicinity of the field office may be suspended.  Tasks during this stage include the following.</p><p><ul><li>Brief all national and international staff on the situation.</li><li>Communication systems for notification of staff should be finalized and tested.  Consider tying into other systems, such as warden systems for other NGO, UN or embassy staffs.</li><li>Prepare salaries and other money required by national staff.</li><li>Back up important files onto disks, delete sensitive files, and destroy sensitive documents.  See how to properly back up and delete files in the Backing Up and Safely Deleting lessons.</li><li>Staff members and their family should check that they have personal documentation with them at all times.</li><li>Inventory all office equipment and assets.  As appropriate, identify the equipment to be evacuated and responsibility for each item.  Plan how high-value equipment which will remain should be hidden or protected.</li><li>International staff families should be considered for an early departure</li><li>Potential evacuees should assemble personal belongings in grab bags to be taken during an emergency evacuation. See the Protective Equipment lesson for details on what to pack in a grab bag.</li><li>Potential evacuees should ensure that they do not take with them any information or equipment that might be interpreted as incriminating (e.g. reports of military movements; pictures on disk or paper of any security-related subjects).</li><li>Stock the safe-house or assembly area with appropriate supplies (Outlined in safe house section)</li><li>Assign each evacuee to a specific vehicle so that anyone missing may be readily identified, and ensure that all vehicles are ready.</li></ul></p>",
		"category": "Operations",
		"subcategory": "Evacuation",
		"difficulty": "Beginner"
	},
	{
		"title": "Phase Three - Evacuation Imminent",
		"body": "<p>When evacuation is imminent the office should usually suspend most normal operations to concentrate on evacuation preparations.  Potential evacuees may be relocated to a pre-selected safe area, or work from home.  Remote staff should be recalled or relocated.  Staff currently outside the region should remain in a safe place.  Non-essential personnel and family members may be evacuated.  Tasks during this phase, which may last weeks or only a few hours, include:</p><p><ul><li>Keep all staff fully informed.</li><li>Coordinate closely with embassies, other NGOs, the UN, and other agencies as appropriate.</li><li>Pay salaries to local staff, with salary advances if possible</li><li>Hide high-value property which will remain. Remove any organisation logos from vehicles which may be stolen. Ensure you keep copies of serial numbers of high-value equipment.</li><li>Give clear instructions regarding responsibilities and leadership roles to those staff staying behind.  Establish a means of continued communication between remaining staff and those evacuating. Provide authorisation documents to key national staff, if necessary.</li></ul></p>",
		"category": "Operations",
		"subcategory": "Evacuation",
		"difficulty": "Beginner"
	},
	{
		"title": "Phase Four - Evacuation",
		"body": "<p>Once evacuation or relocation has begun, it should take precedence over all other activities.  The field office may continue operations through national staff, or contractors if appropriate, or may close completely.  Considerations during evacuation may include:</p><p><ul><li>If there is a risk of looting, consider disabling radios, equipment and vehicles.  Empty and leave open all safes.</li><li>Ensure effective communication with national staff left behind.</li><li>All evacuees move to pre-designated assembly area.</li><li>Evacuate by the safest means possible, maintaining good order and remaining in communication with all groups evacuating.</li><li>Once evacuation is complete, inform HQ, relevant embassies, and key national staff.</li></ul></p><p>The evacuated personnel may manage operations from outside the country, communicating with and working through the national staff (or contractors) if possible.  If a decision is made to close the office completely, care will be needed to ensure humane and correct termination or reassignment of staff contracts and the disposal of assets.</p>",
		"category": "Operations",
		"subcategory": "Evacuation",
		"difficulty": "Beginner"
	},
	{
		"title": "Safe-houses",
		"body": "<p>Safe-houses take a number of different forms. They can either be emergency safe-houses which are houses or apartments rented specifically for this purpose OR emergency safe havens which are in the already-occupied houses or apartments of friendly people.</p><p>Safe-houses and safe havens should be in a relatively anonymous community where neighbours won?t be suspicious about what is going on, or in a community where the neighbours can be relied on not to inform.</p><p>Safe-houses and safe havens should be in locations which allow observation of approaches to the property. There should be a number of emergency escape routes which are known to all those who may need to stay there. They should ideally have a secure parking place which would make it harder to place a tracker under the car at night. Safe-houses should be secure, with locks on windows, doors and gates and have a good quality alarm system and/or a dog. They should have a modicum of comfort ? with appropriate running water, heating and electricity.</p><p>Safe-houses that are usually empty should be regularly serviced. Houses should not be left empty for weeks/months on end, as this may look suspicious: post should be collected regularly; the grass should be cut. If the house is unoccupied, non-sensitive activity should occur in the house every few days to make it look occupied. Ideally all rent and bills should be paid using cash to avoid leaving a trace.</p><p>Safe-houses and safe havens might need the following:<ul><li>Sufficient supplies of fuel, food, batteries and water for each person to last for a minimum of ten days.</li><li>Emergency generator</li><li>Battery or wind up mechanical radio and ideally a TV </li><li>Clothing, especially outerwear appropriate for varying weather conditions</li><li>Advanced first aid kit with necessary medications as required</li><li>Flashlights with extra batteries </li><li>Maps and communication plans as appropriate (to plan for emergency evacuation)</li><li>Fully charged mobile phones and chargers, appropriate credit </li><li>Satellite phone and charger (if issued) </li><li>Sufficient amounts of extra cash</li><li>Items to reduce psychological stress upon anyone using the safe-house (e.g. books, magazines, board games, games consoles etc.) </li></ul></p><p>All sensitive waste produced at the house should be shredded/ securely burnt and disposed of. Residents should be aware of all possibly incriminating evidence that may be held there: electronic equipment; documents; travel tickets; receipts; or general waste which indicates the number, type or activities of the people using the house.</p><p>Emergency grab bags for each person should be located close to the most likely emergency escape routes. See the Protective Equipment lesson for details on what to pack in a grab bag.</p>",
		"category": "Operations",
		"subcategory": "Evacuation",
		"difficulty": "Beginner"
	},
	{
		"title": "Considerations",
		"body": "<p>An evacuation is not easy for the evacuees or for those staying behind.  It is a very emotional event, giving rise to feelings of guilt, hurt, frustration, and powerlessness.  The departure of international aid organisations can have a variety of meanings to the local population, including the removal of a symbolic or real safety barrier. Thus, an evacuation is not a neutral act and may even aggravate a crisis.  When a field team evacuates it should consider providing a statement for the media and others explaining the organisation?s reasoning and any continuation or possible resumption of programmes.</p><p><b>Self-evacuation.</b> Individuals that are working remotely from a local office, or who find themselves isolated during a crisis should use their judgement concerning the safety in their area.  All staff members should be authorised to evacuate on their own authority when they feel their safety is threatened, and should communicate with their manager during the process.</p><p> <b>Evacuation refusal.</b> Staff who are instructed to evacuate or relocate, and who refuse, may face disciplinary action.  They are likely to be considered as staying at their own risk.</p><p><b>National staff evacuation or relocation.</b> Many humanitarian organisations have a policy of only evacuating international staff.  If the manager believes that some or all national staff and/or their families face a direct threat, then they should consider organising or assisting their evacuation or relocation.</p><p><b>Return and resumption of activities.</b>This may occur soon after evacuation or take a long time.  Re-establishing operations after an evacuation can be difficult. National staff who did not evacuate may have experienced hardship and threats to themselves and their families and this can understandably cause tensions. Due recognition of their achievement is important. Restoring relationships with staff, local authorities, beneficiaries, and the local population can be made easier if honesty, tact, and transparency are used prior to and during the evacuation, and on return. Read the Stress lesson on how to help manage the stress of staff.</p>",
		"category": "Operations",
		"subcategory": "Evacuation",
		"difficulty": "Beginner"
	},
	{
		"title": "What now?",
		"body": "<p>Swipe right for this lesson?s checklist</p><h3>RELATED LESSONS/TOOLS</h3><p><ul><li><a href=\"umbrella://lesson/backing-up\">Backing Up lesson</a></li><li><a href=\"umbrella://lesson/safely-deleting\">Safely Deleting lesson</a></li><li><a href=\"umbrella://lesson/protective-equipment\">Protective Equipment lesson</a></li><li><a href=\"umbrella://lesson/stress\">Stress lesson</a></li></ul></p></p><h3>FURTHER READING</h3><p><ul><li>ECHO Generic Security Guide for Humanitarian Organisations</li><li>Good Practice Review Number 8: Operational security management in violent environments (Revised Ed.)</li></ul></p>",
		"category": "Operations",
		"subcategory": "Evacuation",
		"difficulty": "Beginner"
	}
]