[
	{
		"title": "Countering Physical Surveillance",
		"body": "<h1>Countering Physical Surveillance</h1><p>Physical surveillance continues to be a significant danger to those working on human rights. Other than a human source, it is the only way to build detail on what is occurring at meetings. It is obviously important to know how to identify if you, your colleagues, or partners are under surveillance.</p><p>Counter-surveillance is the process of detecting and mitigating hostile surveillance. This lesson lets you know how to practice counter-surveillance at one of the most important times ? when you are in a vehicle, such as going to a sensitive meeting.</p><p>For advice on how to practice counter-surveillance when on foot, go to the Advanced lesson.</p><img src=\"surveillance4.png\">",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Expert"
	},
	{
		"title": "What do they look like?",
		"body": "<h1>For advice on how to practice counter-surveillance when on foot, go to the Advanced lesson.</h1><p>There are a number of indicators that might let you know if a vehicle is being used to conduct mobile surveillance.</p><p>Look out for:<ul><li>Common vehicles for the area ? a team will try to use the most inconspicuous vehicle for the local environment</li><li>Unusual aerials</li><li>Modified boxes on top</li><li>Equipment in the car ? Maps, radios, GPS, binoculars, cameras etc.</li><li>Rubbish in a car</li><li>Parking for quick exit</li><li>Windows left slightly open</li><li>?Boot fit?</li><li>One or at most two people in a vehicle</li><li>Radio operator talking into a radio</li><li>Two people in a stopped car talking but not apparently to each other</li><li>Leaving an engine on unnecessarily</li><li>Brake lights being activated when a vehicle is stationary</li><li>Don?t forget taxis, rickshaws or expensive looking cars.</li></ul></p><p><b>Identifying Teams</b><br><br>If you identify one potential surveillance member, you can use that knowledge to identify others. Members of a surveillance team can cross-contaminate other members:<ul><li>By looking in their direction</li><li>By using hand signals</li><li>By parking their car or stopping in the same place (e.g. they have relieved each other)</li><li>By poor discipline/drills/boredom and pulling their cars up alongside each other in order to have an unnecessary conversation.</li></ul></p>",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Expert"
	},
	{
		"title": "What can you do to spot them?",
		"body": "<h1>What can you do to spot them?</h1><p>The most important thing to remember when conducting counter-surveillance is that you need to be discreet ? you do not want any potential surveillance teams to know that you are looking for them. This would raise suspicions further about what you intended to do. <b>The primary aim is to ascertain whether or not you are being followed, not to lose them.</b></p><p>Remember, if you discover you are in fact under surveillance, you have three options:<ul><li><b>hange your plans:</b>This is the safest and recommended option ? it will allow you to keep your original plans to yourself and reassure whoever had you under surveillance that you aren?t up to anything suspicious or worthy of surveillance.</li><li><b>Lose the surveillance covertly:</b>This is losing the surveillance team without them knowing you were aware of them by making it look accidental. This should be used if you absolutely must keep your plans and you feel it is safe to do so.</li><li><b>Lose the surveillance overtly:</b>This trying to identify or lose the surveillance team in a way that makes them aware of what you are trying to do. This is a risky tactic because it confirms to the team that you are indenting to do something that you don?t want them to see and so are increases the likelihood of you being under continued surveillance. You should only conduct your counter-surveillance overtly if absolutely vital and it is not possible to do so covertly.</li></ul></p>",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Expert"
	},
	{
		"title": "Five Rules of Counter-Surveillance",
		"body": "<h1>Five Rules of Counter-Surveillance</h1><h3>1. Trigger</h3><p>This is the person who initially alerts the rest of the surveillance team when the target is on the move. The easiest person to find.</p><h3>2. 10 to 2</h3><p>The person carrying out the surveillance will try to stay out of a the 10 t0 2: the immediate eye line of the person they have put under surveillance</p><h3>3. 3 times</h3><p>This is the number of sightings of a surveillance team member you are aiming to achieve before you can confirm that you are under surveillance.</p><h3>4. 3 sides of a square</h3><p>This is the minimum number of turns you take to filter and reduce the possibility of seeing the same person by coincidence.</p><h3>5. Breaking the box</h3><p>This is the process of breaking out of the surveillance a team will try to keep you in. By breaking the box you increase the likelihood that they will make mistakes which you can observe and use to identify them.</p>",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Expert"
	},
	{
		"title": "Tactics: How to find the eyeball",
		"body": "<h1>Tactics: How to find the eyeball</h1><p>When looking for repeat sightings in a vehicle, use the following tactics if safe to do so:<ul><li>Look for repeat sightings</li><li>Use a false indicator</li><li>Drive fast / slow</li><li>Stop suddenly (try to have a reason for this ? such as pulling in at a petrol station at the very last minute or taking a mobile phone call)</li><li>U-turn</li><li>Move into a filter lane turning right and at the last minute continue straight</li><li>Stop immediately after taking a left turn ? will force others to overtake</li><li>Change lanes</li><li>Turn into a dead end</li><li>Enter onto a fast road such as a dual carriageway/motorway and then come off it quickly</li><li>Exit a dual carriageway/motorway and then come straight back onto it again</li><li>Use your mirrors</li><li>Create opportunities to look around</li><li>Stretch out the team</li><li>Create opportunities (if absolutely vital) to evade a surveillance team</li></ul></p><p>If the political environment allows, pull in to a police station or ring colleagues/ backup to meet you at a designated spot where you can aim to safely lead any potential surveillance team members which you haven?t broken contact with.</p>",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Expert"
	},
	{
		"title": "Tactics: Chokepoints",
		"body": "<h1>Tactics: Chokepoints</h1><p>Chokepoints are areas that anyone following you must pass through, and so allow for better observation and filtering of potential surveillance. Some naturally occurring chokepoints could be:<ul><li>Small relatively deserted laneway/alleyway with few paralleling lanes/roads</li><li>Traffic lights</li><li>Roundabouts</li><li>Road junctions</li><li>One way streets</li><li>Car park entrances/exits</li><li>Toll booths</li><li>Quiet roads</li><li>Long straight roads</li><li>Road works</li></ul></p><p>If using a roundabout as a chokepoint, try to record up to 10 of the vehicles following the vehicle which is potentially under surveillance  ? Try to note the registration and description (colour, make, model, unique descriptive features, number of occupants, presence of radios etc.) This is because a handover to another car may take place here ? so another person would now have the target in their line of sight. </p><p>Look for a handover: When turning, look for vehicles (or people on foot) who might match the profile of surveillance team members but then continue straight.</p>",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Expert"
	},
	{
		"title": "Spotting Trackers",
		"body": "<h1>Spotting Trackers</h1><p>A tracker is a device placed on a car to monitor its location. This is often used by surveillance teams instead of physically following a person?s car.</p><p>Some trackers (particularly those used by government agencies) allow the surveillance team to track a target in real time and to monitor historical paths. Some trackers only log the journey taken by the target vehicle. They do not allow the surveillance team to track the vehicle live ? instead the tracker must be retrieved by the team and analysed on a laptop.</p><p>You should be particularly aware of the risk of trackers if you think your work is of interest to the authorities and your car is kept in a publicly accessible areas at any time. You should regularly check your car for trackers and particularly before going to any sensitive meetings.</p><p>Trackers are usually placed on the base of a car using magnets. They can also be placed in the boot or roof. You need to get right under the car and feel around corners with your hands to do a proper check.</p><p>Trackers can be the size of a phone or even smaller. They can also be covered in tape or oil to help disguise it as part of the car.</p>",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Expert"
	},
	{
		"title": "What now?",
		"body": "<p>Swipe right for this lesson's checklist</p><p>Go to the Beginner Lesson for advice on how to identify and deal with surveillance of your office.</p><a href=\"umbrella://lesson/counter-surveillance/1\" class=\"button green\">Go to Beginner Lesson</a><p>Go to the Advanced Lesson for advice on how to practice counter-surveillance when you are out on foot.</p><a href=\"umbrella://lesson/counter-surveillance/2\" class=\"button yellow\">Go to Advanced Lesson</a><h3>RELATED LESSONS/TOOLS</h3><p><ul><li><a href=\"umbrella://lesson/meetings\">Meetings</a></li></ul></p>",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Expert"
	}
]