[
	{
		"title": "Before You Go",
		"body": "<p>Protest marches, rallies or unplanned gatherings may be small and self-limiting or may become riots and civil disturbance.</p><p>It is important to prepare adequately (in proportion to the expected event) before going to cover it. This can have many different meanings depending on the size of the team you work with, but should include the following if possible and appropriate:<ul><li>Prepare emergency and fall back plans ? agree at what stage you should pull out and emergency meeting points;</li><li>Source and pack protective equipment ? see the Protective Equipment lesson for more advice on this;</li><li>Pack a first aid pack ? you should also remind yourself of how to administer basic first aid;</li><li>Select broadcast equipment carefully ? you may want to use discreet cameras if filming becomes dangerous;</li><li>Contact your Safety Adviser or the person responsible for security in the organisation you are contracted to ? they should consider the size of team needed and whether or not it should include security personnel;</li><li>Teams covering disorder, riots etc should have training and briefing on safety in civil unrest situations. Experience is also a great help.</li><li>For large protests a specific risk assessment should be carried out.</li></ul></p>",
		"category": "Operations",
		"subcategory": "Protests",
		"difficulty": "Beginner"
	},
	{
		"title": "Dealing with Crushes",
		"body": "<p>Crushing in crowds or police charges can be dangerous even as a bystander. You can mitigate the danger by taking the following precautions:<ul><li>Ensure there are good working communication channels between the team and everybody?s location is known at all times.</li><li>Unless specifically planned to cover from amongst crowd, retreat to a safe vantage point, e.g. an upstairs window of a nearby building with permission of the owner.</li><li>Park vehicles in accessible location, positioned for easy departure. Plan positions including emergency escape routes & fallback plans.</li><li>Take second person and stay alert to changes in situation ? leave if crowd behaviour becomes unpredictable.</li><li>Wear clothing & footwear that will enable easy movement around any debris. Do not wear high heels or sandals / open toed shoes.</li></ul></p>",
		"category": "Operations",
		"subcategory": "Protests",
		"difficulty": "Beginner"
	},
	{
		"title": "Dealing with Violence",
		"body": "<p>Violence in a crowd situation can include physical harassment, thrown debris, petrol bombs, fire, use of weapons or tear gas. To mitigate such dangers, you should take all the precautions outlined under ?Dealing with Crushes? as well as the following:<ul><li>Wear suitable protective clothing e.g. fire retardant natural fibres.</li><li>Trust your instincts ? crowds can turn very quickly. If you sense it is becoming unsafe or you are getting too much attention, withdraw to a safe area.</li><li>If faced with direct aggression / if weapons appear, withdraw to a safe area immediately and tell your team.</li><li>Take riot kits if appropriate. Riot kits containing equipment (safety glasses, bump cap, mask etc) and first aid kits are made available by large media organisations.</li></ul></p>",
		"category": "Operations",
		"subcategory": "Protests",
		"difficulty": "Beginner"
	},
	{
		"title": "What now?",
		"body": "<p>Swipe right for this lesson?s checklist</p><p>Go to the Advanced lesson for advice on partaking in protests as an activist.</p><h3>RELATED LESSONS/TOOLS</h3><p><ul><li><a href=\"umbrella://lesson/protective-equipment\">Protective Equipment lesson</li></ul></p>",
		"category": "Operations",
		"subcategory": "Protests",
		"difficulty": "Beginner"
	}
]