[
	{
		"title": "Surveillance",
		"body": "<h1>Surveillance</h1><p>Surveillance is the monitoring of people?s behaviour, activities, or other patterns for the purpose of harming, influencing, managing, directing, or protecting them.</p><img src=\"surveillance1.png\"><p><b>Why might people be interested in keeping you under physical surveillance?</b><ul><li>Break-in/ theft of sensitive materials</li><li>Arrest</li><li>Monitor who is coming and going from the office</li><li>Intimidation</li><li>Physical attack on staff</li></ul></p><p><b>Who might be interested in keeping you under surveillance?</b><ul><li>Authorities of the country in which the regional office is located (police, intelligence, military)</li><li>External security agencies of other countries in the region</li><li>Criminals</li><li>Terrorists</li><li>Private contractors</li><li>Embassy officials of ?friendly? countries</li><li>Individuals (may be disgruntled with the organisation)</li></ul></p>",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Beginner"
	},
	{
		"title": "Surveillance techniques",
		"body": "<h1>What techniques are available to carry out surveillance?</h1><p><ul><li>Digital surveillance (monitoring of digital communications, mobile phones etc.)</li><li>Human surveillance (on foot, in a vehicle)</li><li>Technical surveillance (bugs, listening devices, video cameras, number plate readers etc.)</li></ul></p><p>These lessons deal with how to counter human surveillance. For advice on digital surveillance see the Information and Communications lessons. For advice on how technical surveillance see the Meetings lesson and Home/Office section.</p>",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Beginner"
	},
	{
		"title": "Identifying office surveillance",
		"body": "<h2>How to Identify if Your Office is Under Surveillance</h2><p>Surveillance generally requires that the adversary is able to observe the activities of its targets. This means there are a limited number of physical sites they can use for surveillance. The best thing to do when looking for surveillance is to try to think like an adversary ? what might you do is you were trying to monitor your office? From where might you carry out such surveillance?</p><p><ul><li><b>Take a baseline</b><br>It is important to gain an understanding of what ?normal? conditions look like. (For example, where cars normally park or people normally stand).</li><li><b>Identify and record</b><br>From this, try to identify and record any unusual activities. (For example, people in locations where they shouldn?t be or aren?t normally).</li><li><b>Filter out coincidence</b><br>Filter out the chances that something could be a coincidence by concentrating on unusual activities and applying common sense filters (e.g. if someone is standing in a place where people don?t normally stand pay more attention to them. Do they look like they are from the area? Are they paying an unusual amount of attention to your activities?) Look for 3 signs that something is out of the ordinary or 3 repeat sightings.</li><li><b>Notify others</b><br>It is important to notify others of any suspicions and to keep a log of them. This allows the monitoring of patterns which otherwise might not emerge. For example, if you notice someone suspicious and then a colleague notices something else suspicious on a separate occasion but this information is not shared, then a valuable opportunity to confirm a security threat is missed.</li><li><b>Trust your senses</b><br>Trust your senses ? there may be clues of a potential arrest or violent attack. Often, HRDs report that there were warning signs prior to an attack, but they chose to ignore the warning signs or dismissed it as paranoia.</li></ul></p>",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Beginner"
	},
	{
		"title": "What to do?",
		"body": "<h1>What To Do If Your Office Is Under Surveillance</h1><p><ul><li><b>Consider the risks</b><br>Confrontation with suspicious people should be done with caution, before doing so, consider the risks. For example, what might that person be doing? What is the past history of threats against your organisation or yourself? Is it likely that they will attack you immediately if you confront them or is it more likely that they will just leave and send someone else? If you confront someone they are likely to be replaced by another (unknown) agent, and you then lose the benefit of being able to monitor the surveillance being carried out against you.</li><li><b>Increase protection</b><br>Increase your office protection by reducing the ability of an adversary to conduct surveillance. For example by putting up screening near your building, using CCTV and/or guards, closing blinds, locking gates, selecting sites which are not easily overlooked, strict access controls to your building etc.</li><li><b>Continue monitoring</b><br>Continue to monitor the general security environment and increase your observation of threats during periods of higher tension ? e.g. protests, elections, sensitive national holidays etc.</li></ul></p>",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Beginner"
	},
	{
		"title": "What now?",
		"body": "<p>Swipe right for this lesson's checklist</p><p>Go to the Advanced Lesson for advice on how to practice counter-surveillance when you are out on foot.</p><a href=\"umbrella://lesson/counter-surveillance/1\" class=\"button yellow\">Go to Advanced Lesson</a><p>Go to the Expert Lesson for advice on how to practice counter-surveillance when you are out in a vehicle.</p><a href=\"umbrella://lesson/counter-surveillance/2\" class=\"button purple\">Go to Expert Lesson</a><h3>RELATED LESSONS/TOOLS</h3><p><ul><li><a href=\"umbrella://lesson/malware\">Malware lesson</a></li><li><a href=\"umbrella://lesson/passwords\">Passwords lesson</a></li><li><a href=\"umbrella://lesson/protecting-files\">Protecting Files lesson</a></li><li><a href=\"umbrella://lesson/making-a-call\">Making a Call lesson</a></li><li><a href=\"umbrella://lesson/sending-a-message\">Sending a Message lesson</a></li><li><a href=\"umbrella://lesson/email\">Email lesson</a></li><li><a href=\"umbrella://lesson/radio\">Radio lesson</a></li></ul></p>",
		"category": "Operations",
		"subcategory": "Counter-Surveillance",
		"difficulty": "Beginner"
	}
]