[
	{
		"title": "Types of Stress",
		"body": "<h1>Types of Stress</h1><p>Stress is a natural reaction, and it can be positive and stimulating. Not all stress is bad. There are different types of stress, both healthy and unhealthy. Healthy stress helps people focus on the task at hand, mobilises energy and prepares them for action. When stress occurs too often, however, or is too intense or lasts too long, it turns from positive to negative.</p><img src=\"stress1.png\"><p>There are 3 different types of unhealthy stress: chronic, traumatic, and also post-traumatic.<br><br>1. Chronic stress is a combination of stress factors that builds up over time, eroding our resilience and ability to work or function effectively. This type of stress is dealt with below in the beginner?s lesson.<br><br>Traumatic stress results from directly experiencing, or being otherwise closely exposed to, traumatic events or incidents that are life- threatening or involve physical and emotional loss. It is dealt with in the Advanced lesson <br><br>Post-traumatic stress is prolonged stress which can occur months or even years after an event. It is dealt with in the Expert lesson.<br><br>People who have been trained about stress responses often react better under stress because they understand what is happening to them.</p><p>Each person will experience stress differently and therefore must manage their stress in their own way. Stress management varies by culture, gender, personality, identity and many other factors.</p>",
		"category": "Personal",
		"subcategory": "Stress",
		"difficulty": "Beginner"
	},
	{
		"title": "Chronic Stress - Causes",
		"body": "<h1>Chronic Stress - Causes</h1><p>Chronic (or cumulative) stress occurs regularly among aid workers and activists, yet often goes unrecognised or unreported.</p><p>With healthy levels of stress, symptoms are generally mild and temporary ? people return to normal functioning when the stress factor is removed. If exposure to stress is excessive or long-term however, symptoms can persist and multiply, resulting in chronic or cumulative stress. Not only is this worse for the body physically and mentally, but chronic stress can also erode coping mechanisms.</p><p>Chronic stress builds slowly and may be hard to notice in yourself or others. If not properly managed, chronic stress can lead to burnout.</p>",
		"category": "Personal",
		"subcategory": "Stress",
		"difficulty": "Beginner"
	},
	{
		"title": "Effects",
		"body": "<h1>Effects</h1><p>There is a wide range of possible symptoms of negative stress, and people differ in terms of the symptoms they exhibit.<p></p><ul><li>Physical symptoms may include:<ul><li>Exhaustion</li><li>Hyperactivity</li><li>Sleeping difficulties or excessive sleep</li><li>Slight flu-like symptoms</li><li>Headaches</li><li>Heightened blood pressure and heart rate</li><li>Nausea or vomiting</li></ul></li><li>Behavioural symptoms may include:<ul><li>Avoiding genuine social contact and relationships</li><li>Substance abuse (caffeine/ alcohol/ drugs)</li><li>A series of short and casual romantic/sexual relationships</li><li>Risk-taking</li><li>Withdrawal</li><li>Irritability or a constant tendency to pick quarrels</li><li>Aggression</li></ul></li><li>Work-related symptoms may include: <ul><li>Working very long hours</li><li>Lateness/ not coming in to work</li><li>Lack of concentration</li><li>Poor work performance</li><li>Loss of perspective</li><li>Pre-occupation with an idea, even if it is old or ineffective</li><li>Deterioration in judgment and logical thinking</li><li>Reduced creativity</li><li>Deteriorating communication</li></ul></li><li>Emotional effects may include:<ul><li>Low morale</li><li>Pessimism and cynicism</li><li>Anxiety</li><li>Guilt</li><li>Depression</li><li>Excitement/hyper-activity</li><li>A feeling of power and invulnerability</li><li>Intense identification with, OR lack of compassion for those you work with</li><li>Nightmares or flashbacks</li><li>Tendency to avoid/repress intense thoughts or feelings</li><li>Questioning of major life areas</li></ul></li></ul></p><p>Engaging in some of these types of behaviours are security risks in and of themselves, so it is very important to both the individual affected and your organisation that it is dealt with properly.</p>",
		"category": "Personal",
		"subcategory": "Stress",
		"difficulty": "Beginner"
	},
	{
		"title": "Dealing with it - For Individuals",
		"body": "<h1>Dealing with it - For Individuals</h1><p>Stress management is an individual process. There is no one best set of techniques. For stress management to be effective, it must be consistent and comprise the techniques that work best for each person.</p><p>It is important to recognise that it is impossible to take care of others if you do not take care of yourself.</p><p><ul><li><b>Learn about stress.</b> Be aware of the signs and symptoms of stress.</li><li><b>Know yourself.</b> Learn to observe your feelings and attitudes before trying to control your behavior.</li><li><b>Eat well and exercise.</b> Establish a regular exercise program and stick to it. Beneficial exercise for stress reduction includes deep breathing and muscle relaxation exercises. Keep a healthy diet and eat regularly.</li><li>?<b>Get rest and relaxation.</b> Get adequate, regular sleep. Maintain your normal routines for relaxation, such as hobbies, reading, etc.</li><li><b>Practice belief systems.</b> Maintain spiritual health consistent with your personal beliefs.</li><li><b>Maintain a sense of humour and perspective.</b> Try to have contact with others outside of the work environment.</li><li><b>Be informed.</b> Knowledge of the work situation and environment provides an effective way of checking rumors and immediately addressing concerns.</li><li>?<b>Talk to people.</b> Sharing a problem with others may help you find a solution and will make you feel less isolated. If unable to talk to others about your feelings, keep a journal or diary or write letters.</li><li><b>Change a stressful environment as much as possible.</b> Refuse to see yourself as a helpless victim of circumstance. When faced with a difficult situation, identify the problem, think of alternatives, evaluate the alternatives, and finally select and implement the best alternative.</li><li><b>Think positive!</b></li></ul>",
		"category": "Personal",
		"subcategory": "Stress",
		"difficulty": "Beginner"
	},
	{
		"title": "Dealing with it - For Managers",
		"body": "<h1>Dealing with it - For Managers</h1><p>In volatile environments, expectations of managers can often be unrealistic ? both in terms of the volume of tasks and the level of skill with which they need to be performed. The level of responsibility can be a significant source of stress, especially when it does not stop at night, or on weekends or holidays. All staff need to feel that their managers are strong, solid and reliable and a source of stability. A manager who shows signs of severe stress, or who continues in post although burned out, is likely to demoralise his or her staff. The following tactics can help managers to cope with their own stress and reduce that of their staff.</p><img src=\"stress2.png\"><p><ul><li><b>Acknowledge your own limitations, to yourself and to your staff.</b> Admitting that you too are not immune to stress does not need to undermine your authority if you are managing according to principles and arguments that are defendable.</li><li><b>Develop a good relationship with your own manager.</b> Ask them to come and experience at close hand the realities you are facing, and ask them to protect you from unnecessary pressures from HQ.</li><li><b>Delegate.</b> Share tasks with your staff or try to create a senior management team around you that shares responsibility, although you remain the ultimate decision-maker. Insist on appointing a high-quality person when the post needs to be filled.</li><li><b>The ?buddy system?.</b> Find a sounding board or possibly a buddy in one of your peers from another agency. Staff members may agree in advance to monitor each other?s reactions to identify signs of excessive stress and fatigue levels.</li><li><b>Recognition of individual staff efforts.</b> Express appreciation on a regular basis. People do better in difficult situations when they feel that other people care about them. Provide constructive feedback to build self-confidence when addressing problem areas.</li><li><b>Regular time off for all staff.</b> During periods of heavy workloads or in times of crisis, it is common for staff to attempt to work all day, every day. This can quickly lead to burnout. Many staff members need to be given permission to take care of themselves. Providing an afternoon off to a staff member who is obviously stressed ? and therefore often ineffective - can improve productivity in the long term. In emergency response situations, regular rotation of staff out of the hostile area every three to four weeks can help prevent build-up of excess stress.</li><li><b>Provide a good example.</b> Demonstrate proper stress management by eating properly, resting and taking appropriate time off.</li></ul></p>",
		"category": "Personal",
		"subcategory": "Stress",
		"difficulty": "Beginner"
	},
	{
		"title": "What now?",
		"body": "<p>Swipe right for this lesson's checklist</p><p>Go to the Advanced Lesson for advice on how to deal with traumatic stress.</p><a href=\"umbrella://lesson/stress/1\" class=\"button yellow\">Go to Advanced Lesson</a><p>Go to the Expert Lesson for advice on how to deal with post-traumatic stress.</p><a href=\"umbrella://lesson/stress/2\" class=\"button purple\">Go to Expert Lesson</a><h3>FURTHER READINGS</h3><p><ul><li><a href=\"www.odihpn.org/download/gpr_8_revised2pdf\">Good Practice Review Number 8: Operational security management in violent environments (Revised Ed.)</a></li><li><a href=\"ngolearning.org/courses/availablecourses/CARE%20Safety%20Course/Shared%20Documents/English_CARE_International_Safety_and_Security_Handbook.pdf\">CARE International: Safety & Security Handbook</a></li><li><a href=\"https://www.google.co.uk/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&uact=8&ved=0CCEQFjAA&url=http%3A%2F%2Fec.europa.eu%2Fecho%2Ffiles%2Fevaluation%2Fwatsan2005%2Fannex_files%2FECHO%2FECHO12%20-%20echo_generic_security_guide_en.doc&ei=kLxAVc6LOILuUP2SgbAE&usg=AFQjCNEXEOcbLeV24f3WolHmDwLq7KJzlQ&sig2=hbnI7wfdrGIHS7mmikBRWA\">ECHO Generic Security Guide for Humanitarian Organisations</a></li></ul></p>",
		"category": "Personal",
		"subcategory": "Stress",
		"difficulty": "Beginner"
	}
]