[
	{
		"title": "Traumatic Stress - Causes",
		"body": "<h1>Traumatic Stress - Causes</h1><p>Human rights activists do difficult and challenging work, and see a good deal of human misery. We may even be fearful for our lives at times. It is therefore important to know how to react following a traumatic event, and how to recognise the symptoms of traumatic stress. (Post-traumatic stress is dealt with in the Expert Lesson.)</p><p>Any event which is very distressing and outside of the realm of normal human experience can result in traumatic stress. Traumatic stress usually produces a very intense response, including fear and/or helplessness, which may overwhelm the individual?s coping mechanisms. Such a response is a <b>normal reaction to an abnormal situation.</b></p><img src=\"stress3.png\">",
		"category": "Personal",
		"subcategory": "Stress",
		"difficulty": "Advanced"
	},
	{
		"title": "Effects",
		"body": "<h1>Effects</h1><p>At the time of a traumatic event, the person experiencing the event might feel numb and unable to respond.</p><p>Immediately after a traumatic event, it is common for people to feel shocked, or dazed, or unable to process their own feelings.</p><p>Over several hours or days, the feelings of shock and denial gradually fade, and other thoughts and feelings take their place.</p><p>People react differently and take different amounts of time to come to terms with a traumatic event. Even so, you may be surprised by the strength of your feelings. It is normal to experience a mix of feelings.</p><p>You may feel:<ul><li><b>Frightened</b> ? that the same thing will happen again, or that you might lose control of your feelings and break down.</li><li><b>Helpless</b> ? that something really bad happened and you could do nothing about it.</li><li><b>Angry</b> ? about what has happened and with whoever was responsible.</li><li><b>Guilty</b> ? that you have survived when others have suffered or died.</li><li><b>Sad</b> ? particularly if people were injured or killed, especially someone you knew.</li><li><b>Ashamed or embarrassed</b> ? that you have these strong feelings you can't control, especially if you need others to support you.</li><li><b>Relieved</b> ? that the danger is over and that the danger has gone.</li><li><b>Hopeful</b> ? that your life will return to normal. People can start to feel more positive about things quite soon after a trauma.</li></ul></p><p>Strong feelings affect your physical health. In the weeks after a trauma, you may find that you:<ul><li>Cannot sleep</li><li>Feel very tired</li><li>Dream a lot and have nightmares</li><li>Have poor concentration</li><li>Have memory problems</li><li>Have difficulty thinking clearly</li><li>Suffer from headaches</li><li>Experience changes in appetite</li><li>Experience changes in sex-drive or libido</li><li>Have aches and pains</li><li>Feel that your heart is beating faster.</li></ul></p><p>It may take weeks for some of these feelings and symptoms to pass. Remember that these are normal reactions to extreme circumstances; they are not signs that you are weak or sick.</p>",
		"category": "Personal",
		"subcategory": "Stress",
		"difficulty": "Advanced"
	},
	{
		"title": "How you can help",
		"body": "<h1>How you can help</h1><p>What can you do straight after a trauma to help someone heal? Psychological First Aid is an important first step to support a traumatised person. It is NOT about encouraging or even forcing people to ?debrief? following a traumatic event. There should be no pressure on the affected person to recount what happened to them. It helps to provide a safe and supportive environment for people to feel secure. If they wish to share their experiences they can, but there is absolutely no obligation to do so.</p><p><ul><li>Ask someone if they require assistance. Remove the person from danger and try to keep them safe. If very distressed do not leave alone.</li><li>Ask about people?s needs. Do they need a blanket? Clothes? Medical treatment? Work with them to prioritise what they are most in need of and what is most important to them at this moment.</li><li>Listen to people and help them to feel calm.</li></ul></p>",
		"category": "Personal",
		"subcategory": "Stress",
		"difficulty": "Advanced"
	},
	{
		"title": "Coping strategies",
		"body": "<h1> Coping strategies</h1><p>Everyone has natural ways of coping. Encourage people to use their own positive coping strategies, while avoiding negative strategies. This will help them feel stronger and regain a sense of control. You will need to adapt the following suggestions to take account of the person?s culture and what is possible in the particular crisis situation.</p><p><b>Encourage Positive Coping Strategies:</b><ul><li>Get enough rest.</li><li>Eat as regularly as possible and drink water.</li><li>Talk and spend time with family and friends.</li><li>Discuss problems with someone you trust.</li><li>Do activities that help you relax (walk, sing, pray, play with children).</li><li>Do physical exercise.</li><li>Find safe ways to help others in the crisis and get involved in community activities</li></ul>.</p><p><b>Discourage Negative Coping Strategies:</b><ul><li>Don?t take drugs, smoke or drink alcohol.</li><li>Don?t sleep all day.</li><li>Don?t work all the time without any rest or relaxation.</li><li>Don?t isolate yourself from friends and loved ones.</li><li>Don?t neglect basic personal hygiene.</li><li>Don?t be violent.</li></ul></p><p>It is crucial in the weeks and months after a traumatic event to keep an eye out for changes in personal attitude (depression, frustration, etc.), as these may be signs of longer-term Post Traumatic Stress Disorder (PTSD). This is dealt with in the Expert lesson.</p>",
		"category": "Personal",
		"subcategory": "Stress",
		"difficulty": "Advanced"
	},
	{
		"title": "What now?",
		"body": "<p>Swipe right for this lesson's checklist</p><p>Go to the Beginner Lesson for advice on how to deal with chronic stress.</p><a href=\"umbrella://lesson/stress/0\" class=\"button green\">Go to Beginner Lesson</a><p>Go to the Expert Lesson for advice on how to deal with post-traumatic stress.</p><a href=\"umbrella://lesson/stress/2\" class=\"button purple\">Go to Expert Lesson</a><h3>FURTHER READINGS</h3><p><ul><li><a href=\"https://www.odihpn.org/download/gpr_8_revised2pdf\">Good Practice Review Number 8: Operational security management in violent environments (Revised Ed.)</a></li><li><a href=\"https://www.google.co.uk/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&uact=8&ved=0CCEQFjAA&url=http%3A%2F%2Fec.europa.eu%2Fecho%2Ffiles%2Fevaluation%2Fwatsan2005%2Fannex_files%2FECHO%2FECHO12%20-%20echo_generic_security_guide_en.doc&ei=kLxAVc6LOILuUP2SgbAE&usg=AFQjCNEXEOcbLeV24f3WolHmDwLq7KJzlQ&sig2=hbnI7wfdrGIHS7mmikBRWA\">ECHO Generic Security Guide for Humanitarian Organisations</a></li><li><a href=\"http://protectioninternational.org/publication/new-protection-manual-for-human-rights-defenders-3rd-edition/\">Protection International: New Protection Manual for Human Rights Defenders (3rd Ed.)</a></li></ul></p>",
		"category": "Personal",
		"subcategory": "Stress",
		"difficulty": "Advanced"
	}
]