[
	{
		"title": "Post-Traumatic Stress Disorder - Causes",
		"body": "<h1>Post-Traumatic Stress Disorder - Causes</h1><p>What happens if people don?t heal within the weeks following the trauma?</p><p>Post-Traumatic Stress Disorder (PTSD) develops in about 1 in 3 people who experience severe trauma. Certain factors such as if you or your family have had depression or anxiety in the past, or you don't receive much support from family or friends, can make you more susceptible to developing PTSD after a traumatic event.</p><p>In most cases, PTSD develops during the first month after a traumatic event. However, in a minority of cases, there may be a delay of months or even years before symptoms start to appear.</p><img src=\"stress4.png\">",
		"category": "Personal",
		"subcategory": "Stress",
		"difficulty": "Expert"
	},
	{
		"title": "Effects",
		"body": "<h1>Effects</h1><p>The specific symptoms of PTSD can vary widely between individuals, but they generally fall into the categories described below. These symptoms are often severe and persistent enough to have a significant impact on the person?s day-to-day life.</p><p><b>Re-experiencing</b><br>Re-experiencing is the most typical symptom of PTSD. This is when a person involuntarily and vividly re-lives the traumatic event in the form of flashbacks, nightmares or repetitive and distressing images or sensations. This can even include physical sensations such as pain, sweating and trembling or negative thoughts about their experience.</p><p><b>Avoidance</b><br>Trying to avoid being reminded of the traumatic event is another key symptom of PTSD. This usually means avoiding certain people or places that remind you of the trauma, or avoiding talking to anyone about your experience. Many people with PTSD try distracting themselves with work or hobbies. Some people attempt to deal with their feelings by trying not to feel anything at all, which can lead to the person becoming isolated and withdrawn.</p><p><b>Feeling 'on edge</b><br>Someone with PTSD may be very anxious and find it difficult to relax. They may be constantly aware of threats and easily startled. This state of mind is known as hyper-arousal. Hyper-arousal often leads to irritability, angry outbursts, sleeping problems (insomnia) and difficulty concentrating.</p><p><b>Other problems</b><br>Many people with PTSD also have a number of other problems, including:<ul><li>depression, anxiety and phobias</li><li>drug misuse or alcohol misuse</li><li>headaches, dizziness, chest pains and stomach aches</li><li>PTSD sometimes leads to work-related problems and the breakdown of relationships.</li></ul></p>",
		"category": "Personal",
		"subcategory": "Stress",
		"difficulty": "Expert"
	},
	{
		"title": "Dealing with it",
		"body": "<h1>Dealing with it</h1><p>It is normal to experience upsetting and confusing thoughts after a traumatic event, but in most people these will improve naturally over a few weeks. However you should visit your doctor if you are still having problems about four weeks after the traumatic experience, or if the symptoms are particularly troublesome. Your doctor may refer you to mental health specialists if they feel you would benefit from treatment.</p><p>PTSD can be successfully treated, even when it develops many years after a traumatic event. Treatment depends on the severity of symptoms and how soon they occur after the traumatic event. Any of the following treatment options may be recommended:<ul><li>Watchful waiting - waiting to see whether the symptoms improve without treatment</li><li>Psychological treatment - such as psychotherapy or trauma-focused cognitive behavioural therapy (CBT)</li><li>Antidepressant medication</li></ul></p>",
		"category": "Personal",
		"subcategory": "Stress",
		"difficulty": "Expert"
	},
	{
		"title": "What now?",
		"body": "<p>Swipe right for this lesson's checklist</p><p>Go to the Beginner Lesson for advice on how to deal with chronic stress.</p><a href=\"umbrella://lesson/stress/0\" class=\"button green\">Go to Beginner Lesson</a><p>Go to the Advanced Lesson for advice on how to deal with traumatic stress.</p><a href=\"umbrella://lesson/stress/1\" class=\"button yellow\">Go to Advanced Lesson</a><h3>FURTHER READINGS</h3><p><ul><li><a href=\"https://www.odihpn.org/download/gpr_8_revised2pdf\">Good Practice Review Number 8: Operational security management in violent environments (Revised Ed.)</a></li><li><a href=\"https://www.google.co.uk/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&uact=8&ved=0CCEQFjAA&url=http%3A%2F%2Fec.europa.eu%2Fecho%2Ffiles%2Fevaluation%2Fwatsan2005%2Fannex_files%2FECHO%2FECHO12%20-%20echo_generic_security_guide_en.doc&ei=kLxAVc6LOILuUP2SgbAE&usg=AFQjCNEXEOcbLeV24f3WolHmDwLq7KJzlQ&sig2=hbnI7wfdrGIHS7mmikBRWA\">ECHO Generic Security Guide for Humanitarian Organisations</a></li><li><a href=\"http://protectioninternational.org/publication/new-protection-manual-for-human-rights-defenders-3rd-edition/\">Protection International: New Protection Manual for Human Rights Defenders (3rd Ed.)</a></li></ul></p>",
		"category": "Personal",
		"subcategory": "Stress",
		"difficulty": "Expert"
	}
]