[
	{
		"title": "Protective Gear",
		"body": "<p>Journalists and humanitarian workers should be fully equipped with gear appropriate to the situation they are operating in. In extreme circumstances, this could involve wearing hazmat suits, carrying detectors, or ingesting oral tablets to block or act against possible biological, chemical, or nuclear agents. In combat zones, it would involve wearing body armor rated to withstand shrapnel and high-powered bullets. In cases of street clashes or violence, it could mean wearing an inconspicuous anti-stab vest.</p>",
		"category": "Personal",
		"subcategory": "Protective Equipment",
		"difficulty": "Advanced"
	},
	{
		"title": "Operating in Warzones",
		"body": "<p>Human rights defenders requiring body armor should choose a vest according to the expected threat. The U.S. National Institute of Justice has developed a six-tier rating system used by most manufacturers around the world. If you are covering armed conflict, you should choose a vest rated to stop high-velocity bullets fired by military rifles. Be aware, however, that no vest is completely bulletproof. One may still be severely injured or die from the trauma of blunt impact, even if the body armor does stop the projectile. Consider gender-specific designs and whether you require options such as side or groin protectors.</p><p>Helmets are also recommended for journalists or humanitarian workers in war zones. Recognise, however, that even a top- rated helmet mainly provides protection against shrapnel, and is likely to be penetrated by any direct hit from a bullet fired by an assault or sniper rifle.</p>",
		"category": "Personal",
		"subcategory": "Protective Equipment",
		"difficulty": "Advanced"
	},
	{
		"title": "Embedded With Military",
		"body": "<p>Wear body armor whenever you are embedded with military forces. Body armor products are periodically updated as newer, lighter, and more reliable materials are developed. You will need to be mindful that different products may require different care. Ceramic plates may crack or break if they are dropped. Kevlar can deteriorate if it gets wet. Human sweat can degrade Kevlar and other products. Used body armor must be examined very carefully for signs of wear or weakening of fiber. All body armor must be properly stored and periodically inspected. </p>",
		"category": "Personal",
		"subcategory": "Protective Equipment",
		"difficulty": "Advanced"
	},
	{
		"title": "Civil Unrest",
		"body": "<p>Protective gear is also available in situations of civil unrest. Lightweight and relatively thin anti-stab vests can provide protection against knife attacks, rubber bullets, and other hazards. Baseball-style caps with metal plates are also available. Gas masks may also be worn, although in doing so journalists or humanitarian workers incur the risk that they could be mistaken for either riot police or demonstrators.</p>",
		"category": "Personal",
		"subcategory": "Protective Equipment",
		"difficulty": "Advanced"
	},
	{
		"title": "What now?",
		"body": "<p>Swipe right for this lesson?s checklist</p><p>Go to the Beginner lesson for advice on what to pack in a grab bag.<a href=\"umbrella://lesson/protective/1\" class=\"button green\">Go to Beginner Lesson</a></p><h3>RELATED LESSONS/TOOLS</h3><p><ul><li>Checkpoints lesson</li></ul></p><h3>FURTHER READINGS</h3><p><ul><li><a href=\"https://cpj.org/reports/2012/04/armed-conflict.php\">Committee to Protect Journalists)</a></li></ul></p>",
		"category": "Personal",
		"subcategory": "Protective Equipment",
		"difficulty": "Advanced"
	}
]