[
	{
		"title": "TextSecure",
		"body": "<h1>TEXTSECURE TOOL GUIDE</h1><h2>TextSecure Tool Guide <br>Secure messaging for Android</h2><p><b>Lesson to read: <br>? <a href=\"umbrella://lesson/sending-a-message\">Sending a message</a></b><br><b>Download Location:</b> TextSecure can be downloaded from <a href=\"https://whispersystems.org/\">Open WhisperSystems</a>; and can also be downloaded from the <a href=\"https://play.google.com/store/apps/details?id=org.thoughtcrime.securesms\">Google Play store</a><br><b>Computer requirements:</b> Android 2.3 and up<br><b>Version used in this guide:</b>  TextSecure 2.1.7<br><b>License:</b> GPLv3<br><b>Level:</b> Beginner - Intermediate<br><b>Other reading: </b><br>? <a href=\"https://github.com/WhisperSystems/TextSecure/wiki/Using-TextSecure\">https://github.com/WhisperSystems/TextSecure/wiki/Using-TextSecure</a><br>? <a href=\"https://securityinabox.org/en/textsecure_main\">https://securityinabox.org/en/textsecure_main</a><br>? <a href=\"http://support.whispersystems.org/\">http://support.whispersystems.org/</a><br><b>Time required:</b> 15 minutes</p><p><b>Using TextSecure will give you:</b><br>? The ability to send confidential messages with your mobile phone using end-to-end encryption</p><h3>1.0 Before you start</h3><p>NOTE: TextSecure works over a Wi-Fi or data connection. While the current version can also be used to send SMS if such a connection is unavailable, <b>this function will shortly be removed due to security concerns and future versions will work over the internet only.</b></p><p>Messages in blue are sent over a data connection, while those in green have been sent over SMS. </p><p>TextSecure can also currently be used to send SMS to non-TextSecure users, however, those messages will not be encrypted in transit. Encrypted text messages are marked with a small lock. </p><p>Both sides have to be using TextSecure for the messages to be secure while they travel over the Internet. </p><p>You can set up a passphrase that will encrypt these conversations when they are stored on your local phone. This means that they are better protected against being read if your phone is seized or compromised.</p><p>TextSecure is available in more than 30 languages. You can change the language of the app by selecting ?Settings? then ?Language.?</p><h3>2.0 How to install TextSecure</h3><p><b>Step 1:</b> Download and install TextSecure</p><p>On your Android phone, enter the Google Play store and search for ?TextSecure.? Select the app, ?TextSecure Private Messenger.?</p><p>Select ?Install? and accept the Terms of Service by selecting ?Accept.? The app will download and install automatically.</p><img src=\"tool_textsecure1.png\"><p><b>Step 2:</b> Create a passphrase to encrypt data locally</p><p>Open the app. You will be prompted to create a passphrase in order to locally encrypt your data. This means that your data will be encrypted in transit, and that your messages will also be encrypted locally on your phone. If you choose to skip this step, your messages will still be encrypted in transit, but will not be protected on your device. For more information on selecting a strong passphrase, see the <b><a href=\"umbrella://lesson/passwords\">Passwords Lesson</a></b>. </p><img src=\"tool_textsecure2.png\"><p><b>Step 3 (optional):</b> Import existing text messages</p><p>You will then be asked if you would like to import your existing text messages into TextSecure?s encrypted database. This is up to you: It simply means that old text messages (SMS) will be imported into the TextSecure app and encrypted.</p><p><b>Step 4 (optional):</b> Register your phone with TextSecure</p><p>The next screen will prompt you to ?Connect with TextSecure? by registering your mobile phone number with TextSecure. This will allow you to avoid SMS charges in some cases when communicating with other TextSecure users. This is an optional step. Once you have registered your phone, TextSecure will automatically verify your number using a text message.</p><h3>3.0 Verifying Keys</h3><p>TextSecure uses end-to-end encryption. When you first send a message to another contact that uses the app, the app will initiate a key exchange message with the other user.</p><p>You will want to verify keys with the other user (for more information, view the EFF module on <a href=\"https://ssd.eff.org/en/node/37/\">Key Verification</a>). To view the keys, click on the padlock icon in the top right of the screen and select ?Verify Identity.? You will be shown two sets of keys: one belonging to you and one belonging to the other user.</p><p>TextSecure supports manual verification or verification by scanning the other user?s barcode. If you are in the same room as the other person, you can easily scan the barcode on their phone (reachable by clicking on the lock icon on the menu bar at the top of your conversation, selecting ?verify identity? and then clicking on the barcode icon) or read your keys aloud to one another.</p><p>If you are not in the same room, there are different ways to verify keys with varying degrees of trustworthiness. For example, you can read your keys aloud to one another on the phone if you recognize one another?s voices or send them using another verified method of communication such as PGP or OTR.</p>",
		"category": "Tools"
	}
]