[
	{
		"title": "ObscuraCam",
		"body": "<h1>OBSCURACAM TOOL GUIDE</h1><h2>ObscuraCam Tool Guide</h2> <p><b>Lesson to read:</b> <br>? <a href=\"umbrella://lesson/mobile-phones\">Mobile Phones</a><br>? <a href=\"umbrella://lesson/social-media\">Social Media</a><br><b>Download Location:</b> <a href=\"https://guardianproject.info/apps/obscuracam/\">ObscuraCam homepage</a><br><b>Phone requirements:</b> Android 2.3.3 and up<br><b>Version used in this guide:</b> 2.0-RC2b<br><b>License:</b> Free and Open Source Software (GPL v3)<br><b>Level:</b> Basic<br><b>Time required:</b> 5 minutes</p><p><b>Using ObscuraCam will give you:</b><br>? The ability to obscure identities by hiding faces in photos taken with your Android device<br>? An easy way to share or save these \"obscured\" photos</p><h3>1.1 Things you should know about this tool before you start</h3><p>? ObscuraCam's automatic face-recognition does not <i>always</i> work, but you can easily select and obscure faces manually.<br>? On some versions of the Android operating system, the option to delete the original media file does not work. If you rely on this option, please check to make sure that you do not have ObscuraCam photos (with visible faces!) somewhere on your device.<br>? If you use ObscuraCam to send photos to yourself or to someone else, the tool does not provide additional protection (such as end-to-end encryption) for the photo in transit.<br>? A tag is an area in the photo which has been obscured by one of several methods ObscuraCam can use.</p><h3>2.0 How to Install ObscuraCam</h3><p><b>Step 1.</b> On your Android device, download and install the app from the <a href=\"https://play.google.com/store/apps/details?id=org.thoughtcrime.securesms\">Google Play store here</a> by tapping ?Install?.</p><img src=\"tool_obscura1.png\"><p><b>Step 2:</b> Before the installation process begins, you will be prompted to review the access that the application will have on your phone. Review this carefully. Once you are happy with the permissions that will be granted, press ?Accept? and the installation will complete. If you do not agree with the permissions that will be granted, press the back button and the installation will be cancelled.</p><p><b>Step 3. Tap</b> Open to run the app for the first time</p><p><b>Step 4:</b> Review the Terms of use and if you are happy with them press ?Accept? to be brought to the main screen of ObscuraCam. </p><h3>2.1 Using ObscuraCam to obscure photos</h3><p>You can use ObscuraCam to hide some or all of the faces that appear in your photos. It works on pictures that you take with the ObscuraCam app itself, but you can also blur faces in other photos, as long as you have a way to copy or move the image files onto your Android device.</p><h3>2.1 Taking And Obscuring New Photos</h3><p>To take a photo on your Android device without showing your subjects' faces, perform the following steps:</p><p><b>Step 1:</b> From the main screen of ObscuraCam tap ?New Picture?.</p><img src=\"tool_obscura2.png\"><p><b>Step 2:</b> Your phone's camera app will open, take a photo as you normally would.</p><p><b>Step 3:</b> A screen with a preview of the photo you took will be displayed. Tap the tick to proceed with obscuring the photo, otherwise tap the x to discard the current photo and take another.</p><p><b>Step 4:</b> ObscuraCam** will attempt to identify faces automatically.</p><p><b>Step 5:</b> If ObscuraCam can detect faces in the photo it will add an image \"tag\" (a rectangle used to select content that should be hidden) over the face and pixelate it. If ObscuraCam did not detect any faces or you need to obscure additional areas on the photo, tap on the area to add additional tags.</p><img src=\"tool_obscura3.png\"><p><b>Step 6:</b> To see a preview of the photo you can tap the eye icon, to return to the edit screen tap anywhere on the preview image.</p><p><b>Step 7:</b> To share the obscured photo via an existing application on your phone such as K-9 Mail or TextSecure tap the icon made up of a dot with arrows. </p><p><b>Step 8:</b> To save the blurred photo to your phone tap the save icon. You will be asked whether you want to delete the original, unblurred, image from your phone, if you no longer need the original photo tap ?Yes? otherwise tap ?No? to save a copy of both the obscured and unobscured photo.</p><h3>2.1.2 Obscuring Existing Photos</h3><p>As well as obscuring photos as you take them, ObscuraCam can also obscure any old photos on your phone or that you copy to your phone.</p><p><b>Step 1:</b> From the main screen of ObscuraCam tap ?Obscure Photo?.</p><p><b>Step 2:</b> Browse to the file on your phone that you want to obscure.</p><p><b>Step 3:</b> ObscuraCam will attempt to detect any faces in the image and pixelate them.</p><p><b>Step 4:</b> If ObscuraCam did not detect any faces or you want to obscure additional faces or items in the photo tap the relevant area to add additional pixelation.</p><p><b>Step 5:</b> To see a preview of the photo you can tap the eye icon, to return to the edit screen tap anywhere on the preview image.</p><p><b>Step 6:</b> To share the obscured photo via an existing application on your phone such as K-9 Mail or TextSecure tap the icon made up of a dot with arrows. </p><p><b>Step 7:</b> To save the blurred photo to your phone tap the save icon. You will be asked whether you want to delete the original, unblurred, image from your phone, if you no longer need the original photo tap ?Yes? otherwise tap ?No? to save a copy of both the obscured and unobscured photo.</p><h3>2.3 Modifying the \"blur\" mode</h3><h3>2.3.1 Resize or move the tag</h3><p>While editing a photo in ObscuraCam, if you need to resize the tag, touch one of the four corners of the white outline box so that it turns green and drag it to make it larger or smaller.</p><p>If you need to move the tag so that it is in a better position on the photo, touch the centre of the pixelated area so that the surrounding white box turns green, then drag the box to the location you want.</p><img src=\"tool_obscura4.png\"><h3>2.3.2 Change the obscure type</h3><p>ObscuraCam gives you a few options on how to obscure a photo. From the edit screen tap on an existing obscured area to bring up the obscuring options:</p><img src=\"tool_obscura5.png\"><p><b>Pixelate</b> will obscure any part of the photo inside the tag by pixelating it</p><img src=\"tool_obscura6.png\"><p><b>Redact</b> will obscure any part of the photo inside the tag by placing a black box over it</p><img src=\"tool_obscura7.png\"><p><b>Mask</b> will obscure any part of the photo inside the tag by placing a funny mask over the person</p><img src=\"tool_obscura8.png\"><p><b>Crowd Pixel</b> will obscure any part of the photo <i>outside</i> the tag by pixelating the rest of it.</p><img src=\"tool_obscura9.png\"><p><b>Clear Tag</b> will remove the selected tag from the photo.</p><h3>2.3 Obscuring Videos</h3><p>Obscuracam can also obscure faces or objects in videos, however unlike with photos it can only obscure existing photos that you took with your phone or copied to your phone</p><h3>2.3.1 Automatic Obscuring of Videos</h3><p><b>Step 1:</b> From the main screen of Obscuracam tap ?Obscure Video?.</p><p><b>Step 2:</b> Select the video you with to obscure from your phones storage</p><p><b>Step 3:</b> Tap ?Yes? when asked <i>Would you like to detect faces in this video</i>.</p><p><b>Step 3:</b> The video will begin to play and ObscuraCam will attempt to detect faces. The process for detecting faces takes approximately <i>4 seconds</i> for every <i>1 second</i> of the video.</p><p><b>Step 4:</b> Once the face detection has completed, you can tap Play to review the video. This will show you the pixelated tags over the faces as well as a green trail showing the path the tag takes through the video as the face moves.</p><img src=\"tool_obscura10.png\"><p><b>Step 5:</b> After reviewing the video and you are happy that all faces are obscured, tap the save icon at the top of the screen to save the video to your phones storage.</p><img src=\"tool_obscura11.png\"><p><b>Note:</b> If ObscuraCam did not properly obscure faces or failed to detect some, you can see how to manually obscure them in section below.</p><h3>2.3.2 Manual Obscuring of Videos</h3><p>If ObscuraCam was not able to detect faces properly during the automatic process or you would like more process over the obscuring process you can manually obscure video.</p><p><b>Step 1:</b> From the main screen of Obscuracam tap ?Obscure Video?.</p><p><b>Step 2:</b> Select the video you with to obscure from your phones storage.</p><p><b>Step 3:</b> Tap ?No? when asked <i>Would you like to detect faces in this video</i>.</p><p><b>Step 4:</b> Tap the play icon to start playing the video</p><p><b>Step 5:</b> While the video plays, touch and hold your finger on a face in the video to add a tag over it, drag the tag around the screen with your finger following the movement of the face. Lift your finger off the screen to stop obscuring the video.</p><p><b>Note:</b> As you follow the face on the screen you will see a green trail being left behind, this is the path the pixelated tag will take once the video is saved.</p><p><b>Step 6:</b> If there are additional faces in the video that you wish to obscure, touch and hold the blue circle and move the slider back to the time point where the next face appears on video and repeat <i>step 5</i> above.</p><p><b>Step 7:</b> Once you have finished manually obscuring faces, you can tap the play icon to review the video. This will show you the pixelated tags over the faces as well as a green trail showing the path the tag takes through the video as the face moves.</p><p><b>Step 8:</b> After reviewing the video and you are happy that all faces are obscured, tap the save icon at the top of the screen to save the video to your phones storage.</p><h3>2.3.3 Changing Output Video Quality</h3><p>ObscuraCam chooses a default video quality when saving that make the video small enough to easily share via email or other methods but does reduce resolution and quality of the video.</p><p>To keep the obscured video in a higher resolution:</p><p><b>Step 1:</b> After either automatically or manually detecting faces and before saving the video, tap the three vertical dots icon to bring up the menu and select ?Preferences?.</p><p><b>Step 2:</b> Review and change the settings you want, where possibly ObscuraCam will give you the range by which each setting can be changed.</p><img src=\"tool_obscura12.png\"><p><b> Step 3:</b> Once you have made the desired output changes, tap the back button on your phone and save the video.</p>",
		"category": "Tools"
	}
]