[
	{
		"title": "Cobian Backup",
		"body": "<h1>COBIAN BACKUP TOOL GUIDE</h1><h2>Cobian Backup<br>Backing up your computer files</h2><p><b>Lesson to read: <a href=\"umbrella://lesson/backing-up\">Backing Up</a></b><br><b>Download Location:</b> <a href=\"http://www.cobiansoft.com/cobianbackup.htm\">http://www.cobiansoft.com/cobianbackup.htm</a><br><b>Computer requirements:</b> <br>? XP, 2003, Vista, 2008, Windows 7<br>? Windows 95, 98 and ME are compatible with Cobian version 7.<br><b>Version used in this guide:</b> Cobian 10<br><b>License:</b> Freeware<br><b>Level:</b>  Intermediate<br><b>Time required:</b> 30 minutes</p><h3>1. Things you should know about this tool before you start</h3><p>Cobian Backup is used to archive, (or to make a backup copy) of your files and directories. Backups can be stored in other directories or drives on your computer, other computers on the office network, or on removable devices (CDs, DVDs and USB memory sticks). Cobian Backup lets you archive your directories and files on a regular basis. It works silently in the background on your system (that is, in the system tray), checking your schedule and executing the backup process when necessary. Cobian Backup can also compress and encrypt files as it generates the backup file.</p><p>? Using Cobian will give you:<br>? The ability to back up all documents, files and folders<br>? The ability to compress and decompress your backup files<br>? The ability to encrypt and decrypt your archived files</p><p><b>Installing Cobian ? in brief</b><br>? Open www.cobiansoft.com/cobianbackup.htm<br>? Click on the link \"Download Cobian Backup\" on the page.<br>? Save the installer, then find it and doubleclick it<br>? Read the 'Installation Note' below before you continue<br>? After you have successfully installed Cobian you may delete the installation program from your computer.</p><h3>2.0 How to Install Cobian Backup</h3><p><b>Installation Note:</b> Before you begin the installation process, verify that you have both the latest versions of the <b>Microsoft Windows Installer</b> and the <b>Microsoft.NET Framework</b>.</p><p>Installing Cobian Backup is a relatively easy and quick procedure. </p><p><b>Step 1.</b> Double click ?cbsetup.exe?; the <i>Open File - Security Warning</i> dialog box may appear. If it does, click ?Run? to activate the light blue <i>Extracting the resource</i> progress status bar, followed a few moments later by the following screen:</p><img src=\"tool_cobian1.png\"><p><b>Step 2.</b> Click ?Next? to activate the <i>Please read and accept the license agreement screen</i> check the <i>I accept</i> option, and then click ?Next? again to activate the following screen:</p><img src=\"tool_cobian2.png\"><p><b>Step 3.</b> Click ?Next? to activate the following screen:</p><img src=\"tool_cobian3.png\"><p><b>Step 4.</b> Check the <i>Use Local System account</i> option in the <i>Service options</i> pane, so that your own resembles Figure 3 above. This option ensures that Cobian Backup will be running silently in the background all the time, so that your backups will occur as scheduled.</p><p><b>Step 5.</b> Click ?Next? to activate the following message prompt:</p><img src=\"tool_cobian4.png\"><p><b>Step 6.</b> Click ?Yes? to activate the next installation screen, and then click ?Next? to continue with the installation process.</p><p><b>Step 7.</b> Click ?Done? to complete the installation process. After the installation process has been completed, the Cobian Backup icon will appear in the <b>Windows System Tray</b>.</p><h3>2.1 How to Backup Your Directories and Files</h3><p>In this section you will learn how to perform a simple backup or archive of a specified files and/or folders. Cobian Backup uses a <i>backup task</i> which can be configured to include a specified group of files and/or folders. A backup task can be set to run on a specified day and time.</p><p>To create a new backup task, perform the following step:</p><p><b>Step 1.</b> Click ?Schedule? to create a new backup task, and activate the <i>New task</i> window as follows:</p><img src=\"tool_cobian5.png\"><p>The left sidebar lists a number of tabs and their associated screens - used to set different backup options and parameters - are displayed in the pane at right. All the options in the <i>General</i> tab are described below:</p><h3>2.1.1 Option Descriptions</h3><p><i>Task Name:</i> This <i>Task Name</i> text field lets you enter a name for the backup task. Use a name that identifies the nature of the backup. For example, if the backup is going to contain video files, you could name it <i>Video Backup</i>.</p><p><i>Disabled:</i> This option <i>must</i> be left unchecked.<br>Warning: Enabling the <i>Disabled</i> option will override the rest of the options, and prevent the backup task from running.</p><p><i>Include Subdirectories:</i> This option lets you include all the subdirectories/folders within a selected directory/folder for the backup task. This is an efficient method for backing up a large number of folders and/or files. As an example, if you select the <i>My Documents</i> folder and check this option, then all files and folders in <i>My Documents</i> will be included in the backup task.</p><p><i>Create separated backups using timestamps:</i> This option lets you specify that the date and time of the backup task will be automatically included in the folder name containing your backup file. This is a good idea because it means that you will easily be able to identify when the backup was performed.<br><i>Use file attribute logic:</i> This option is only relevant when you choose to perform an incremental or differential backup (see below). File attributes contain information about the file.</p><p><b>Note:</b> The following option is only available for Windows OS versions more recent than <i>and</i> including Windows XP.</p><p><i>Use Volume Shadow Copy:</i> This option lets you backup files which are locked.<br>Cobian Backup verifies this information to determine whether there has been a change in the source file from the last time a backup was performed. If you then run an <i>Differential</i> or <i>Incremental</i> backup, the file will be updated.</p><p><b>Note:</b> You will only be able to run a full or 'dummy backup' if you <i>disable this option</i> (the dummy backup option is explained below).</p><h3>2.1.2 Backup type Descriptions</h3><p><i>Full:</i> This option means that every single file in the source location will be copied to your backup directory. If you have enabled the <i>Create separated backups using timestamp</i> option, you will have several copies of the same source (identified by the time and date of the backup in the folder title). Otherwise, Cobian Backup will overwrite the previous version (if any).</p><p><i>Incremental:</i> This option means the program will verify if the files selected for backup have been changed since the last backup was performed. If there has been no change, it will be skipped over during the backup process, saving backup time. The <i>Use file attribute logic</i> option needs to be checked in order to perform this backup.</p><p><i>Differential:</i> The program will check if the source has been changed from the last <b>full</b> backup. If there is no need to copy that file, it will be skipped, saving backup time. If you have run a full backup before on the same set of files, then you can continue backing it up, using the Differential method.</p><p><i>Dummy task:</i> You can use this option to get your computer to run or shut down programs at certain times. This is a more advanced option which is not really relevant to our basic backup procedure.</p><p><b>Step 2.</b> Click ?OK? to confirm your search options and parameters for your backup task.</p><h3>2.2 How to Create a Backup File</h3><p>To begin creating a backup file, perform the following steps:</p><p><b>Step 1.</b> Click ?Files? in the left sidebar of the <i>New task</i> window to display a <i>blank</i> version of the following screen:</p><img src=\"tool_cobian6.png\"><p><b>Step 2.</b> Select the files you want to back up. (In <i>Figure 3</i> above, the <i>My Documents</i> folder is selected.)</p><p><b>Step 3.</b> Click ?Add? in the <i>Source</i> pane to activate the <i>Directory</i> menu.</p><p><b>Step 4.</b> Select <i>Directory</i> if you want to back up an entire directory, and <i>Files</i> to back up individual files. To specify individual files or directories to be backed up, select <i>Manually</i>, and type in the file path or directory for your backup.</p><p><b>Note:</b> You can add as many files or directories as you like. If you wish to back up files currently on your FTP server, choose the FTP site option (you will need to have the appropriate server login details).</p><p>When you have selected the files and/or folders, they will appear in the <i>Source</i> area. As you can see in <i>Figure 3</i> above, the <i>My Documents</i> folder is displayed there, meaning this folder will now be included in the backup task.</p><p>The <i>Destination</i> pane specifies where the backup will be stored.</p><p><b>Step 5.</b> Click ?Add? in the <i>Destination</i> pane to activate the Directory menu.</p><p><b>Step 6.</b> Select <i>Directory</i> to open a browser window where you select the destination folder for your backup file.</p><p><b>Note:</b> If you want to create several versions of the backup file, you may specify several folders here. If you selected the <i>Manually</i> option, you must type in the full path to the folder where you want to keep the backup. To use a remote Internet server to store your archive, select the FTP site option (you will need to have the appropriate server login details).</p><p>The screen should now resemble the example above example with file(s) and/or folder(s) in the source area and folder(s) in the destination area. However, don't click <i>OK</i> just yet! You still need to set a schedule for your backup.</p><h3>2.3 How to Schedule Your Backup Task</h3><p>For your automatic backup to work, you need to fill in the <i>Schedule</i> section. This section lets you specify when you want the backup to be performed.<br>To set the schedule options, perform the following steps:</p><p><b>Step 1.</b> Select ?Schedule? from the left sidebar, to activate the following pane:</p><img src=\"tool_cobian7.png\"><p>The <i>Schedule type</i> options are listed in the drop-down menu, and described below:</p><p><i>Once:</i> The backup will be done once only at the date and time specified in the <i>Date/Time</i> area.</p><p><i>Daily:</i> The backup will be done every day at the time specified in the <i>Date/Time</i> area.</p><p><i>Weekly:</i> The backup will be done on the days of the week selected. In the example above, the backup will be done on Fridays. You may select other days also. The backup will be done on all days selected at the time specified in the <i>Date/Time</i> area.</p><p><i>Monthly:</i> The backup will be done on the days typed into the days of the month box at the time specified in the <i>Date/Time</i> area.</p><p><i>Yearly:</i> The backup will be done on the days typed into the days of the month box, during the month specified, and at the time specified in the <i>Date/Time</i> area.</p><p><i>Timer:</i> The backup will be done repeatedly at intervals specified in the Timer text box in the <i>Date/Time</i> area.</p><p><i>Manually:</i> You will have to run the backup yourself from the main program window.</p><p><b>Step 2.</b> Click ?OK? to confirm the options and settings for the backup schedule as follows:</p><img src=\"tool_cobian8.png\"><p>Once you have decided on a backup schedule, you have completed the final step. The backup will now run on the folders specified according to the schedule you have chosen.</p><h3>3.0 How to Compress Your Backup File</h3><p><b>Step 1.</b> Create a backup task as documented in section 2.3, containing the backup files you want to archive.</p><p><b>Step 2.</b> Select ?Archive? from the left sidebar to activate the <i>New task</i> screen as follows:</p><img src=\"tool_cobian9.png\"><p>The <b>Compression</b> pane is used to specify the method for compressing your backup.</p><p><b>Note:</b> Compression is used to reduce the amount of space for file storage. If you have a bunch of old files that you use only occasionally, but you still want to keep, it would make sense to store them in a format where they take up as little space as possible. Compression works by removing a lot of unnecessary coding out of your documents, while leaving important information intact. Compression does not damage your original data. The files are not viewable when compressed. The process must be reversed and your files 'decompressed' when you want to view the files again.</p><p>The three sub-options in the <i>Compression type</i> drop-down list are:</p><p><i>No Compression:</i> This option does not perform any compression, as you would expect.</p><p><i>Zip Compression:</i> This option is the standard compression technique for <b>Windows</b> systems, and the most convenient. Archives once created can be opened with standard Windows tools (or you can download the <a href=\"http://www.zipgenius.it/\">ZipGenius</a> program to access them).</p><p>Selecting a compression type listed automatically enables the <i>Split options</i> section, and its corresponding drop-down list.</p><p>The <i>Split options</i> apply to storage on removable media, for example CDs, DVDs, floppy disks and USB memory sticks. The various split options will subdivide the archive into sizes that will fit onto your storage device of choice.</p><p>Example: Let's say that you are archiving a large number of files, and you want to burn them to a CD. However, your archive size turns out to be larger than 700MB (the size of a CD). The splitting function will split the archive into pieces smaller than or equal to 700MB, which you can then burn onto your CDs. If you are planning to back up onto your computer's hard disk, or the files that you want to back up are smaller than the device you plan to store them on, you can skip this section.</p><p>The following options are available to you when you click on the <i>Split options</i> drop-down list. Your choice will depend on the type of removable storage device available to you.</p><img src=\"tool_cobian10.png\"><p>? 3,5\" - Floppy disk. This option is big enough to perform backup of a small number of documents<br>? Zip - Zip Disk (check the capacity of the one you are using). You will need a special Zip Drive in your computer and the custom-made disks<br>? CD-R - CD disk (check the capacity of the one you are using). You will need a CD Writer in your computer and a CD writing program (see <a href=\"http://www.deepburner.com/\">DeepBurner Free</a> version or other <a href=\"http://www.thefreecountry.com/utilities/dvdcdburning.shtml\">disk burning tools</a>).<br>? DVD - DVD disk (check the capacity of the one you are using). You will need a DVD Writer in your computer and a DVD writing program (see <a href=\"http://www.deepburner.com/\">DeepBurner Free</a> version or other <a href=\"http://www.thefreecountry.com/utilities/dvdcdburning.shtml\">disk burning tools</a>).</p><p>If you are backing up onto several USB memory sticks you may want to set a custom size.</p><p>To do this, perform the following steps:</p><p><b>Step 1. Select</b> the <i>Custom size</i> (bytes) option, then type the size of the archive in bytes into the text field.</p><p>To give you an idea of sizes<br>? 1KB (kilobyte) = 1024 bytes - a one-page text document made in Open Office is approximately 20kb<br>? 1MB (megabyte) = 1024 KB - a photo taken on a digital camera is usually between 1 - 3 MB<br>? 1GB (gigabyte) = 1024 MB - approximately half hour of a DVD quality movie</p><p><b>Note:</b> When choosing a custom size to split your backup for a CD or DVD disk, Cobian Backup will not copy the backup to your removable device automatically. Rather, it will create your archive in those files on the computer and you will need to burn them to the CD or DVD disk yourself.</p><p><i>Password Protect:</i> This option lets you enter a password to protect the archive. Simply type, then re-type a password into the two boxes provided. When you try to decompress the archive, you will be asked for the password before the task commences.</p><p><b>Note:</b> If you want to secure your archive, you should think about using another method than a password. Cobian Backup lets you encrypt your archive. This is covered below.</p><p><i>Comment:</i> This option lets you write something descriptive about the archive, but it is not a requirement.</p><h3>3.1 How to Decompress Your Backup File</h3><p>To decompress your backup, perform the following steps:</p><p><b>Step 1. Select > Tools > Decompressor.</b></p><p>The Decompressor window appears as follows:</p><img src=\"tool_cobian11.png\"><p><b>Step 2.</b> Click on the open file icon to open a browse window to enable you to select the archive you want to decompress.</p><p><b>Step 3.</b> Select the archive (<i>.zip</i> or <i>.7x</i> file) and then click ?OK?.</p><p><b>Step 4.</b> Select a directory into which you will unpack (output) the archived file.</p><p><b>Step 5.</b> Click on the compression icon to open another window that lets you choose the folder in which to unpack the archive.</p><p><b>Step 6.</b> Select a folder, and then click ?OK?.</p><p>Use Windows Explorer to view the files that go to that folder.</p><h3>4.0 About Encryption</h3><p>Encryption may be a necessity for those wishing to keep their backup secure from unauthorised access. Encryption is the process of encoding, or scrambling, data in such a way that it appears unintelligible to anyone who does not have the specific key needed to decode the message. For more information on encryption, read the <a href=\"umbrella://lesson/protecting-files\">Protecting Files lesson</a>.</p> <h3>4.1 How to Encrypt Your Backup File</h3><p>The <i>Strong encryption</i> pane is used to specify the encryption method to be used.</p><p><b>Step 1.</b> Click the <i>Encryption</i> type drop-down box to activate its list of different encryption methods. </p><p>To keep things simple, we recommend that you choose from either the <i>Blowfish</i> or the <i>Rijndael</i> (128 bits) methods. These will provide excellent security for your archive, and let you access the encrypted data with a chosen password.</p><p><b>Step 2.</b> Select the <i>Encryption</i> type you want to use.</p><p><b>Note:</b> <i>Rijndael</i> and <i>Blowfish</i> both offer approximately the same level of security. <i>DES</i> is weaker but the encryption process is faster.</p><p><b>Step 3.</b> Type and re-type the password into the two boxes provided.</p><p>The strength of the password is indicated by the bar marked 'Passphrase quality'. The further the bar moves to the right, the stronger the passphrase. Refer to the <b><a href=\"umbrella://lesson/passwords\">Passwords lesson</a></b> for information on creating and storing strong passwords.</p><p><b>Step 4.</b> Click ?OK?.</p><h3>4.2 How to Decrypt Your Backup File</h3><p>Decrypting your backup file is easy and quick. To decrypt your backup file, perform the following steps:</p><p><b>Step 1. Select > Tools > Decrypter and Keys:</b></p><p><i>This will activate the Decrypter and Keys window as follows:</i></p><img src=\"tool_cobian12.png\"><p><b>Step 2.</b> Click ?Select? to select the archive you want to decrypt.</p><p><b>Step 3.</b> Click ?Destination? to select the folder in which to store the decrypted archive.</p><p><b>Step 4.</b> Select the same encryption type you selected earlier, in section 4.1 How to Encrypt Your Backup File, in the <i>Methods</i> drop-down list.</p><p><b>Step 4. Select</b> the appropriate encryption method (the one you used to encrypt your backup file).</p><p><b>Step 5.</b> Type your passphrase into the <i>Passphrase</i> text fields.</p><p><b>Step 6.</b> Click ?Decrypt!?</p><p>The file(s) will be decrypted to the location that you specified. If the files were also compressed, you will need to decompress them as outlined in section 3.1 How to Decompress Your Backup.</p>",
		"category": "Tools"
	}
]