[
	{
		"title": "K9 & APG",
		"body": "<h1>K9 & APG TOOL GUIDE</h1><h2>K9 & APG Tool Guide<br> Encrypted email for Android</h2><p><b>Lesson to read: <a href=\"umbrella://lesson/email\">Email</a></b><br><b>Download Location: <br>? <a href=\"http://www.thialfihar.org/projects/apg/\">APG homepage</a><br>? <a href=\"https://code.google.com/p/k9mail\">K-9 Mail homepage</a></b><br><b>Phone requirements: </b><br>? Android 1.5 or up<br>? APG must be installed before installing K-9 Mail<br><b>Version used in this guide: </b><br>? APG 1.1.1<br>? K-9 5.001<br><b>License: </b><br>? APG: Free and Open Source Software (Gnu GPL v3)<br>? K-9: Free and Open Source Software (Apache 2.0)<br><b>Other reading:  </b><br>? <a href=\"umbrella://lesson/passwords\">Passwords</a><br>? <a href=\"umbrella://lesson/mobile-phones\">Mobile Phones</a><br><b>Level:</b> Advanced<br><b>Time required:</b> 30-40 minutes</p><p><b>Using K-9 & APG will give you:</b><br>? APG can be used to encrypt, decrypt and sign emails and single files locally on your phone.<br>? When APG is used with K-9 it gives you the ability to use encrypted email easily on your phone.</p><p><b>Android Privacy Guard (APG) for Android Devices</b></p><img src=\"tool_k91.png\"><h3>1.0 How To Install APG</h3><p><b>Step 1.</b> On your Android device, download and install the app from <b><a href=\"https://play.google.com/store/apps/details?id=org.thialfihar.android.apg\">Google Play here</a></b> by pressing, ?Install?.</p><img src=\"tool_k92.png\"><p><b>Step 2:</b> Before the installation process begins, you will be prompted to review the access that the application will have on your phone. Review this carefully. Once you are happy with the permissions that will be granted, press ?Accept? and the installation will complete. If you do not agree with the permissions that will be granted, press the back button and the installation will be cancelled.</p><img src=\"tool_k93.png\"><h3>1.1 Key Management</h3><p>In order to encrypt files or messages when you first start APG, you will be asked to either import existing GPG keys or create a new public and private key on your phone.</p><img src=\"tool_k94.png\"><p><b>Note:</b> If you want to send encrypted files or messages to other people, you will either need to import their public keys or decide on a shared password.</p><h3>1.1.1 Key Management - Create Your Public And Private Keys</h3><p>If you do not already have your private and public GPG key or wish to use a separate GPG keys for your Android device you can use APG to create them.</p><p><b>Step 1:</b> When you open APG for the first time click the ?Creating your own key? button, as shown above.</p><p><b>Step 2:</b> Wait 2 - 3 minutes while your GPG keys are generated. You will be able to assign your name and email address to the key in the next step.</p><p><b>Step 3:</b> In the following screen, below:</p><p>? We strongly recommend that you protect your GPG keys with password. To do this press ?Set Passphrase? and provide strong password. See the <b><a href=\"umbrella://lesson/passwords\">Passwords lesson</a></b> on how best to do this;<br>? Fill in your <i>name, email address</i>;<br>? It is important that you set an expiry date on the GPG keys, after which time the keys can no longer be used to encrypt files.</p><img src=\"tool_k95.png\"><p><b>Step 4:</b> Once all the information is correct, tap ?Save? at the top of the screen to be brought back to the main APG screen, as shown above, where you will see a list of all your keys.</p><h3>1.1.2 Key Management - Import Keys From A File</h3><p>To use GPG keys that you created on another device or computer, or to import the public keys of your contact:</p><p><b>Step 1:</b> Copy the GPG key(s) to your Android device via USB or save them from the email that you received on the Android device.</p><p><b>Step 2:</b> In APG, click the ?Importing Keys? button.</p><p><b>Step 3:</b> On the following screen click the ?Open? button at the top of your screen to open a file browser.</p><p><b>Step 4:</b> From the file browser, select the key(s) you wish to import.</p><p><b>Step 5:</b> Review the keys you will import and tap ?Import Selected Keys? to add the GPG keys to APG. You may decide which keys you do not wish to import by deselecting appropriate checkbox for the keys.</p><img src=\"tool_k96.png\"><p><b>Step 6:</b> Once you have imported all the desired GPG keys you will be brought back to the main screen where you will see a list of all your keys.</p><img src=\"tool_k97.png\"><h3>1.1.3 Key Management - Import Keys From The Clipboard</h3><p>GPG keys can be sent in the body of an email instead of as an attachment to import such a key</p><p><b>Step 1:</b> Copy the GPG key from your email to the clipboard. The image below shows a GPG key in the body of an email.</p><img src=\"tool_k98.png\"><p><b>Step 2:</b> Open APG and expand the side menu on any APG screen by pressing ?APG? at the top left of your screen.</p><p><b>Step 3:</b> Select ?Import Keys? to bring up the import key screen.</p><p><b>Step 4:</b> Tap ?Keyserver? at the top of the screen to display the import options menu and select ?Import form clipboard?.</p><img src=\"tool_k99.png\"><p><b>Step 5:</b> Tap ?Get key from the clipboard? to copy the key from the clipboard.</p><p><b>Step 6:</b> Tap ?Import selected keys? at the bottom of the screen to finish importing the key into APG</p><img src=\"tool_k910.png\"><h3> 1.1.4 Key Management - Share Your Public Key <u>As A File</u></h3><p>In order for your contacts to be able to send you encrypted email, you will first need to send them your <i>public key</i></p><p><b>Step 1:</b> From the main <b>APG</b> window tap on your key's entry to bring you to the <i>info</i> screen (as above) for your GPG key.</p><p><b>Step 2:</b> Tap on the three vertical dots in the top right corner to display the menu and select ?Export to file?.</p><img src=\"tool_k911.png\"><p><b>Step 3:</b> Select the location and file name you want to save your public key to and press ?OK?.</p><img src=\"tool_k912.png\"><p><b> Step 4:</b> The saved file cannot be given to your contacts, for example via email or IM.</p><h3>1.1.5 Key Management - Share Your Public Key <u>From The Clipboard</u></h3><p><b>Step 1:</b> From the main APG window tap on your key's entry to bring you to the <i>info</i> screen for your GPG key.</p><p><b>Step 2:</b> Tap the three connected dots at the top of the screen to bring up sharing options and select ?Share whole key?.</p><p><b>Step 3:</b> In the following menu select ?Copy to clipboard? to copy your GPG public key to the clipboard.</p><img src=\"tool_k913.png\"><p><b>Step 4:</b> Paste the public key into an email or IM chat session to your contact.</p><h3>1.1.6 Key Management - Verify Identities</h3><p>In order to ensure that you have received the correct GPG public key for your colleague and not someone trying to impersonate them, it is very important that you verify the GPG keys fingerprints either in person or via a medium that you can verify who you are talking to such as a video call or telephone call.</p><p><b>Step 1:</b> From the main <b>APG</b> window tap on your key's entry to bring you to the <i>info</i> screen for your GPG key. Your contact should do the same and tap on the key they have for you.</p><img src=\"tool_k914.png\"><p><b>Step 2:</b> Locate the <b>Fingerprint</b> line under the <b>MASTER KEY</b> heading and read out the 40 character long string one line at a time.</p><img src=\"tool_k915.png\"><p><b> Step 3:</b> Your contact should verify that the fingerprint you read out, is the fingerprint displayed for your key on their phone or computer.</p><p><b>Step 4:</b> Repeat steps 1 to 3 but tap on your contacts key at the first step.</p><h3>1.2 Message Encryption</h3><p>APG provides two ways for you to encrypt files on your Android device. Public key encryption is the desired option to use when sending files to other people as you will not have to share any passphrase with them. However you will need to receive public key from each person you wish to encrypt files to in advance. Passphrase encryption can be useful to be able to decrypt a file at a later date without the need to have access to a public key. But this method requires sharing the passphrase used to encrypt the file in order to decrypt it later.</p><p>Message encryption in <b>APG</b> can be useful if you want to store encrypted notes in another application or send encrypted email or message via a service that you can not use K-9 Mail with (eg. webmail, social networking message, etc.).</p><h3>1.2.1 Message Encryption - Public Key</h3><p><b>Step 1:</b> Expand the side menu on any <b>APG</b> screen by pressing ?APG? at the top left of your screen.</p><p><b>Step 2:</b> Select ?Encrypt? to bring up the encryption screen.</p><p><b>Step 3:</b> To view the list of possible recipients press ?Select? button with the person icon. <b>Note:</b> If you want to be able to decrypt the message at a later time, you will need to remember to include yourself in the list of recipients.</p><p><b>Step 4:</b> On the Recipient selection screen, tick all the people that need to be able to decrypt the message and press ?Okay?.</p><img src=\"tool_k916.png\"><p><b>Step 5:</b> Choose how to encrypt your message. Tapping ?Share with?? will allow you to send the encrypted message to another application on your phone such as an email client. Tapping ?Clipboard? will copy the encrypted message to your clipboard allowing you to paste the message anywhere that you can paste, such as an online forum.</p><h3>1.2.2 Message Encryption - PassPhrase</h3><p><b>Step 1:</b> Expand the side menu on any APG screen by pressing ?APG? at the top left of your screen.</p><p><b>Step 2:</b> Select ?Encrypt? to bring up the encryption screen.</p><p><b>Step 3:</b> Press the < or > buttons to either side of <b>PUBLIC KEY</b> to change the encryption type to </b>PASSPHRASE</b>.</p><p><b>Step 4:</b> Enter a strong password in the fields provided.</p><p><b>Step 5:</b> Enter the message you want to encrypt</p><img src=\"tool_k917.png\"><p><b>Step 6:</b> Choose how to use your encrypted message. Tapping ?Share with?? will allow you to send the encrypted message to another application on your phone such as an email client. Tapping ?Clipboard? will copy the encrypted message to your clipboard allowing you to paste the message anywhere that you can paste, such as an online forum.</p><p><b>Note:</b> If you plan to share the encrypted message with a contact you will need to relay the <i>passphrase</i> to them in a secure way, such as in person. It should never be sent to anyone over email or IM if it is not encrypted.</p><h3>1.2.3 Message Decryption</h3><p><b>Step 1:</b> Copy the entire contents of the encrypted message that you received in the other app to the clipboard by long-taping on the message and selecting copy button.</p><p><b>Step 2:</b> Switch to APG app and expand the side menu on any APG screen by pressing ?APG? at the top left of your screen.</p><p><b>Step 3:</b> Select ?Decrypt? to bring up the encryption screen.</p><p><b>Step 4:</b> APG will automatically detect that the clipboard has an encrypted message in it and ask you for either your GPG password, if the sender used public key encryption, or for the message password, if you used the <i>passphrase</i> encryption.</p><img src=\"tool_k918.png\"><p><b>Step 5:</b> The decrypted message will be displayed in a text window inside APG.</p><h3>1.3 File Encryption</h3><p>As with message encryption public key is the preferred encryption method but password encryption will allow you to decrypt on a phone or computer that does not have a private key installed but does have APG or GPG software.</p><h3>1.3.1 File Encryption - Public Key</h3><p><b>Step 1:</b> Expand the side menu on any APG screen by pressing ?APG? at the top left of your screen.</b></p><p><b>Step 2:</b> Select ?Encrypt? to bring up the encryption screen.</p><p><b>Step 3:</b> To view the list of possible recipients press ?Select? by the person icon. <b>Note:</b> If you want to be able to decrypt the file yourself at a later time, you will need to remember to include yourself in the list of recipients.</p><p><b>Step 4:</b> On the Recipient selection screen, tick all the people you want to be able to decrypt the file and press ?Okay?.</p><img src=\"tool_k919.png\"><p><b> Step 5:</b> Press the < or > buttons to either side of <b>MESSAGE</b> to change the encryption type to <b>FILE</b>.</p><p><b>Step 6:</b> Tap the open file icon to open the file browser and select the file you want to encrypt.</p><img src=\"tool_k920.png\"><p><b>Step 7:</b> press ?Encrypt File? to choose a file name and location to save the file to.</p><img src=\"tool_k921.png\"><p><b>Step 8:</b> Tap ?OK? to complete the encryption process.</p><h3>1.3.2 File Encryption - PassPhrase</h3><p><b>Step 1:</b> Expand the side menu on any APG screen by pressing ?APG? at the top left of your screen.</p><p><b>Step 2:</b> Select ?Encrypt? to bring up the encryption screen.</p><p><b>Step 3:</b> Press the < or > buttons to either side of <b>PUBLIC KEY</b> to change the encryption type to <b>PASSPHRASE<b>.</p><p><b>Step 4:</b> Enter a strong password in the fields provided.</p><p><b>Step 5:</b> Press the < or > buttons to either side of <b>MESSAGE</b> to change the encryption type to FILE.</p><p><b>Step 6:</b> Tap the open file icon to open the file browser and select the file you want to encrypt.</p><img src=\"tool_k922.png\"><p><b>Step 7:</b> press ?Encrypt file? to choose a file name and location to save the file to.</p><img src=\"tool_k923.png\"><p><b>Step 8:</b> Tap ?OK? to complete the encryption process.</p><p><b>Note:</b> If you plan to share the encrypted file with a contact you will need to relay the <i>passphrase</i> to them in a secure way, such as in person. It should never be sent to anyone over email or IM if it is not encrypted.</p><h3>1.3.3 File Decryption</h3><p><b>Step 1:</b> Expand the side menu on any APG screen by pressing ?APG? at the top left of your screen.</p><p><b>Step 2:</b> Select ?Decrypt? to bring up the encryption screen.</p><p><b>Step 3:</b> Tap the < or > buttons to either side of <b>MESSAGE</b> to change the encryption type to <b>FILE</b>.</p><p><b>Step 4:</b> Tap the open file icon to open the file browser and select the file you want to decrypt.</p><img src=\"tool_k924.png\"><p><b>Step 7:</b> press ?Decrypt? after which you will be prompted for your GPG keys password if public key encryption was used or for the file password if you used the <i>passphrase</i> encryption.</p><img src=\"tool_k925.png\"><p><b>Step 8:</b> Tap ?OK? to choose a location to save the decrypted document.</p><img src=\"tool_k926.png\"><p><b>Step 9:</b> Tap ?OK? to complete the decryption process.</p><hr><p><b>K-9 Mail with APG</b></p><img src=\"tool_k927.png\"><h3>2.0 How to Install <i>K-9 Mail</i><h3><p><b>Note:</b> Before you start using K-9 Mail you will need to have an email account, such as Gmail, that supports either secure POP3 or IMAP connections.</p><p><b>Step 1.</b> On your Android device, <b>download</b> and <b>install</b> the app from the <a href=\"https://play.google.com/store/apps/details?id=com.fsck.k9\">Google Play store here</a> store by tapping ?Install?.</p><img src=\"tool_k928.png\"><p><b>Step 2.</b> Before the installation process begins, you will be prompted to review the access that the application will have on your phone. Review this carefully. Once you are happy with the permissions that will be granted, tap ?Accept? and the installation will complete. If you do not agree with the permissions that will be granted, tap the back button and the installation will be cancelled.</p><img src=\"tool_k929.png\"><p><b>Step 3.</b> Tap ?Open? to run the app for the first time</p><h3>2.1 How to configure K-9 Mail</h3><p>After installing K-9 Mail and running it for the first time you will be presented with a welcome screen describing the features of the mail client. Press ?Next? to begin the account setup.</p><p>Where possible, K-9 Mail will attempt to automatically configure your email account for you. If this is not possible or you wish to have more control over the account setup you can also manually configure your account.</p><h3>2.1.1 Automatic account setup</h3><p><b>Step 1:</b> Enter your email address and email password in the fields provided and tap ?Next?.</p><img src=\"tool_k930.png\"><p><b>Step 2: K-9 Mail</b> will connect to the internet and attempt to get your account settings.</p><p><b>Step 3:</b> Once the settings have been retrieved you will be asked to enter your name as you want it to be displayed on all outgoing email and to give the account a name. The account name will allow you to distinguish between multiple accounts, should you want to add more. Tap ?Done? to complete the account setup.</p><img src=\"tool_k931.png\"><p><b>Step 4:</b> K-9 Mail will display changes to the program since the last version, tap ?OK? to dismiss this window and be brought to your mail account.</p><img src=\"tool_k932.png\"><p><b>Step 5:</b> To make sure the account is working in K-9 Mail, send yourself an email from your computer and download it from the K-9 Mail client.</p><h3>2.1.2 Manual account setup</h3><p><b>Step 1:</b> Enter your email address and email password in the fields provided and tap ?Manual setup?.</p><p><b>Step 2:</b> Select the account type your email is (IMAP/POP/Exchange) and tap the relevant button as in the image below.</p><p><b>Note:</b> you will need to refer to your email client settings on your computer to know what account type your email server uses.</p><img src=\"tool_k933.png\"><p><b>Step 3:</b> Next are the incoming server settings. If unsure, refer to the email client on your computer for settings. Always ensure that the <i>security type</i> is set to either <i>STARTTLS</i> or <i>SSL/TLS</i>. <b>Never</b> use the <i>none</i> option.</p><img src=\"tool_k934.png\"><p><b>Step 4. K-9 Mail</b> will then connect to your mail server to check if your settings are correct. It might display a warning about the certificate of your secured connection. <i>Do not ignore this!</i> This is the only time you can verify that the certificate really belongs to your mail server. If you ignore this, you can not be sure if you are not subject to a <i>Man-in-the-Middle attack</i>, and your communications could be intercepted. You can see a SHA-1 fingerprint at the very end of the warning. Either <b>check</b> on your computer if the installed certificate from your mail server has the same fingerprint, or find a way to check your mail server's certificate directly from your provider.</p><p><b>Step 5. K-9 Mail</b> asks you to configure your outgoing server settings. Again, <b>ensure</b> that <i>Security Type</i> is <i>STARTTLS</i> or <i>SSL/TLS</i>. For all additional settings, <b>check</b> your computer's email client or the settings of your email provider.</p><img src=\"tool_k935.png\"><p><b>Step 6.</b> K-9 Mail now asks you how often you want it to automatically poll for email. Set the option to <i>never</i> and uncheck <i>enable push mail</i> for this account, if you only want to receive email when you manually check, otherwise leave the settings as they are to automatically receive email as they arrive to your account.</p><img src=\"tool_k936.png\"><p><b>Step 7.</b> The last pieces of information to provide are a nickname for the email account which will be displayed in K-9 Mail and to set up the name you wish to be displayed on all outgoing email. </p><p><b>Step 8:</b> To make sure the account is working in K-9 Mail, send yourself an email from your computer and download it from the K-9 Mail client.</p><p>We recommend that you use K-9 Mail only in addition to your computer's email client. Therefore it is important that when you download email with your Android phone, it does not delete the email on the server, since you want to receive the email later with your computer, too. By default, K-9 Mail is set up this way, but you may want to learn more about the settings which can be found in <i>accounts</i>; this can be reached by long pressing on the account you have just set up and selecting <i>account settings</i> from the menu. You may also wish to check the <i>fetching mail</i> and <i>sending mail</i> account option for settings.</p><h3>2.2 How to Send and Receive Encrypted eMail</h3><p>One of the main benefits of using K-9 Mail over other email clients is that it lets you send and receive GPG encrypted email. Before you can start sending and receiving encrypted email, you need to ensure that you have all your OpenPGP keys imported into APG, as outlined in the APG section above. If you followed all the necessary steps in the APG keys section your keys will be imported.</p><h3> 2.2.1 Sending encrypted email</h3><p><b>Step 1:</b> From any screen in K-9 Mail tap the Send Email icon to start a new email.</p><p><b>Step 2:</b> On the email composition screen add your recipient by either typing in an email address or pressing the Add Recipient icon and selecting one from your address book.</p><p><b>Step 3:</b> Enable encrypted email by checking the box next to <i>encrypt</i>.</p><p><b>Step 4:</b> When finished writing your email, press the Send icon to send.</p><img src=\"tool_k937.png\"><p><b>Step 5:</b> The following screen will ask you to select which GPG keys to encrypt to. Be default the recipient key and your own should already be selected.</p><p><b>Note:</b> You should always ensure that your key is selected so that you can read the encrypted email that you had send.</p><img src=\"tool_k938.png\"><p><b>Step 6:</b> Once all recipient keys have been selected, press ?OKAY? to send the email.</p><p><b>Note:</b> Currently K-9 Mail cannot encrypt attachments, so you will need to encrypt any files with APG that you wish to send, before you compose the email. This is explained in the APG encryption section above. To attach the files tap the paperclip attachment icon and select the encrypted file (ending in <i>.gpg</i>).</p><h3>2.2.2 Receiving encrypted email</h3><p><b>Step 1:</b> Open your <i>inbox</i> and tap the email you wish to read.</p><img src=\"tool_k939.png\"><p><b>Step 2:</b> Tap the ?Decrypt? button.</p><img src=\"tool_k940.png\"><p><b>Step 3:</b> Enter the passphrase for your GPG key when prompted and press ?OK? to decrypt the email.</p><img src=\"tool_k941.png\"></p><p><b>Note:</b> as <b>K-9 Mail</b> is currently not able to decrypt encrypted attachments, you will need to save the attachments to your phone and decrypt them with APG, as explained in the APG decryption section above. </p>",
		"category": "Tools"
	}
]