[
	{
		"title": "Recuva",
		"body": "<h1>RECUVA TOOL GUIDE</h1><h2>Recuva Tool Guide <br>Data recovery and secure deletion</h2><p><b>Lesson to read: <br>? <a href=\"umbrella://lesson/backing-up\">Backing Up</a></b><br><b>Download Location:</b> <a href=\"http://www.piriform.com/recuva/builds\">http://www.piriform.com/recuva/builds</a>  <br><b>Computer requirements:</b> Any version of Windows <br><b>Version used in this guide:</b> Recuva 1.3<br><b>License:</b> Freeware<br><b>Level:</b> Intermediate <br><b>Time required:</b> 20 minutes</p><p><b>Using Recuva will give you:</b><br>? The ability to perform different scanning techniques<br>? The ability to recover previously deleted files on your computer, including emails, images and videos<br>? The ability to securely delete private or sensitive information</p><p>Mac OS users could use <a href=\"www.cgsecurity.org/\">TestDisk and PhotoRec</a>, as an alternative, which are also compatible with Microsoft Windows and GNU Linux.</p><h3>1.1 Before you start</h3><p>In situations where private or sensitive files may have been mistakenly deleted, Recuva can help you to scan for and restore some of them. As discussed in the <b><a href=\"umbrella://lesson/safely-deleting\">Deleting lesson</a></b>, a file deleted using the standard Windows operating system Delete function, even after the Recycle Bin has been emptied, might still exist on the computer.</p><p>However, there are circumstances under which Recuva cannot retrieve information. If you have permanently deleted or wiped any temporary files by running CCleaner with the Secure file deletion (Slower) option enabled, those files are virtually unrecoverable. Recuva cannot recover files after programs like CCleaner or Eraser have been used to wipe free disk space or if Windows itself has already overwritten any previously occupied space. Recuva also cannot recover damaged documents and files.</p><p>Recuva can also be used to securely overwrite your private or sensitive data.</p><h3>How to Install Recuva</h3><h3>2.0 How to Install Recuva</h3><p><b>Step 1.</b> Double click ?rcsetup138.exe?; the <i>Open File - Security Warning</i> dialog box may appear. If it does, click ?Run? to activate the language box.</p><p><b>Step 2.</b> Click ?OK? to activate the Welcome to the <i>Recuva Setup Wizard</i> screen.</p><p><b>Step 3.</b> Click ?Next? to activate the <i>License Agreement</i> screen. Please read the <i>License Agreement</i> before proceeding with the rest of the installation process.</p><p><b>Step 4.</b> Click ?I Agree? to activate the <i>Choose Install</i> Location screen.</p><p><b>Step 5.</b> Click ?Next? to activate the <i>Install Options</i> screen.</p><p><b>Note:</b> The <i>Install Options</i> screen appears with the <i>Install optional Yahoo! toolbar</i> option enabled. Do <i>not</i> install the Yahoo! toolbar, which may compromise your Internet privacy and security.</p><p><b>Step 6.</b> Check the <i>Install optional Yahoo! toolbar</i> check box to disable it as shown below:</p><img src=\"tool_recuva1.png\"><p><b>Step 7.</b> Click ?Install? to begin installing Recuva. This will activate the installation progress bar that will disappear after the installation has completed itself in a few minutes.</p><p><b>Step 8.</b> Click ?Finish? to complete installing Recuva.</p><p>Now that you have successfully installed Recuva, you are ready to begin recovering and/or overwriting private and sensitive information. </p><h3>How to Perform Different Scans Using Recuva</h3><h3>3.0 Before You Begin</h3><p>In this section, you will learn how to perform different types of scans, and be introduced to the <i>General</i> and <i>Actions</i> tabs in the <i>Options</i> screen. <b>Note:</b> A scan will simply retrieve and display the files which are potentially recoverable. The actual recovery procedures are discussed in the next section.</p><h3>3.1 How to Perform a Scan Using the Recuva Wizard</h3><p>The Recuva <i>Wizard</i> is recommended in situations where neither the full nor partial name of the file you would like to recover is known. It is also recommended if this is the first time you are using Recuva. The Recuva <i>Wizard</i> lets you set the scan parameters by letting you specify the file type and/or from where the file was deleted.</p><p>To begin scanning for deleted files, perform the following steps:</p><p><b>Step 1.</b> Click the Recuva icon or select Start > Programs > Recuva > Recuva to launch the program, and activate the following screen:</p><img src=\"tool_recuva2.png\"><p><b>Tip:</b> If you know the exact or even partial name of a file you would like to recover, click ?Cancel? to go to the <i>Piriform Recuva</i> main user interface, and then follow the steps in section 3.2 How to Perform a Scan without Using the Recuva Wizard.</p><p><b>Step 2.</b> Click ?Next? to activate the following screen:</p><img src=\"tool_recuva3.png\"><p>The <i>Recuva Wizard File type</i> displays a list of different file types, and describes what files might be recovered when each option is enabled.</p><p><b>Step 3.</b> Check the <i>Other</i> option, and then click ?Next? to activate the following screen:</p><img src=\"tool_recuva4.png\"><p><b>Note:</b> The default setting for the <i>Recuva Wizard File Location</i> screen is the <i>I'm not sure option</i>. This option will extend the scan to all drives as well as removable media, except CDs, DVDs and optical media. It may, therefore, require a longer time to generate results.</p><p>Files are most frequently deleted from Recycle Bin in the Windows operating systems, to minimize the chance of your accidentally deleting private or sensitive information.</p><p><b>Step 4.</b> Check the <i>In the Recycle Bin</i> option as shown above, and then click ?Next? to activate the following screen:</p><img src=\"tool_recuva5.png\"><p><b>Note:</b> For this exercise, do not enable the <i>Deep Scan</i> option. This scanning technique will be discussed in section 3.3 How to Perform a Deep Scan.</p><p><b>Step 5.</b> Click ?Start? to begin recovering your deleted files.</p><p>During the file recovery process, two progress status bars appear in quick succession. The <i>Scanning the drive for deleted files</i> progress bar lists the deleted files. The <i>Analyzing the file contents</i> progress bar groups and sorts the deleted files into file types and degree of recoverability. They also display the duration of the scanning and analysis processes. Your <i>Piriform Recuva</i> main user interface may then resemble the following screen:</p><img src=\"tool_revua6.png\"><p>The <i>Piriform Recuva</i> main user interface lists information about each deleted file, arranged in six columns. Each column is described as follows:</p><p><b>Filename</b> This displays the name and file extension of the deleted file. Click the <i>Filename</i> title to arrange the deleted files in alphabetical order.</p><p><b>Path:</b> This displays where the deleted file was found. Given that the <i>In the Recycle Bin</i> option was enabled in this example, the file path is <i>C:RECYCLER</i> for all the deleted files. Click the <i>Path</i> title to view all the files listed under a particular directory or file path.</p><p><b>Last modified:</b> This displays the last time the file was modified before it was deleted, and can be useful in helping to identify the file you would like to recover. Click <i>Last modified</i> to list the deleted files according to the oldest or most recent.</p><p><b>Size:</b> This displays the size of the file. Click <i>Size</i> to list the deleted files beginning with the largest or smallest deleted file.</p><p><b>Status:</b> This displays the extent to which the file is recoverable, and corresponds to the file status icons discussed below. Click <i>Status</i> to sort the deleted files into the three basic categories, and list them from <i>Excellent</i> to <i>Unrecoverable</i>.</p><p><b>Comment:</b> This displays why a given file may or may not be recoverable, and the extent to which a deleted file has been overwritten in the Windows Master File Table. Click <i>Comment</i> to view the extent to which a file or group of files have been overwritten.</p><p>Each file is associated with a coloured status icon which indicates the extent to which each file can be successfully recovered:</p><p>The following list describes each status icon:</p><p>? Green: The chances for a full recovery are excellent.<br>? Orange: The chances for recovery are acceptable.<br>? Red: The chances for recovery are unlikely.</p><h3>3.2 How to Perform a Scan without Using the Recuva Wizard</h3><p>To access the Recuva main user interface directly, (that is, not use the <i>Recuva Wizard</i>), perform the following steps:</p><p><b>Step 1.</b> Click the Recuva icon or select Start > Programs > Recuva > Recuva.</p><p><b>Step 2.</b> Check the <i>Do not show this Wizard on startup</i> option, then click ?Cancel? to activate the following screen:</p><img src=\"tool_recuva7.png\"><p>The <i>Piriform Recuva</i> main user interface is divided into the results pane on the left and the <i>Preview</i>, <i>Info</i> and <i>Header</i> tabs in which to sort and view information about a specific deleted file. It lets you set certain scan options, similar to those in the <i>Recuva Wizard</i>.</p><p><b>Step 3.</b> Click to activate the drop-down list and select the drive to be scanned; the <i>Local Disk (C:)</i> is the default and used in this example as follows:</p><img src=\"tool_recuva8.png\"><p>The <i>Filename</i> or <i>path</i> drop-down list lets you specify the kind of file you are looking for, and loosely corresponds to the <i>Recuva Wizard File type</i> screen.</p><img src=\"tool_recuva9.png\"><p>The <i>Filename</i> or <i>path</i> feature is a combination of a text box and drop-down list. It has two main uses: To let you directly search for a specific file, and/or to sort through a list of deleted files, according to file type.</p><p>Alternatively, the <i>Filename</i> or <i>path</i> feature can be used to search for files of a specific type, or to sort through a general list of deleted files in the results pane.</p><p>To begin scanning for a file of which all or part of the name is known, perform the following steps:</p><p><b>Step 1.</b> Type in the name or partial name of a file you would like to recover as follows (in this example, the file <i>triangle.png</i> is being scanned):</p><img src=\"tool_recuva10.png\"><p>Tip:<b> Click X to reset the <i>File name and path</i> (which appear greyed out).</p><p><b>Step 2.</b> Click ?Scan? to begin scanning for your deleted file(s); shortly thereafter, a screen will appear resembling the following:</p><img src=\"tool_recuva11.png\"><h3>3.3 How to Perform a Deep Scan Using Recuva</h3><p>The <i>Enable Deep Scan</i> option lets you conduct a more thorough scan; naturally, a deep scan takes a longer time, depending on your computer speed and the number of files you have. This option might prove useful if your initial scan does not display the files you would have liked to recover. Although a deep scan may even take hours depending on the amount of data stored on your computer, it may improve your chances of recovering the files you require.</p><p>The Recuva <i>Deep Scan</i> option can be enabled either through checking the <i>Enable Deep Scan</i> option in the <i>Recuva Wizard</i>.</p><p><b>Step 1.</b> Click ?Options? to activate the <i>Options</i> screen, then click the <i>Actions</i> tab as follows:</p><img src=\"tool_recuva12.png\"><p><b>Step 2.</b> Check the <i>Deep Scan (increases scan time)</i> option, then click ?OK?.</p><p><b>Step 3.</b> Click ?Scan? to begin scanning for deleted files using the <i>Deep Scan</i> option. As mentioned earlier, a deep scan can potentially take a few hours, depending on the size of your hard disk and computer speed:</p><img src=\"tool_recuva13.png\"><h3>3.4 An Introduction to the Options Screen</h3><p>In this section, you will learn how to use the different settings to successfully recover and overwrite your private or sensitive information in the <i>Options</i> screen. To configure these settings, perform the following steps:</p><p><b>Step 1:</b> Click ?Options? to activate the following screen:</p><img src=\"tool_recuva14.png\"><p>The <i>Options</i> screen is divided into the <i>General</i>, <i>Actions</i> and <i>About</i> tabs.</p><p>The <i>General</i> tab lets you define a number of important settings, including <i>Language</i> (Recuva supports 37 languages), <i>View mode</i> and disabling or enabling the <i>Recuva Wizard</i>.</p><img src=\"tool_recuva15.png\"><p>The View Mode lets you select how you would like to view the deleted files, and can also be enabled whenever you right click a file in the <i>Piriform Recuva</i>.</p><p>? <b>List:</b> This option lets you view the deleted files in a list<br>? <b>Tree:</b> This option lets you view the directory path of deleted files in the form of an expandable tree.<br>? <b>Thumbnails:</b> This option lets you view the deleted files as graphics or images where possible.</p><p>Most importantly perhaps, the <i>Advanced</i> section of the <i>General</i> tab lets you set the number of times your data can be overwritten by random data to protect it from recovery by hostile or malicious parties.</p><p>The <i>Secure overwriting</i> drop-down list displays four options for overwriting your private information. Its default mode is <i>Simple Overwrite (1 pass)</i>. A pass refers to the number of times your document, file or folder will be overwritten with random data to render it completely unreadable.</p><p><b>Step 2: Select</b> the <i>DOD 5220.22-M (3 passes)</i> option as follows:</p><img src=\"tool_recuva16.png\"><p>A single pass may prove quite effective in overwriting a given document, file or folder; however, there are parties with the resources and skills to recover a relatively light secure overwrite. Three passes is a solid balance between the time required to perform a secure overwrite, and the ability to recover that document, file or folder.</p><p><b>Step 3.</b> Click ?OK? to save your <i>General</i> tab configuration options.</p><img src=\"tool_recuva17.png\"><p>? <b>Show files found in hidden system directories:</b> This option lets you display files in hidden system directories.</p><p>? <b>Show zero-byte files:</b> This option lets you show you files that have little to no content, and which are basically irrecoverable.Show securely deleted files: This option lets you display files that have been securely deleted in the results pane.</p><p><b>Note:</b> If you have already used CCleaner or a similar program, it changes the filename to ZZZZZZZ.ZZZ when it securely deletes a file, for security reasons.</p><p>? <b>Deep Scan:</b> This option lets you scan the entire drive for the deleted document or file; if previous scans have proven ineffective in locating your file, the Deep Scan may prove useful. However, it does require more time. Please refer to section 3.3 How to Perform a Deep Scan Using Recuva.</p><p>? <b>Scan for non-deleted files (for recovery from damaged or reformatted disks):</b> This option lets you attempt to recover files from disks that may have sustained physical damage or software-related corruption.</p><p>The <i>About</i> tab displays version information, as well as links to the Piriform web site.</p><p>Now that you are more confident about performing different scans and familiar with the settings in the <i>General</i> and <i>Actions</i> tabs in the Options screen, you are ready to learn how to actually recover and/or securely overwrite your private or sensitive information.</p><h3>How to Recover and Securely Overwrite Files Using Recuva</h3><h3>4.0 Before You Begin</h3><p>In this section, you will learn how to recover a previously deleted file, as well as how to securely overwrite any private or sensitive information.</p><p>Recuva lets you create a new folder for storing your recovered files. Although Recuva does let you use existing folders, for reasons of safety and security, we recommend that you copy your recovered files to a removable device like a backup drive or USB memory stick.</p><p><b>Important:</b> Although Recuva does an excellent job of securely overwriting information, it may leave a file marker indicating the existence of such a file. To protect your privacy and security, it makes sense to save any important, private or sensitive information to a removable device, and not to the original location or path.</p><h3>4.1 How to Recover a Deleted File</h3><p>To begin recovering a deleted file, perform the following steps:</p><p><b>Step 1.</b> Connect your removable disk or a USB memory stick to your computer.</p><p><b>Step 2.</b> Check the check box next to a file you want to recover to enable the Recover... button or double click that file to both check and highlight that file.</p><p><b>Step 3.</b> Click ?Recover?? to activate the <i>Browse For Folder</i> screen.</p><p><b>Step 4.</b> Select a destination and then click ?Make New Folder? to create your recovery folder as shown below.</p><img src=\"tool_recuva18.png\"><p><b>Note:</b> In this example, the folder for storing your recovered documents and files has been given an obvious label. However, keeping your digital privacy and security in mind, we encourage you to be more careful in labelling your own folder.</p><p><b>Step 5.</b> Click ?Yes? to begin the file recovery process; a progress status screen appears as follows:</p><img src=\"tool_recuva19.png\"><p>After the files have been recovered, a confirmation will appear resembling the following screen:</p><img src=\"tool_recuva20.png\"><p><b>Note:</b> Recuva supports multiple file recovery. Simply check the check boxes of the files you would like to recover and perform steps <b>3</b> to <b>5</b>.</p><p>Now that you are comfortable with recovering a previously deleted file, you are ready to learn how to use the pop-up menu to perform multiple file recoveries and secure overwriting of files.</p><h3>4.2 How to Use the Pop-up Menu</h3><p>Recuva offers different options for selecting the documents, files or folders you would like to delete or securely overwrite.</p><p>? <b>Checking</b> is generally used to quickly select several non-contiguous or separate files for recovery or secure overwriting.<br>? <b>Highlighting</b> is generally used to quickly select contiguous multiple files in a block or group for recovery or secure overwriting.</p><p>Right click on a deleted file displayed in the Recuva main to activate the following pop-up menu:</p><img src=\"tool_recuva21.png\"><p><b>Recover Highlighted:</b> This item lets you recover all or any highlighted deleted file(s).</p><p><b>Recover Checked:</b> This item lets you recover a checked deleted file.</p><p><b>Check Highlighted:</b> This item lets you check a highlighted deleted file.</p><p><b>Uncheck Highlighted:</b> This item lets you uncheck a highlighted deleted file.</p><p>As you recall, the View Mode can also be set in the <i>General</i> tab in the <i>Options</i> screen. This item lets you select how you would like to view the deleted files.</p><p>? <b>List:</b> This option lets you view the deleted files in a list as in Figure 5<br>? <b>Tree:</b> This option lets you view the directory path of deleted files in the form of an expandable tree.<br>? <b>Thumbnails:</b> This option lets you view the deleted files as graphics or images where possible.</p><p><b>Highlight Folder:</b> This option lets you select multiple deleted files according to their directory path, and lets you perform the actions listed in the pop-up menu on them.</p><p><b>Secure Overwrite Highlighted:</b> This option lets you securely overwrite a highlighted deleted file.</p><p><b>Secure Overwrite Checked:</b> This option lets you securely overwrite a checked deleted file, changing its status icon to red.</p><h3>4.3 How to Securely Overwrite a Deleted File</h3><p>To securely overwrite a deleted file, perform the following steps:</p><p><b>Step 1.</b> Check the individual file you would like to have securely overwritten, and then right click the check box it to activate the pop-up menu.</p><p><b>Step 2.</b> Select ?Secure Overwrite Checked? to activate the following confirmation dialog box:</p><img src=\"tool_recuva22.png\"><p><b>Step 3.</b> Click ?Yes? to begin the overwriting process; depending on the size and status of the file as well as the <i>Secure overwriting</i> option you selected in the <i>General</i> tab in the <i>Options</i> screen, this could take some time. After the overwriting process has been completed, a screen resembling the following appears:</p><img src=\"tool_recuva23.png\"><p>You have successfully completed recovering and securely overwriting files using Recuva previously deleted files.</p><h3>5 PORTABLE RECUVA</h3><h3>5.1 Differences between the Installed and Portable Versions of Recuva</h3><p>Given that portable tools are not installed on a local computer, their existence and use may remain undetected. However, keep in mind that your external device or USB memory stick, and portable tools are only as safe as the computer you are using, and may risk being exposed to adware, malware, spyware and viruses.</p><p>There are no other differences between Portable Recuva and the version designed to be installed.</p><h3>5.2 How to Download and Extract Recuva Portable</h3><p>To begin downloading and extracting Recuva Portable, perform the following steps:</p><p><b>Step 1.</b> Click <a href=\"http://www.piriform.com/recuva/download/portable\">http://www.piriform.com/recuva/download/portable</a> to be directed to the appropriate download site, and automatically activate the following screen:</p><p><b>Step 2.</b> Click ?OK? to save the <i>rcsetup140.zip</i> installation file to your computer; and then navigate to it.</p><p><b>Step 3.</b> Right click to activate the Windows pop-up menu, and then select the Extract files... item as shown below:</p><img src=\"tool_recuva24.png\"><p><b>Step 4.</b> Navigate to the removable drive or USB memory stick as shown below, and then click ?New Folder? to create a new folder in which to extract the installation file.</p><img src=\"tool_recuva25.png\"><p><b>Step 5.</b> Enter a name for the new folder in the document tree as shown below:</p><img src=\"tool_recuva26.png\"><p>Alternatively, you may type in a folder name in the accompanying drop-down list: </p><img src=\"tool_recuva27.png\"><p><b>Note:</b> Although for the purposes of this example, the new folder is entitled Recuva Portable, users may choose different name.</p><p><b>Step 6.</b> Click ?OK? to begin extracting its contents to newly created folder.</p><p><b>Step 7.</b> Navigate to your destination external drive or USB memory stick, as shown below, then open it to confirm that the Portable Recuva program was successfully extracted.</p><img src=\"tool_recuva28.png\"><p><b>Step 8.</b> Double click <i>Recuva.exe</i> to activate the Portable Recuva wizard.</p><p>Please refer to the rest of the Recuva tool guide above to begin configuring and using it.</p>",
		"category": "Tools"
	}
]