[
	{
		"title": "PGP for Linux",
		"body": "<h1>PGP FOR LINUX TOOL GUIDE</h1><h2>PGP for Linux Tool Guide <br>Encrypted email for Linux</h2><p><b>Lesson to read: <br>? <a href=\"umbrella://lesson/email\">Email</a></b><br><b>Computer requirements:</b> An internet connection, a computer running Linux, an email account<br><b>Version used in this guide: </b><br>? Linux: Debian 7.0 (\"Wheezy\")<br>? Mozilla Thunderbird 24.8.1<br>? Enigmail 1.6<br>? GPG4Win 1.4.18<br><b>License:</b> Free Software; mix of Free Software licenses<br><b>Level:</b> Expert<br><b>Other reading:</b> <a href=\"https://www.gnupg.org/documentation/guides.html\">https://www.gnupg.org/documentation/guides.html</a><br><b>Time required:</b> 30-60 minutes</p><p><b>Using PGP will give you:</b><br>? The ability to protect your email communications from being read by anyone except their intended recipients.<br>? The ability to prove that an email came from a particular person, instead of being a fake message sent by another sender (it is otherwise very easy for email to be fabricated). Both of these are important defenses if you're being targeted for surveillance or misinformation.</p><h3>1.0 Before you start </h3><p>To use Pretty Good Privacy (PGP), you will need to install some extra software that will work with your current email program. You will also need to create a private key, which you will keep private. The private key is what you will use to decrypt emails sent to you, and to digitally sign emails that you send to show they truly came from you. Finally, you'll learn how to distribute your public key?a small chunk of information that others will need to know before they can send you encrypted mail, and that they can use to verify emails you send.</p><p>This guide will show you how to use PGP with a Linux-style operating system using Mozilla Thunderbird, a popular open source graphical email client.</p><p>You can't currently use PGP directly with a web email service like Gmail, Hotmail, Yahoo! Mail, or Outlook Live. You can still use your webmail address; you?ll just have to configure it with the Thunderbird program on your computer.</p><p><b>Note that both ends of the email conversation need to be using PGP-compatible software for it to work.</b></p><p>People will normally use this only on their own personal devices, not on shared devices. Fortunately, PGP is available for most desktop computers and mobile devices, and you can point them to these guides to help them set up their own version.</p><h3>2.0 Installing Thunderbird, GnuPG and Enigmail </h3><p>PGP is an open standard, which means that more than one piece of software can use it. The software we're going to use for PGP is called GnuPG. We'll also be adding a plug-in to Thunderbird called Enigmail, which lets you use GnuPGP from within Thunderbird. The following instructions require some comfort with the command line.</p><p>If you're using using a Red Hat-based distribution such as Red Hat or Fedora Core, open a terminal and run these commands:</p><p><i>sudo yum install gnupg thunderbird thunderbird-enigmail</i></p><p>If you are using a Ubuntu-based distribution such as Ubuntu, or Linux Mint, open a terminal and type these commands to make sure you have the right software installed:</p><p><i>sudo apt-get install gnupg thunderbird enigmail</i></p><p>If you're using the Debian distribution, you'll find that Thunderbird is called ?Icedove.? Like Debian in general, this is for entirely reasonable but somewhat obscure reasons. Apart from the name, it's exactly the same program: we'll not mention Icedove again, but you can just replace ?Thunderbird? with Icedove in the rest of this guide, and everything should still work.</p><p>Use this command in the Terminal to install it:</p><p><i>sudo apt-get install gnupg icedove enigmail</i></p><h3>2.1 Configuring Thunderbird</h3><p>Now that you've installed Thunderbird, open it as you would another application on your machine (you might pick it from a list of applications on a menu, or type its name into an application search). You will see the first run wizard appear.</p><img src=\"tool_pgplin1.png\"><p>To set up your existing email address, click \"Skip this and use my existing email,? and then enter your name, email address, and the password to your email account.</p><img src=\"tool_pgplin2.png\"><p>If you use a popular free email service like Gmail, Thunderbird should be able to automatically detect your email settings when you click ?Continue.?</p><p><b>If you use two-factor authentication with Google (and depending on your threat model you probably should!) you cannot use your standard Gmail password with Thunderbird. Instead, you will need to create a new application-specific password for Thunderbird to access your Gmail account. See <a href=\"https://support.google.com/mail/answer/1173270?hl=en\">Google's own guide</a> for doing this.</b></p><img src=\"tool_pgplin3.png\"><p>If it doesn't, you may need to manually configure your IMAP and SMTP settings. If you don?t know how to do this, talk to your email provider, or ask someone technical who is familiar with your email provider (so, an IT person at work, or a technical friend who uses the same ISP as you; they don't need to know how to use PGP, but you can ask them ?Do you know the IMAP and SMTP settings for my email address??).</p><h3>2.2 Configuring Enigmail</h3><p>Enigmail is a plugin for Thunderbird that encrypts and decrypts PGP-encoded emails, and makes handling private and public keys a little easier. If you have the latest version of Enigmail, you should be presented with the Enigmail Setup Wizard.</p><img src=\"tool_pgplin4.png\"><p>If you don't see it, you can use this menu option from Thunderbird to make it appear. Click on the three horizontal lines (the ?hamburger menu?) on the right of the Thunderbird window.</p><img src=\"tool_pgplin5.png\"><p>Here's the first option that Enigmail offers you: three options for handling when to encrypt your mail.</p><img src=\"tool_pgplin6.png\"><p>The default option is to encrypt emails if you have the ?public key? of another person, Enigmail will encrypt the email you send but leave emails unencrypted if you don't have the public key of the recipient yet. You also have the option to encrypt emails all the time to everyone with PGP keys, which means that you will have to find the public keys for people for whom you don't have them already, or turn off automatic encryption completely and only use PGP when directed.</p><p>We don't know what the appropriate option is for you, but believe the ?Convenient auto encryption? option to be a good choice. If you are in doubt, choose ?Don't encrypt my messages by default.? </p><p>Click the ?Next? button.</p><img src=\"tool_pgplin6.png\"><p>Now you have an option to digitally sign all outgoing emails. Signing your email with PGP allows the recipient to check that you sent the message, and that the contents of the message were not tampered with. Click the ?Sign my messages by default? button to turn this feature on. </p><p>The downside of doing this, however, is that it can also flag to anyone you send mail to that you use PGP. <a href=\"www.cryptolaw.org/\">In some parts of the world</a> (including China, Iran, Belarus, and some Middle-East states) using unlicensed encryption, even for personal use, is illegal, so you might have very good reasons to not let others know you use PGP.</p><p>Click the ?Next? Button.</p><p>Now you'll see an option to have Enigmail make some changes to the configuration of Mozilla Thunderbird.</p><img src=\"tool_pgplin7.png\"><p>If you click the Details button you can review what those changes are.</p><p>The following options can be unchecked (reenabled), for a more seamless transition, if you use PGP/Mime by default (we'll set that later):<br>? Disable flowed text<br>? View message body as plain text<br>? Do not compose HTML messages</p><p>The final option prevents potential problems in the encryption and decryption of your email. Be aware that selecting this box will remove the ability to send text that is bolded, underlined or colored. After reviewing the changes, click the ?OK button.?</p><p>Now you will start creating your private key and public key.</p><h3>2.3 Creating a public key and private key</h3><p>Installation and setup of the Enigmail add-on is complete. Now you'll have the option of creating your public and private key pair. This assumes you have not created a private key before.</p><img src=\"tool_pgplin8.png\"><p>Click the ?Next? button.</p><p>Unless you have already configured more than one email account, Enigmail will choose the email account you've already configured. The first thing you'll need to do is come up with a strong passphrase for your private key. See the <b><a href=\"umbrella://lesson/passwords\">Passwords lesson</a></b> for more information on how to do this.</p><p>Enigmail will display some information about your private key as well as the configuration settings. We recommend creating 4096-bit length keys. Click the ?Next? button.</p><img src=\"tool_pgplin9.png\"><p><b>Your key will expire at a certain time; when that happens, other people will stop using it entirely for new emails to you, though you might not get any warning or explanation about why. So, you may want to mark your calendar and pay attention to this issue a month or so before the expiration date.</b></p><p>It's possible to extend the lifetime of an existing key by giving it a new, later expiration date, or it's possible to replace it with a new key by creating a fresh one from scratch. Both processes might require contacting people who email you and making sure that they get the updated key; current software isn't very good at automating this. So make a reminder for yourself; if you don't think you'll be able to manage it, you can consider setting the key so that it never expires, though in that case other people might try to use it when contacting you far in the future even if you no longer have the private key or no longer use PGP.</p><p>Enigmail will generate the key and when it is complete, a small window will open asking you to generate a revocation certificate. This revocation certificate is important to have as it allows you to make the private key and public key invalid. It is important to note that merely deleting the private key does not invalidate the public key and may lead to people sending you encrypted mail that you can't decrypt.</p><img src=\"tool_pgplin10.png\"><p>Click the ?Generate Certificate? button.</p><p>A window will open to provide you a place to save the revocation certificate. While you can save the file to your computer, we recommend saving the file on a USB drive that you are using for nothing else and storing the drive in a safe spot. We also recommend removing the revocation certificate from the computer with the keys, just to avoid unintentional revocation.</p><p>Even better, save this file on a separate encrypted disk. Choose the location where you are saving this file and click the ?Save? button.</p><p>Now Enigmail will give you further information about saving the revocation certificate file again. Click the ?OK? button.</p><p>Finally, you are done with generating the private key and public key. Click the ?Finish? button.</p><h3>2.4 Optional steps</h3><h3>2.4.1 Display long key-IDs</h3><p>The next steps are completely optional but they can be helpful when using OpenPGP and Enigmail. Briefly, the Key ID is a small part of the fingerprint. When it comes to verifying that a public key belongs to a particular person the fingerprint is the best way. Changing the default display makes it easier to read the fingerprints of the certificates you know about. Click the configuration button, then the Enigmail option, then Key Management.</p><img src=\"tool_pgplin11.png\"><p>A window will open showing two columns: Name and Key ID.</p><img src=\"tool_pgplin12.png\"><p>On the far right there is a small button. Click that button to configure the columns. Unclick the Key ID option and click the Fingerprint option.</p><img src=\"tool_pgplin13.png\"><p>Now change the width of the Fingerprint column by moving the mouse to the lines between each column heading (that is, just to the left of the ?Key ID? header at the top of the list of keys), and dragging the line to the left. Keep moving left until you can see all of the Key ID, like this:</p><p>Now the columns will look like this:</p><img src=\"tool_pgplin14.png\"><p>Now you are set up to send and receive regular and encrypted email. Next you will go through the steps of actually finding the people to exchange encrypted mail with.</p><p><b>Using PGP doesn't completely encrypt your email so that the sender and receiver information is encrypted. Encrypting the sender and receiver information would break email. Using Thunderbird with the Enigmail add-on gives you an easy way to encrypt and decrypt the content of your email.</b></p><h3>3.0 Letting others know you are using PGP</h3><p><b>a) Let people know you are using PGP with an email</b></p><p>You can easily email your public key to another person by sending them a copy as an attachment.</p><p>Click the ?Write? button in Mozilla Thunderbird.</p><p>Fill in an address and a subject, perhaps something like ?my public key,? click the Enigmail menu and select the ?Attach My Public Key? option.</p><img src=\"tool_pgplin15.png\"><p>You can now the email and the recipient will be able to download and use the public key you sent.</p><p><b>If this method is used, it's a good idea to have the recipient verify your public key's fingerprint over some other form of communication, in case email is already being intercepted and tampered with.</b></p><p><b>b) Let people know you are using PGP on your website</b></p><p>In addition to letting people know via email, you can post your public key on your website. The easiest way is to upload the file and link to it. This guide won't go into how to do those things, but you should know how to export the certificate as a file to use in the future.</p><p>Click the configuration button, then the Enigmail option, then Key Management.</p><p>Highlight your certificate in bold, then right-click to bring up the menu and select Export keys to file.</p><img src=\"tool_pgplin16.png\"><p>A small window will pop up with three buttons. Click the ?Export Public Keys Only? button.</p><img src=\"tool_pgplin17.png\"></p><p><b>Make sure you don't click the ?Export Secret Keys? button because exporting the secret key could allow others to impersonate you if they are able to guess your password.</b></p><p>Now a window will open so you can save the file. In order to make it easier to find in the future please save the file to the Documents folder.</p><p>Now you can use this file as you wish.</p><p><b>c) Uploading to a keyserver</b></p><p>Keyservers make it easier to search for and download public keys. Most modern keyservers are synchronizing, meaning that a public key uploaded to one server will eventually reach all servers.</p><p>Although uploading your public key to a keyserver might be a convenient way of letting people know that you have a public PGP certificate, you should know that due to the nature of how keyservers work, there is no way to delete public keys once they are uploaded, you can only mark them as revoked.</p><p><b>Before uploading your public key to a keyserver, it is good to take a moment to consider whether you want the whole world to know that you have a public key without the ability to remove this information at a later time.</b></p><p>If you choose to upload your public key to keyservers, you will go back to the Enigmail Key Management window.</p><p>Click the Keyserver menu item and select the Upload Public Keys option.</p><img src=\"tool_pgplin18.png\"><h3>3.1 Finding other people who are using PGP</h3><p><b>a) Getting a public key by email</b></p><p>You might get a public key sent to you as an email attachment.</p><img src=\"tool_pgplin19.png\"><p>Notice the attachment at the bottom of the window. Right-click on the attachment and select ?Import OpenPGP Key.? A small window will open giving you the results of the import. Click the OK button.</p><p>If you open up the Enigmail key management window again, you can check the result. Your PGP key is in bold because you have both the private key and the public key. The public key you just imported is not bold because it doesn't contain the private key.</p><img src=\"tool_pgplin20.png\"><p><b>b) Getting a public key as a file</b></p><p>It's possible that you get a public key by downloading it from a website or someone might have sent it through chat software. In a case like this, you will assume you downloaded the file to the Downloads folder.</p><p>Open the Enigmail Key Manager and click on the ?File? menu. Select ?Import Keys from File.?</p><p>The public key might have very different file name endings such as .asc, .pgp, or .gpg. Select the file and click the ?Open? button. A small window will open, giving you the results of the import. Click the ?OK? button.</p><p><b>c) Getting a public key from a key server</b></p><p>Keyservers can be a very useful way of getting public keys. Try looking for a public key. Open up the key manager then click the ?Keyserver? menu and select ?Search for Keys.?</p><img src=\"tool_pgplin21.png\"><p>A small window will pop up with a search field. You can search by a complete email address, a partial email address, or a name. In this case, you will search for certificates containing ?eff.org.?</p><img src=\"tool_pgplin22.png\"><p>A larger window will pop up with many options. If you scroll down you'll notice some certificates are italicized and grayed out. These are certificates that have either been revoked or expired on their own.</p><img src=\"tool_pgplin23.png\"><p>Let's take the public keys of Danny O'Brien for example, he has one expired or revoked certificate and one valid certificate. Select the valid certificate by clicking the box on the left then press the OK button.</p><img src=\"tool_pgplin24.png\"><p>In some cases a person may have more than one certificate, all appearing valid. Note that it's possible for anyone to upload a public certificate for anyone else, and that one of these keys may not belong to the person that owns the email address associated with it. In this case, verifying the fingerprint is extremely important.</p><p>A small notification window will pop up letting you know if you succeeded, and the Enigmail Key Manager will now show you the added certificates:</p><img src=\"tool_pgplin25.png\"><h3>4.0 Sending PGP encrypted mail</h3><p>Now you will send your first encrypted email to a recipient. In the main Mozilla Thunderbird window click the ?Write? button. A new window will open.</p><p>Write your message, and enter a recipient. For this test, select a recipient whose public key you already have. Enigmail will detect this and automatically encrypt the email (you can tell it will be encrypted by the golden key at the bottom right of the email).</p><img src=\"tool_pgplin26.png\"><p><b>Note that the subject line won't be encrypted, so choose something innocuous, like ?hello.?</b></p><p>When you click the ?Send? button, you'll be given a window to enter the password to your PGP Key. Remember this is different from your email password!</p><p>Enter your password then click the ?OK? button and your email will be encrypted and sent.</p><p>The body of the email was encrypted and transformed. For example our text above, was converted to this:</p><img src=\"tool_pgplin27.png\"><h3>4.1 Receiving PGP encrypted mail</h3><p>Let's go through what happens when you receive encrypted email. First, click on the message.</p><p>A small window opens asking you for the password to the PGP key. Remember: Don't enter your email password. Click the ?OK? button.</p><img src=\"tool_pgplin28.png\"><p>Now the message will show up decrypted</p><img src=\"tool_pgplin29.png\"><h3>5.0 Revoking the PGP Key</h3><p><b>a) Revoking your PGP Key through the Enigmail interface</b></p><p>The PGP keys generated by Enigmail automatically expire after five years. So if you lose all your files, you can hope that people will know to ask you for another key once the key has expired.</p><p>You might have a good reason to disable the PGP key before it expires. Perhaps you want to generate a new, stronger PGP key. The easiest way to revoke your own PGP key in Enigmail is through the Enigmail Key Manager. Right-click on your PGP key (it's in bold), and select the ?Revoke Key? option.</p><img src=\"tool_pgplin30.png\"><p>A window will pop up letting you know what happens and asking for your confirmation. Click the ?Revoke Key? button.</p><img src=\"tool_pgplin31.png\"><p>The password window opens, enter your password for the PGP key and click the ?OK? button.</p><p>Now a new window will open up letting you know you succeeded. Click the ?OK? button.</p><p>When you go back to the Enigmail Key Management window you'll notice a change to your PGP key. It is now grayed out and italicized.</p><img src=\"tool_pgplin32.png\"><p><b>b) Revoking a PGP Key with a revocation certificate</b></p><p>As mentioned before, the PGP keys generated by Enigmail automatically expire after five years. So if you lose all your files you can be sure that people will know to ask you for another key once the key has expired.</p><p>Like we mentioned before, you might have a good reason to disable the PGP key before it expires.</p><p>Similarly, others might have good reasons to revoke an existing key.</p><p>You might get sent revocation certificates from friends as a notice that they want to revoke their key.</p><p>In the previous section you might have noticed that Enigmail generates and imports a revocation certificate internally when you use the Enigmail Key Manager to revoke a key. Since you already have a revocation certificate, you will use the one you generated earlier to revoke your own key.</p><p>Start with the Enigmail Key Manager and click the ?File? menu and select ?Import Keys from File.?</p><img src=\"tool_pgplin33.png\"><p>A window will open up so you can select the revocation certificate. Click on the file, and click the ?Open? button. You'll get a notification that the certificate was imported successfully and that a key was revoked. Click the ?OK? button.</p><img src=\"tool_pgplin34.png\"><p>Once you click the ?OK? button, you'll be taken back to the Enigmail Key Manager and you see the certificate you revoked greyed out and italicized.</p><img src=\"tool_pgplin35.png\"><p>If the key you revoked is your own, and you previously uploaded your public key to the key servers, you will want to re-upload the now-revoked key to the key servers, so that others see not to use it anymore.</p><p>Now that you have all the proper tools, try sending your own PGP-encrypted email.</p>",
		"category": "Tools"
	}
]