[
	{
		"title": "RedPhone",
		"body": "<h1>REDPHONE TOOL GUIDE</h1><h2>RedPhone Tool Guide <br>Encrypted phone calls for Android </h2><p><b>Lesson to read: <br>? <a href=\"umbrella://lesson/making-a-call\">Making a Call</a></b><br><b>Download Location:</b> <a href=\"https://whispersystems.org/\">; can also be downloaded from the <a href=\"https://play.google.com/store/apps/details?id=org.thoughtcrime.redphone\">Google Play store</a><br><b>Computer requirements:</b> Android 2.2 and up<br><b>Version used in this guide:</b> RedPhone 0.9.6<br><b>License:</b> Free Open-Source Software; GPLv3<br><b>Level:</b> Beginner-Intermediate<br><b>Other reading:</b> <a href=\"http://support.whispersystems.org/\">http://support.whispersystems.org/</a><br><b>Time required:</b> 15 minutes</p><p><b>Using RedPhone will give you:</b><br>? The ability to make encrypted voice calls over a Wi-Fi or data connection using your normal phone number</p><p>NOTE: RedPhone only encrypts calls that are between two RedPhone users, or between users of RedPhone and Signal, the app for iPhones. (See <a href=\"umbrella://lesson/signal\">Signal Tool Guide</a> for instructions for iPhones)</p><h3>1.0 How to install RedPhone</h3><p><b>Step 1:</b> Download and install RedPhone</p><p>On your Android phone, enter the Google Play store and search for ?RedPhone.? Select the app, ?RedPhone :: Secure Calls.?</p><p>Select ?Install? and accept the Terms of Service by selecting ?Accept.? The app will download and install automatically.</p><img src=\"tool_redphone1.png\"><p><b>Step 2:</b> Register your mobile</p><p>Once you have installed the app, open it; you will automatically be prompted to register your mobile number.</p><img src=\"tool_redphone2.png\"><p>Once you have registered your mobile number, RedPhone will send you an SMS code to verify that the number belongs to you. Type in the code when prompted by the app. You have now successfully installed RedPhone and are ready to make encrypted calls!</p><h3>2.0 Using RedPhone</h3><p>In order to use RedPhone, the person that you are calling must also have RedPhone (or Signal) installed. If you try to call someone using the RedPhone app and they do not have it installed, the app will ask if you would like to invite them to use RedPhone via SMS, but it will not allow you to complete your call from inside the app.</p><img src=\"tool_redphone3.png\"><p>When you make a call to another RedPhone or Signal user (from either your default system dialer or from inside the app), you will be given a random pair of words. This word pair will allow you to verify your identity and keys with the other user?also known as key  verification.</p><img src=\"tool_redphone4.png\"><p>The trustworthiest way to verify the identity of a caller is to use out-of-band authentication to verify the word pair. You can also read the words aloud if you recognize the caller?s voice, although very sophisticated attackers might be able to defeat this if they needed to. The word pair must be identical.</p>",
		"category": "Tools"
	}
]