[
	{
		"title": "Pidgin",
		"body": "<h1>PIDGIN TOOL GUIDE</h1><h2>Pidgin Tool Guide <br>Encrypted instant messaging for Windows</h2><p><b>Lesson to read: <br>? <a href=\"umbrella://lesson/sending-a-message\">Sending a message</a></b><br><b>Download Location: </b><br>? <a href=\"https://pidgin.im/download/\">https://pidgin.im/download/</a> <br>? <a href=\"https://otr.cypherpunks.ca/\">https://otr.cypherpunks.ca/</a><br><b>Computer requirements:</b> An internet connection, a computer running Windows XP or higher, and an XMPP (Jabber) account.  <br><i>(Pidgin is able to work with many chat systems, such as AIM, Facebook, Google Talk, MSN, MXit and Yahoo, but here we'll focus on XMPP, formerly known as Jabber)</i><br><b>Version used in this guide: </b><br>? Windows 7 Ultimate<br>? Pidgin 2.10.9, pidgin-otr 4.0.0-1<br><b>License:</b> Free Software; mix of Free Software licenses<br><b>Level:</b> Beginner<br><b>Other reading:</b> <a href=\"https://pidgin.im/cgi-bin/mailman/listinfo/support\">https://pidgin.im/cgi-bin/mailman/listinfo/support</a><br><b>Time required:</b> 20 minutes</p><p><b>Using OTR with Pidgin will give you:</b><br>? The ability to organise and manage some of the most popular instant messaging services through a single program.<br>? The ability to have encrypted chats on instant messenger, without the server logging those chats.<br>? The ability to make sure that the person you are chatting with really is that person.</p><h3>1.0 Before you start </h3><p>Pidgin is an easy-to-use, instant messaging client for Windows that uses a protocol called OTR (Off-the-record), which allows users to have confidential conversations. </p><p>? Note: OTR should not be confused with Google's ?Off the record,? which just disables chat logging, and does not have encryption or verification capabilities.<br>? Pidgin supports the following IM services: AIM, Bonjour, Gadu-Gadu, Google Talk, Groupwise, ICQ, IRC, MSN, MXit,MySpaceIM, SILC, SIMPLE, Sametime, Yahoo!, Zephyr and any IM clients running the XMPP messaging protocol.<br>? Pidgin does not permit communication between different IM services. For instance, if you are using Pidgin to access your Google Talk account, you will not be able to chat with a friend using an ICQ account.<br>? However, Pidgin can be configured to manage multiple accounts based on any of the supported messaging protocols. That is, you may simultaneously use both Gmail and ICQ accounts, and chat with correspondents using either of those specific services (which are supported by Pidgin).<br>? Pidgin, automatically logs conversations by default, however you do have the ability to disable this feature. That said, you do not have control over the person with whom you are chatting?she could be logging or taking screenshots of your conversation, even if you yourself have disabled logging.</p><p><b>Why should I use Pidgin + OTR?</b><p>When you have a chat conversation using Google Hangouts or Facebook chat on the Google or Facebook websites, that chat is encrypted using HTTPS, which means the content of your chat is protected from hackers and other third parties while it?s in transit. It is not, however, protected from Google or Facebook, which have the keys to your conversations and can hand them over to authorities.</p><p>After you have installed Pidgin, you can sign in to it using multiple accounts at the same time. For example, you could use Google Hangouts, Facebook, and XMPP simultaneously. Pidgin also allows you to chat using these tools without OTR. Since OTR only works if both people are using it, this means that even if the other person does not have it installed, you can still chat with them using Pidgin.</p><p>Pidgin also allows you to do out-of-band verification to make sure that you?re talking to the person you think you?re talking to. For every conversation, there is an option that will show you the key fingerprints it has for you and the person with whom you are chatting. A \"key fingerprint \" is a string of characters like \"342e 2309 bd20 0912 ff10 6c63 2192 1928,? that?s used to verify a longer public key. Exchange your fingerprints through another communications channel, such as Twitter DM or email, to make sure that no one is interfering with your conversation.</p><p><b>Limitations: When should I not use Pidgin + OTR?</b></p><p>Pidgin is a complex program, which has not been written with security as a top priority. It almost certainly has bugs, some of which might be used by governments or even big companies to break into computers that are using it. Using Pidgin to encrypt your conversations is a great defence against the kind of untargeted surveillance that is used to spy on everyone's Internet conversations, but if you think you will be personally targeted by a well-resourced attacker (like a nation-state), you should consider stronger precautions, such as PGP -encrypted email.</p><h3>2 Downloading and installing</h3><h3>2.1 Getting Pidgin</h3><p>You can get Pidgin on Windows by downloading the installer from the Pidgin download page.</p><img src=\"tool_pidgin1.png\"><p>Click on the <i>purple</i> DOWNLOAD tab. <i><b>Don't</b> click the green Download Now button because you?ll want to choose a different installer file.</i> <p>You'll be taken to the download page.</p><img src=\"tool_pidgin2.png\"><p><i>Again, <b>don't</b> click the green Download Now button because we want to choose a different installer file. </i><p>The default installer for Pidgin is small because it doesn't contain all the information and downloads the files for you. This sometimes fails so you will have a better experience with the ?offline installer? which contains all the necessary installation material. </p><p>Click the ?<b>offline installer</b>? link. You will be taken to a new page titled ?Sourceforge? and after a few seconds, a small popup will ask whether you want to save a file.</p><p>? Note: While Pidgin's download page uses \"HTTPS\" and is therefore relatively safe from tampering, the website it directs you to to download the Windows version of Pidgin is currently Sourceforge, which uses unencrypted \"HTTP,\" and therefore offers no protection. That means that the software you download could be tampered with before you download it. This risk would mostly come from either someone with access to the local Internet infrastructure attempting to conduct targeted surveillance against you personally (for instance a malicious hot-spot provider), or a state or government planning to distribute compromised software to many users. The <a href=\"https://www.eff.org/https-everywhere\">HTTPS Everywhere</a> extension can rewrite Sourceforge download URLs to HTTPS, so it's recommended you install HTTPS Everywhere before downloading any other software. Additionally, in our experience, Sourceforge often has confusing full-page ads on its download pages that can trick people into installing something they may not want to.  You can install an ad blocker before any other software to avoid these confusing ads. </p><p>Many browsers will ask you to confirm whether you want to download this file. Internet Explorer 11 shows a bar at the bottom of the browser window with an orange border.</p><img src=\"tool_pidgin3.png\"><p>For any browser, it is best to first save the file before proceeding, so click the ?Save? button. By default, most browsers save downloaded files in the Downloads folder.</p><h3>2.2 Getting OTR</h3><p>You can get pidgin-otr, the OTR plugin for Pidgin, by downloading the installer from the <a href=\"https://otr.cypherpunks.ca/\">OTR download page</a>.</p><img src=\"tool_pidgin4.png\"><p>Click the ?Downloads? tab to be taken to the ?Downloads? section of the page. Click the ?Win32 installer for pidgin? link.</p><img src=\"tool_pidgin5.png\"><p>Many browsers will ask you to confirm whether you want to download this file. Internet Explorer 11 shows a bar at the bottom of the browser window with an orange border.</p><img src=\"tool_pidgin6.png\"><p>For any browser, it is best to first save the file before proceeding, so click the ?Save? button. By default, most browsers save downloaded files in the Downloads folder.</p><p>After downloading Pidgin and pidgin-otr you should have two new files in your </p><p>Downloads folder:</p><img src=\"tool_pidgin7.png\"><h3>2.3 Installing Pidgin</h3><p>Keep the Windows Explorer window open and double-click on pidgin-2.10.9-offline.exe. You'll be asked if you want to allow the installation of this program. Click the ?Yes? button.</p><img src=\"tool_pidgin8.png\"><p>A small window opens asking you to select a language. Click the ?OK? button.</p><img src=\"tool_pidgin9.png\"><p>A window opens up giving you a quick overview of the installation process. Click the ?Next? button.</p><img src=\"tool_pidgin10.png\"><p>Now you get a license overview. Click the ?Next? button.</p><img src=\"tool_pidgin11.png\"><p>Now you can see what different components are installed. Don't change the settings. Click the ?Next? button.</p><img src=\"tool_pidgin12.png\"><p>Now you can see where Pidgin will be installed. Don't change this information. Click the ?Next? button.</p><img src=\"tool_pidgin13.png\"><p>Now you'll see a window with scrolling text until it says ?Installation Complete.? Click the ?Next? button.</p><img src=\"tool_pidgin14.png\"><p>Finally, you?ll see the last window of the Pidgin installer. Click the ?Finish? button.</p><img src=\"tool_pidgin15.png\"><h3>2.4 Installing pidgin-otr</h3><p>Go back to the Windows Explorer window and open and double-click on pidgin-otr-4.0.0-1.exe. You'll be asked if you want to allow the installation of this program. Click the ?Yes? button.</p><img src=\"tool_pidgin16.png\"><p>A window opens up giving you a quick overview of the installation process. Click the ?Next? button.</p><img src=\"tool_pidgin17.png\"><p>Now you get a license overview. Click the ?I Agree? button.</p><img src=\"tool_pidgin18.png\"><p>You will see where pidgin-otr will be installed. Don't change this information. Click the ?Install? button.</p><img src=\"tool_pidgin19.png\"><p>Finally, you?ll see the last window of the pidgin-otr installer. Click the ?Finish? button.</p><img src=\"tool_pidgin20.png\"><h3>3 Configuration</h3><h3>3.1 Configuring Pidgin</h3><p>Go to the Start menu, click the Windows icon, and select Pidgin from the menu.</p><img src=\"tool_pidgin21.png\"><h3>3.2 Adding an account</h3><p>When Pidgin launches for the first time, you will see this welcome window giving you an option to add an account. Since you don't have an account configured yet, click the ?Add? button.</p><img src=\"tool_pidgin22.png\"><p>Now you'll see the ?Add Account? window. </p><p><b><i>Pidgin is able to work with many chat systems, such as AIM, Facebook, GoogleTalk, MSN, MXit and Yahoo, but here we'll focus on XMPP, formerly known as Jabber.</i></b></p><p>At the Protocol entry, select the ?XMPP? option.</p><p>At the Username entry, enter your XMPP username.</p><p>At the Domain entry, enter the domain of your XMPP account.</p><p>At the Password entry, enter your XMPP password.</p><p>Checking the box by the ?Remember password? entry will make accessing your account easier. Be aware that by clicking ?Remember password,? your password will be saved on the computer, making it accessible to anyone who may happen to access your computer. If this is a concern, do not check this box. You will then be required to enter your XMPP account password every time you start Pidgin.</p><img src=\"tool_pidgin23.png\"><h3>3.3 Adding a Buddy</h3><p>Now you will want to add someone to chat with. Click the ?Buddies? menu and select ?Add Buddy.? An ?Add Buddy? window will open.</p><img src=\"tool_pidgin24.png\"><p>At the ?Add Window,? you can enter the username of the person you want to chat with. This other user does not have to be from the same server, but does have to use the same protocol, such as XMPP.</p><p>At the ?Buddy's username? entry, enter your buddy?s username with the domain name. This will look like an email address.</p><p>At the ?(Optional) Alias? entry, you can enter a name of your choice for your buddy. This is entirely optional, but can help if the XMPP account of the person you are chatting with is hard to remember.</p><p>Click the ?Add? button.</p><img src=\"tool_pidgin25.png\"><p>Once you have clicked the ?Add? button, Boris will get a message asking if he gives authorization for you to add him. Once Boris does, he adds your account and you will get the same request. </p><p>Click the ?Authorize? button.</p><img src=\"tool_pidgin26.png\"><h3>3.4 Configuring the OTR plugin</h3><p>Now you will configure the OTR plugin so you can chat securely. Click the ?Tools? menu and select the ?Plugins? option.</p><img src=\"tool_pidgin27.png\"><p>Scroll down to the ?Off-the-Record Messaging? option, and check the box. </p><p>Click on the ?Off-the-Record Messaging? entry and click the ?Configure Plugin? button.</p><img src=\"tool_pidgin28.png\"><p>Now you will see the ?Off-the-Record Messaging? configuration window. Notice that is says ?No key present.? </p><p>Click the ?Generate? button.</p><img src=\"tool_pidgin29.png\"><p>Now a small window will open and generate a key. When it is done, click the ?OK? button.</p><img src=\"tool_pidgin30.png\"><p>You'll see new information: a 40 character string of text, broken up into 5 groups of eight characters. This is your OTR fingerprint. Click the ?Close? button.</p><img src=\"tool_pidgin31.png\"><p>Now click the ?Close? button on the Plugins window.</p><h3>4.0 Chatting securely</h3><p>You are now able to chat with Boris. The two of you can send messages back and forth. However, we're still not chatting securely. Even if you are connecting to the XMPP server, it is possible that the connection between you and Boris is not secure from snooping. </p><p>If you look at the chat window, notice that it says ?Not private? in red on the bottom right. Click the ?Not private? button.</p><img src=\"tool_pidgin32.png\"><p>A menu will open up, select ?Authenticate buddy.?</p><img src=\"tool_pidgin33.png\"><p>A window will open up. You are asked: ?How would you like to authenticate your buddy??</p><p>The drop-down has three options:</p><p><b>Option 1: Shared secret</b></p><p>A shared secret is a line of text you and the person you want to chat have agreed to use ahead of time. You should have shared this in person and never have exchanged it over insecure channels such as email or Skype.</p><p>You and your buddy need to enter this text together. Click the ?Authenticate? button.</p><img src=\"tool_pidgin34.png\"><p>The shared secret verification is useful if you and your buddy have already made arrangements to chat in the future but haven't yet created OTR fingerprints on the computer you are using.</p><p><b>Option 2: Manual fingerprint verification</b></p><p>Manual fingerprint verification is useful if you were already given your buddy's fingerprint and are now connecting with Pidgin. This will not be useful if your buddy changed computers or had to create new fingerprints.</p><p>If the fingerprint you were given and the fingerprint on the screen match, select ?I have? and click the ?Authenticate? button.</p><img src=\"tool_pidgin35.png\"><p><b>Option 3: Question and answer</b></p><p>Question and answer verification is useful if you know your buddy but have not established a shared secret nor had a chance to share fingerprints. This method is useful to establish verification based on something both of you know, like a shared event or memory.</p><p>Enter the question you want to ask. Don't make it so simple that someone can guess it easily, but don't make it impossible. An example of a good question would be ?Where did we go for dinner in Minneapolis?? And example of a bad question would be ?Can you buy apples in Tokyo??</p><p><b>The answers must match exactly; so keep that in mind when choosing an answer to your question. Capitalization matters, so you might consider including a note like (for example: use capitals, lower case).</b></p><p>Enter the question and answer then click the ?Authenticate? button.</p><img src=\"tool_pidgin36.png\"><p>Your buddy will have a window open with the question displayed asking for the answer. They will have to answer and click the ?Authenticate? button. Then they will receive a message letting them know if the authentication was successful.</p><img src=\"tool_pidgin37.png\"><img src=\"tool_pidgin38.png\"><p>Once your buddy had completed the authentication procedure, you will get a window letting you know the authentication succeeded.</p><img src=\"tool_pidgin39.png\"><p>Your buddy should also verify your account so that both of you can be sure that the communication is secure. Here is what it would like for Akiko and Boris. Notice the green ?Private? icons in the lower right of the chat window.</p><img src=\"tool_pidgin40.png\"><h3>5 Working with other software</h3><p>The mechanisms to verify the authenticity should work between different chat software such as Jitsi, Pidgin, Adium, and Kopete. You are not required to use the same chat software to use chat over XMPP and OTR, but sometimes there are errors in the software. Adium, a chat software for OS X, has an error receiving the Question and Answer verification. If you find that verifying others is failing for you when you are using Question and Answer verification, check whether they are using Adium and see if you can use another verification method.</p>",
		"category": "Tools"
	}
]