[
	{
		"title": "Jitsi",
		"body": "<h1>JITSI TOOL GUIDE</h1><h2>Jitsi Tool Guide<br>Secure Audio, Video and Instant Messaging</h2><p><b>Lesson to read: <a href=\"umbrella://lesson/making-a-call\">Making a Call</a></b><br><b>Download Location:</b> <a href=\"https://jitsi.org/Main/Download\">https://jitsi.org/Main/Download</a><br><b>Computer requirements</b> All Windows Versions, Mac OS X, Ubuntu, Linux<br><b>Version used in this guide:</b> Jitsi 2.4<br><b>License:</b> Free and Open-Source Software<br><b>Level:</b> Beginner<br><b>Time required:</b> 15-20 minutes</p><h3>1.1 Getting started</h3><p><b>Using Jitsi will give you: </b><br>? A secure alternative to Skype that encrypts calls, messages and video all the way from your computer to the recipient's computer. <br>? The ability to register various accounts that you may already have (such as Facebook, MSN, Google Talk or Yahoo Messenger), with Jitsi and use it to communicate in them simultaneously. <br>? The ability to communicate securely and simultaneously with other programs recommended in this app such as Pidgin, Adium and ChatSecure. </p><h3>2.1 How to Install Jitsi</h3><p>To install Jitsi, perform the following steps:</p><p><b>Step 1.</b> Double click ?jisi-2.4-latest-x86.exe?; the <i>Open File - Security Warning</i> dialogue box may appear. If it does, click ?Next? to activate the <i>Windows Installer</i> screen, followed by the <i>Welcome to the Jitsi Setup Wizard</i> window.</p><p><b>Step 2.</b> Click ?Next? to activate the <i>End User License Agreement</i> window; check the <i>I accept the terms in the License Agreement</i> option to enable the <i>Next</i> button, and then click ?Next? to activate the <i>Destination Folder</i> window.</p><p><b>Step 3.</b> Click ?Next? to activate the <i>Additional Tasks</i> window and accept the default settings as presented.</p><p><b>Note:</b> Enabling the <i>Auto-start when computer restarts or reboots</i> option may slow down the overall function of your computer, especially if you already have multiple applications configured to run when your computer starts up.</p><p><b>Step 4.</b> Click ?Next? to activate the <i>Ready to Install Jitsi</i> window, and then click ?Install? to activate the <i>Installing Jitsi</i> window displaying the installation progress bar.</p><p><b>Step 5.</b> Click ?Finish? to complete the installation process and automatically launch the <b>Jitsi</b> <i>Sign in</i> window as follows:</p><img src=\"tool_jitsi1.png\"><p><b>Note:</b> In some instances, installing and launching Jitsi for the first time triggers a <i>Windows Security Alert</i> prompt screen, as shown below. </p><p><b>Step 6.</b> Select both <b>Private</b> and <b>Public</b> networks check-boxes, and then click <i>Allow access</i>*** to see the <i>Jitsi Sign in window</i> or main user interface window.</p><img src=\"tool_jitsi2.png\"><h3>2.2 How to Add Accounts in Jitsi</h3><p>Please note that even with Jitsi encryption, account providers like Google or Facebook are monitoring the very fact that you are communicating (and perhaps with whom you are communicating), and may share this information with third-parties, such as corporations or governments. Therefore it is perhaps best to avoid using those accounts for very sensitive communication even with Jitsi encryption. </p><h3>2.2.1 How to Add a Gmail/Google Account</h3><p><b>Note:</b> The example which follows is based on a Google Talk account, the set-up process for the other communication protocols is similar. Communications or some encryption features may not work between users of different account providers (like Facebook, Gmail, Yahoo, etc.). However, they should work when communicating between two accounts from the same provider.</p><p><b>Step 1.</b> Select <b>Start > Jitsi</b> or double-click the Jitsi desktop icon to open Jitsi.</p><p><b>Step 2.</b> In the <i>sign in</i> window, type in the username and password of the Gmail account you would like to use for chat purposes, so that it resembles the following:</p><img src=\"tool_jitsi3.png\"><p><b> Note:</b> You can add multiple accounts using different protocols at the same time.</p><p><b>Step 3.</b> Click ?Sign in? to activate your account chat window.</p><p><b>Note:</b> If you closed <i>Sign in</i> window, or you want to add another account, you can add it by selecting <b><i>File > Add new account...</i></b> menu. In the new window select <b>Network</b> as <i>Google Talk</i> and type in the user name and password of the Gmail account as shown on the image below:</p><img src=\"tool_jitsi4.png\"><p>To verify that you have registered your Gmail account with Jitsi, perform the following steps:</p><p><b>Step 1.</b> Select <b>Tools > Options</b> in the menu to activate the following window:</p><img src=\"tool_jitsi5.png\"><p><b>Note:</b> If you are using 2-step verification to protect access to your Gmail account, when you try to log in from Jitsi with your regular password you may see a message like the one below. To log in using Jitsi, you will need to generate an \"application-specific password\". See Google's <a href=\"https://support.google.com/accounts/answer/185833?hl=en\">instructions on how to do this</a>.</p><h3>2.2.2 Registering new Jabber/XMPP or SIP account and adding it to Jitsi<h3><p>Jabber/XMPP and SIP are open standards of text and voice communication. There are many servers that offer free accounts which you can use with Jitsi. Below we are recommending some of the servers that you could use for sensitive communication. </p><p>? <b>Riseup.net</b> Jabber/XMPP account</p><p>If you have account on the Riseup.net secure email service (located in the USA) you may use this account also to communicate over Jabber/XMPP network by adding this account to Jitsi - see below on how to add existing Jabber/XMPP account.</p><p>? <b>Jabber.ccc.de</b> and other Jabber/XMPP accounts</p><p>You can register an account on Jabber.ccc.de server (located in Germany) by taking following steps:</p><p><b>Step 1.</b> In Jitsi, select <b><i>File > Add new account...</i></b> in the menu. In the new window, select <b><i>Network:</i> XMPP</b> and check the <i>Create a new XMPP account*** option</i>. In <i>*Server</i>, type jabber.ccc.de, type in the XMPP username you would like to create, and fill in the <i>Password</i> and <i>Confirm</i> password fields so that it resembles the following:</p><img src=\"tool_jitsi6.png\"><p><b>Step 2.</b> Click <b>Add</b>. After successful registration you will be presented with a window similar to that above.<p><p>If the username which you requested is already taken by somebody else, the registration process will fail with the message <i>We failed to create your account due to the following error: Could not confirm data</i>. You can try again by repeating the process and selecting a different username.</p><p><b>Note</b> that if you do not log in to your jabber.ccc.de for longer than 12 months your account will be automatically removed from the server and the username will become available for registration by other people.</p><p>? <b>ostel.co</b> SIP account</p><p><b>SIP</b> accounts cannot be registered from within the Jitsi program. The <b>ostel.co</b> server (located in USA) offers <a href=\"https://ostel.co/users/sign_up\">registration on their web page</a>. Select a username, password and provide your existing email address and click the <i>Sign up</i> button on the web page. After successful registration come back to Jitsi program. Select <b><i>File > Add new account...</i></b> in the menu, select <b>Network: SIP</b>, type in your username (e.g. terence.the.tester@ostel.co) and the password you created during the web registration and click <b><i>Add</i></b>. See following image for reference:</p><img src=\"tool_jitsi7.png\"><p>? <b>Adding existing Jabber/XMPP or SIP account to Jitsi</b></p><p>If you already have Jabber/XMPP or SIP account you can add it to Jitsi by selecting <b><i>File > Add new account...</i></b> in the menu and selecting the appropriate Network (either XMPP or SIP depending on the account type).</p><h3>2.2.3 How to Add a Facebook Account</h3><p>Facebook has two settings that you may need to change before Jitsi can connect to your Facebook Chat.</p><p>? <b>Facebook Username</b></p><p>Facebook requires a username for Jitsi to connect to Facebook chat. Many Facebook users already have a username. To check your username, log in to your Facebook account: your username is what appear in the location bar of your browser after <i>https://www.facebook.com/</i> when you view your Timeline or Page. Your username is also in your Facebook email address for your personal account (ex: username@facebook.com). You can see or change the username or get one by going to your <i>Account Settings > General</i> section or by visiting <a href=\"https://www.facebook.com/username\">https://www.facebook.com/username</a>. To set username Facebook may ask you for your account verification which may require sending SMS to a mobile phone number which you will need to provide to Facebook in the process of verification.</p><p>? <b>App Settings</b></p><p>Facebook?s ?application platform? must be turned on before <b>Jitsi</b> can connect to Facebook Chat. Visit your Facebook <i>Account Settings > Apps</i> section and check that the setting for Apps you use is turned On. This turns \"application platform\" on for your account.</p><p><b>Note</b> that that turning Facebook?s \"application platform\" opens up much of your Facebook data to third-party application developers. This data is available not only to the Facebook applications that you use, but also Facebook applications used by any of your friends. After turning on Facebook?s \"application platform\", be sure to check the settings under \"Apps others use\". This setting allows you to hide some personal information from applications used by your friends. Unfortunately, Facebook does not offer settings to hide all personal information. Certain categories of information (like your friend list, gender, or info you have made public) are visible as long as Facebook?s \"application platform\" is turned \"on\". It is up to you to determine whether this is an acceptable tradeoff of your privacy.</p><p>Now you are prepared to add your Facebook account to Jitsi. To do this follow the steps below:</p><p><b>Step 1.</b> From the main menu select <b><i>File > Add New Account...</i></b></p><p><b>Step 2.</b> In the Add New Account dialogue, <b>Network</b> menu choose <i>Facebook</i>, enter your username and password and Click <b>\"Add\"</b></p><img src=\"tool_jitsi8.png\"><h3>2.3 How to change password for account with Jitsi</h3><p>It is important element of security to know how to change the password for each account that one has. Many of the accounts that you can use with Jitsi offer changing password as a part of their settings, which are accessible over web interface. However some Jabber/XMPP and SIP account will not have any web interface to manage them. You can change password for those account using Jitsi by following steps below:</p><p><b>Step 1.</b> Select <b><i>Tools > Options</i></b> in the menu, select the <b><i>Accounts</i></b> tab</p><p><b>Step 2.</b> Click on <b><i>Edit</i></b> button on the bottom to activate a new window.</p><p><b>Step 3.</b> Click on <b><i>Change account password</i></n> to activate <i>Change account password</i> window.</p><p><b>Step 4.</b> Enter new password and Re-enter password and click on <b><i>OK</i></b> button to close this window.</p><p><b>Step 5.</b> Close Account Registration Wizard.</p><h3>2.4 How to configure Jitsi to improve it's security</h3><h3>2.4.1 Disable and remove call and chat history</h3><p>Jitsi by default stores information about the incoming and outgoing voice/video calls and the history of your text chats -- all messages that you sent and received. You can access voice/video calls by clicking on the clock icon on the main Jitsi window:</p><img src=\"tool_jitsi9.png\"><p>You can see the text chat history by clicking on the egg-timer like icon in the text chat window while chatting with a contact:</p><img src=\"tool_jitsi10.png\"></p>Even if you encrypt the text chat with OTR all the text messages you send and receive are stored on your computer in open text format.</p><p> To prevent Jitsi collecting this information (and remove already gathered data), you and your contact should take the following steps.</p><p><b>To disable Jitsi from collecting the information:</b></p><p><b>Step 1.</b> Select <b><i>Tools > Options</b></i> in the menu, select the <b><i>General</i></b> tab and uncheck the <b><i>Log chat history</i></b> option.</p><p><b>Step 2.</b> in the <i>Options</i> window, first <b>select the Advanced</b> tab, then <b>select the <i>Logging</i></b> section, and then <b>uncheck the <i>Enable packet logging</i></b> option as shown below:</p><img src=\"tool_jitsi11.png\"><p>Your changes will take effect after you restart Jitsi.</p><p><b>To remove already collected information about your calls and text messages:</b></p><p><b>Step 1.</b> Quit Jitsi.</p><p><b>Step 2.</b> Remove the entire log history folder <i>history_ver1.0</i> from the Jitsi user profile folder. You can remove a sub-folder of <i>history_ver1.0</i> if you want to dispose of only part of the history. The location of the <i>user profile</i> and <i>log history</i> folders depends on the operating system:<p><p>? On Windows XP and earlier, this is located in <i>C:\\Documents and Settings\\&lt;Windows login/user name&gt;\\Application Data\\Jitsi\\history_ver1.0</i><br>? On Windows Vista, 7, 8, this is <i>C:\\Users\\&lt;Windows login/user name&gt;\\AppData\\Roaming\\Jitsi\\history_ver1.0</i><br>? Mac OS X: from your home folder <i>~/Library/Application Support/Jitsi/history_ver1.0</i><br>? Linux: from your home folder <i>~/.jitsi/history_ver1.0</i></p><p>See the <a href=\"umbrealla://lesson/safely-deleting\">Secure Deleting lesson</a> for more on how to dispose of information securely.</p><h3>2.4.2 Require private messaging when text chatting</h3><p>It is recommended that you set Jitsi up to require private and encrypted text messaging using OTR encryption whenever possible. To do this, select <b><i>Tools > Options</i></b> in the menu, select the <b><i>Security</i></b> tab, select the <b><i>Chat</i> sub-tab and check <b><i>Require private messaging</i></b> at the bottom of the screen.</p><h3>2.4.3 Protect passwords to your accounts with master password</h3><p>It is best not to let Jitsi remember passwords to your accounts. If you decide otherwise for ease of use anybody who gets access to your computer will be able to log in to your accounts by simply starting Jitsi. It will also be possible to view your passwords in the Options window. It is therefore <b>strongly recommended</b> to protect passwords to your accounts with good master password. Once you set up the master password, Jitsi will ask you for it upon starting the program.</p><p><b>Step 1.</b> Open the Options window by selecting <b><i>Tools > Options</i></b> in the menu, select the <b><i>Security</i></b> tab and <b><i>Passwords</i></b> sub-tab, and check <b><i>Use a master password</i></b> to activate the <b><i>Master Password</i></b> window.</p><p><b>Step 2.</b> In the new window, type in your password. For more on creating a strong password, see the <b><a href=\"umbrella://lesson/passwords\">Password lesson</a></b>.</p><p><b>Step 3. Click <i>OK</i></b> to confirm the password and activate a new window which should say <b><i>Master Password successfully set up</i></b>. Click \"<b>OK<b>\" to close it and come back to the <i>Options</i> window which should resemble below:</p><img src=\"tool_jitsi12.png\"><p><b>Note:</b> The <b><i>Change Master Password</i></b> button lets you change the master password and the <b><i>Saved Passwords...</i></b> button lets you access the list of passwords remembered by Jitsi and remove them if need be.</p><h3>Jitsi - Add contacts and communicate text & voice</h3><h3>3.1 Add contacts (buddies) to Jitsi</h3><p>After adding at least one account to Jitsi and logging in, you are ready to add your contacts and communicate with them.</p><p><b>Step 0.</b> Open the Jitsi main window by selecting <b><i>Start > Jitsi</i></b> or double-clicking the Jitsi desktop icon.</p><p><b>Step 1.</b> Select <b><i>File > Add contact...</i></b> which will open the following window:</p><img src=\"tool_jitsi13.png\"><p><b>Step 2.</b> Select which of your accounts you would like to add this contact to (for example <i>terance.the.tester@jit.si</i>).</p><p><b>Optional:</b> You may also add the contact to a group among your other contacts. However, first you must create the group. You can do this by selecting <b><i>File > Create group...</b></i> from the menu).</p><p>Type in your contact's user name or address into the <b><i>ID or Number</i></b> field (for example, <i>sally.the.doer@jit.si</i>).</p><p>You can choose the name or nickname for the contact, which will be visible in your contacts list in the Jitsi main window; type it into the <b><i>Display name</i></b> field.</p><p><b>Step 3.</b> Click on <i>Add</i> to close the <i>Add contact</i> window and come back to Jitsi main window. In your contact list you will now see your new contact added with the note \"Waiting for authorisation\".</p><p><b>Step 4.</b> When your contact (sally.the.doer@jit.si) logs in to her account, a pop-up window will inform her that you have requested to add her to your list of contacts:</p><p>Your contact has a choice of selecting the <i>Ignore</i> option, in which case your request will continue awaiting authorisation; <i>Deny</i>, in which case you will receive information that your request was rejected; and <i>Authorise</i>, in which case you will receive information that your contact has accepted your authorisation request, and the entry for your contact in your contact list will become active.</p><h3>3.2 Text chat (Instant Messaging) with OTR encryption</h3><p>Now that you added and authorised your contact, you can click on their name in the contact list and initiate text conversation, voice or video calls, and desktop sharing, by choosing the relevant icon under their name:</p><img src=\"tool_jitsi14.png\"><p>Step 1. We will now explore one of Jitsi's most important features: the ability to text chat securely, encrypting your messages with OTR. OTR functions in a similar manner to GPG/PGP described in other chapters in this toolkit. Just as with PGP, before you and your contact can encrypt your communications, you both need to configure Jitsi to generate your encryption keys. You can do this by selecting <b><i>Tools > Options</i></b> menu and selecting the <b><i>Security</i></b> tab and <b><i>Chat</i></b> sub-tab. You will then see a window similar to one shown in the image below:</p><img src=\"tool_jitsi15.png\"><p><b>Step 2.</b> Next, click the <b><i>Generate</i></b> button. As a result you will see the fingerprint of the key that has been generated:</p><img src=\"tool_jitsi16.png\"><p>One key is generated per account. You only need to do this again if you add a new account or install Jitsi on another device and do not move the existing keys to it.</p><p>Now you are ready to communicate:</p><p><b>Step 3.</b> Select a contact from Jitsi main window and click on the <i>send message</i> icon (first from the left under the contact's name) to open a text chat window:</p><img src=\"tool_jitsi17.png\"><p>Note the <i>Encrypt chat with OTR</i> icon, the open padlock on the right-top side of the window. This inconspicuous symbol informs you whether the chat is encrypted or not. Now the lock is open (there is a tiny space between handle and the body of the lock!).</p><p><b>Step 4.</b> Click on the <b><i>Encrypt chat with OTR</b></i> icon. Note the changes in the window:</p><img src=\"tool_jitsi18.png\"><p><p>Observe that the padlock is now locked. This means that whatever messages you and your contact send to each other are encrypted. Note the message that this is an <i>unverified private</i> conversation and that you should <i>authenticate</i> sally.the.doer@jit.si.</p><p><b>Step 5.</b> Click on the link <b><i>authenticate sally.the.doer@jit.si</i></b> to open the <i>Authenticate Buddy</i> window:</p><img src=\"tool_jitsi19.png\"><p>Note the message that encourages you to compare the fingerprints of your keys with your contact over another channel (not this text chat). In doing this, you can be more certain that you are communicating with your contact and not somebody else. A good choice for key comparisons is to do it face to face, or via video or voice communication as these provide easier means to authenticate the identity of the other person. After you compare fingerprints, select the option <b><i>I have verified</i></b> the fingerprint from the pull-down menu and click on <b><i>Authenticate Buddy</i></b>:</p><img src=\"tool_jitsi20.png\"><p>Closing the <i>Authenticate Buddy</i> window returns you to the chat window.</p><img src=\"tool_jitsi21.png\"><p>Note that padlock no longer includes the orange triangle with the white exclamation mark. This means that you have authenticated your contact. <b>The authentication should be done only once per contact.</b> If the triangle with exclamation mark returns, it means that you are chatting to somebody who you have not yet authenticated. This can happen when your contact moves to another device with another encryption key (another installation of Jitsi, or another OTR enabled program, etc.). In this case you will need to re-authenticate each other again to be sure of the identity of person with whom you communicate.</p><p>Jitsi allows you to text chat with more than one person in the same time. OTR encryption will only work when chatting to one person.</p><h3>3.3 Voice and video chat with ZRTP encryption</h3><p>Jitsi offers voice and video chats which can be independently encrypted with open standard called ZRTP. In order to initiate the chat you need to</p><p><b>Step 1.</b> Click on the contact in Jitsi contact list and click on the voice (second icon from the left under the contact's name) or video (third) icon. A new window will appear indicating that Jitsi is establishing the connection:</p><img src=\"tool_jitsi22.png\"><p>Your contact will see an incoming call notification.</p><p><b>Step 2.</b> If your contact accepts the call you will receive information that you are connected:</p><img src=\"tool_jitsi23.png\"><p><b>Note</b> the red open padlock. This means that your call is not yet encrypted with ZRTP.</p><p><b>Step 3.</b> Wait... Your and your contact's programs are establishing an encrypted connection, which may take a moment. If they succeed you will see the letters <i>zrtp</i> appear against an orange background with a closed padlock like below. If they don't succeed in establishing a connection, you still can chat but without encryption. You can disconnect, restart Jitsi and try again to see if this time the programs will connect with encryption. ZRTP may not work in calls between accounts from different providers (such as between Google and Jit.si).</p><img src=\"tool_jitsi24.png\"><p><b>Step 4.</b> Observe the section under the letters <i>zrtp</i> and padlock with the message \"Compare with partner\" followed by 4 characters. Read these letters to your contact and ask if she sees the same characters. If she does, it means that your communication is encrypted and nobody is interfering with it. You can click <b><i>Confirm</i></b>. The orange <i>zrtp</i> field will turn green:</p><img src=\"tool_jitsi25.png\"><p><b>Step 5.</b> You may close the black confirmation section of the window by clicking on the white x sign on upper-right part of the black section:</p><p>Jitsi lets you voice and video chat with more than one person. Note that with this communication, ZRTP encryption can be engaged between initiator of the call and other parties, but not between parties themselves.</p>",
		"category": "Tools"
	}
]