[
	{
		"title": "Tor for Mac OS X",
		"body": "<h1>TOR FOR MAC TOOL GUIDE</h1><h2>Tor for Mac Tool Guide </h2><p><b>Lesson to read: <a href=\"umbrella://lesson/the-internet\">The Internet</a></b><br><b>This guide outlines how to use the <a href=\"https://www.torproject.org/projects/torbrowser.html.en\">Tor Browser Bundle</a> on Mac.</b><b>Computer requirements:</b> An internet connection, a computer running Mac OS X<br><b>Version used in this guide:</b> Tor Browser Bundle: 3.6.2<br><b>License:</b> Free Software; mix of Free Software licenses<br><b>Level:</b> Intermediate<br><b>Other reading:</b> <a href=\"https://tor.stackexchange.com/\">https://tor.stackexchange.com/</a><br>Time required:</b> 15-30 minutes</p><p><b>Using Tor will give you:</b><br>? The ability to get around internet censorship<br>? The ability to get online anonymously</p><h3>1.0 Before you start </h3><p>Tor is a volunteer-run service that provides both privacy and anonymity online by masking who you are and where you are connecting. The service also protects you from the Tor network itself.</p><p>For people who might need occasional anonymity and privacy when accessing websites, Tor Browser provides a quick and easy way to use the Tor network.</p><p>The easiest way to use the Tor network is to use the Tor Browser Bundle, which combines a web browser, the Tor software, and other helpful software that will give you a way of more securely accessing the web.</p><p><b>The Tor Browser works just like other web browsers, except that it sends your communications through Tor, making it harder for people who are monitoring you to know exactly what you're doing online, and harder for people monitoring the sites you use to know where you're connecting from. Keep in mind that only activities you do inside of Tor Browser itself will be anonymised. Having Tor Browser installed on your computer does not make things you do on the same computer using other software (such as your regular web browser) anonymous.</b></p><h1>2.0 Getting Tor Browser Bundle</h1><p>Open a browser like Mozilla Firefox or Internet Explorer and type: <a href=\"https://www.torproject.org/projects/torbrowser.html.en\">https://www.torproject.org/projects/torbrowser.html.en</a> in the URL bar. If you are using a search engine to look for the Tor Browser Bundle, make sure that the URL is correct.</p><img src=\"tool_torosx1.png\"><p>Click the big purple download button to get the installation program for Tor Browser Bundle.</p><img src=\"tool_torosx2.png\"><p>The website will have detected your operating system and you'll get the correct file for Windows. If, for any reason, you want a different installer file you can scroll down to the Tor Browser Downloads section.</p><img src=\"tool_torosx3.png\"><p>Many browsers will ask you to confirm whether you want to download this file. </p><p>For any browser, it is best to save the file first before proceeding. So click the Save button. </p><h3>2.1 Installing Tor Browser Bundle</h3><p>After the download is complete, you might get an option to open the folder where the file was downloaded to. The default location is the Downloads folder.</p><p>Double-click on the Tor Browser installer. This opens the .dmg file. </p><p>(On recent versions of OS X, you might get a warning that it's from an \"unidentified developer\" ? you can get around this complaint by control-clicking and selecting \"open\".)  </p><p>Drag the included file into your Applications folder and you will have a Tor Browser application in your chosen language that you can pin on your Dock.</p><img src=\"tool_torosx4.png\"><p><b>Starting Tor Browser for the first time</b></p><p>Open the Tor Browser folder from your Applications folder and double click on the file called Tor Browser.</p><p>The first time Tor Browser starts, you may get a window that allows you to modify some settings if necessary. You might have to come back and change some configuration settings, but go ahead and try to connect to the Tor network by clicking the Connect button.</p><p>After clicking the connect button, a new window will open with a green bar that will get longer as the Tor software starts up.</p><img src=\"tool_torosx5.png\"><p>The first time Tor Browser starts it might take a bit longer than usual, but be patient, within a few minutes Tor Browser will be done and a web browser opens up congratulating you.</p><img src=\"tool_torosx6.png\">",
		"category": "Tools"
	}
]