[
	{
		"title": "Tor for Windows",
		"body": "<h1>TOR FOR WINDOWS TOOL GUIDE</h1><h2>Tor for Windows Tool Guide<br>Online Anonymity and Circumvention</h2><p><b>Lesson to read: <a href=\"umbrella://lesson/the-internet\">The Internet</a></b><br><b>This guide outlines how to use the <a href=\"https://www.torproject.org/projects/torbrowser.html.en\">Tor Browser Bundle</a> on Windows.</b><b>Computer requirements:</b> An internet connection, a computer running Windows<br><b>Version used in this guide:</b> Windows: Windows 7 Ultimate; Tor Browser Bundle: 3.6.2<br><b>License:</b> Free Software; mix of Free Software licenses<br><b>Level:</b> Intermediate<br><b>Other reading:</b> <a href=\"https://tor.stackexchange.com/\">https://tor.stackexchange.com/</a><br>Time required:</b> 15-30 minutes</p><p><b>Using Tor will give you:</b><br>? The ability to get around internet censorship<br>? The ability to get online anonymously</p><h3>1.0 Before you start </h3><p>Tor is a volunteer-run service that provides both privacy and anonymity online by masking who you are and where you are connecting. The service also protects you from the Tor network itself.</p><p>For people who might need occasional anonymity and privacy when accessing websites, Tor Browser provides a quick and easy way to use the Tor network.</p><p>The easiest way to use the Tor network is to use the Tor Browser Bundle, which combines a web browser, the Tor software, and other helpful software that will give you a way of more securely accessing the web.</p><p><b>The Tor Browser works just like other web browsers, except that it sends your communications through Tor, making it harder for people who are monitoring you to know exactly what you're doing online, and harder for people monitoring the sites you use to know where you're connecting from. Keep in mind that only activities you do inside of Tor Browser itself will be anonymised. Having Tor Browser installed on your computer does not make things you do on the same computer using other software (such as your regular web browser) anonymous.</b></p><h3>2.0 Getting Tor Browser Bundle</h3><p>Open a browser like Mozilla Firefox or Internet Explorer and type: <a href=\"https://www.torproject.org/projects/torbrowser.html.en\">https://www.torproject.org/projects/torbrowser.html.en</a> in the URL bar. If you are using a search engine to look for the Tor Browser Bundle, make sure that the URL is correct.</p><img src=\"tool_torwin1.png\"><p>Click the big purple download button to get the installation program for Tor Browser Bundle.</p><img src=\"tool_torwin2.png\"><p>The website will have detected your operating system and you'll get the correct file for Windows. If, for any reason, you want a different installer file you can scroll down to the Tor Browser Downloads section.</p><img src=\"tool_torwin3.png\"><p>Many browsers will ask you to confirm whether you want to download this file. Internet Explorer 11 shows a bar at the bottom of the browser window with an orange border.</p><img src=\"tool_torwin4.png\"><p>For any browser, it is best to save the file first before proceeding. So click the Save button. This example shows Tor Browser Bundle version 3.6.2, which was the current version at the time we wrote this. There will probably be a more recent version available for download by the time you read this.</p><h3>2.1 Installing Tor Browser Bundle</h3><p>After the download is complete, you might get an option to open the folder where the file was downloaded to. The default location is the Downloads folder. Double-click on the file <i>torbrowser-install-3.6.2_en-US.exe</i></p><img src=\"tool_torwin5.png\"><p>After double-clicking on the Tor Browser installer, a window will open with a warning about the origin of the software. You should always take these warnings seriously and make sure you trust the software you want to install and that you got an authentic copy from the official site over a secure connection. Since you know what you want, and you know where to get the software, and the download was from the Tor Project's secure HTTPS site, go ahead and click Run.</p><img src=\"tool_torwin6.png\"><p>A small window will open asking what language you want to use for the Tor Browser Bundle. There are several to choose from. Pick the language you want and click the OK button.</p><img src=\"tool_torwin7.png\"><p>You'll find a new window that will tell you where the Tor Browser Bundle will be installed. The default location is your desktop. You can change this to be a different location if you want, but for now keep the default.</p><img src=\"tool_torwin8.png\"><p>The installation process is complete when you see a window that says you have completed the installation process. If you click the Finish button, the Tor Browser will start immediately. For now, uncheck the box by ?Run Tor Browser Bundle.? We'll come back to using Tor Browser Bundle in a bit. If you missed unchecking the checkbox and Tor Browser starts, just close the window for now.</p><img src=\"tool_torwin9.png\"><p>Tor Browser Bundle will not be installed with other programs and will not show up in your start menu.</p><img src=\"tool_torwin10.png\"><h3>3.0 Using Tor Browser Bundle</h3><p><b>Starting Tor Browser for the first time</b></p><p>You chose not to start Tor Browser when you finished with the installer, so now go ahead and start Tor Browser for the first time. If you followed all the default settings from the installation you'll see a folder on your desktop called Tor Browser.</p><img src=\"tool_torwin11.png\"><p>Open the Tor Browser folder and double click on the file called Start Tor Browser.</p><img src=\"tool_torwin12.png\"><p>The first time Tor Browser starts, you'll get a window that allows you to modify some settings if necessary. You might have to come back and change some configuration settings, but go ahead and try to connect to the Tor network by clicking the Connect button.</p><img src=\"tool_torwin13.png\"><p>After clicking the connect button, a new window will open with a green bar that will get longer as the Tor software starts up.</p><img src=\"tool_torwin14.png\"><p>The first time Tor Browser starts it might take a bit longer than usual, but be patient, within a few minutes Tor Browser will be done and a web browser opens up congratulating you.</p><img src=\"tool_torwin14.png\">",
		"category": "Tools"
	}
]