[
	{
		"title": "Facebook",
		"body": "<h1>HOW TO CHANGE YOUR FACEBOOK PRIVACY SETTINGS</h1><h2>How to change your Facebook privacy settings</h2><p><b>Lesson to read: <a href=\"umbrella://lesson/social-media\">Social Media</a></b><br><b>Level:</b> Beginner<br><b>Time required:</b> 10 minutes</p><h3>How to Protect Your Privacy from Facebook's Graph Search</h3><p>Facebook now has a feature?Graph Search?that has been the subject of many privacy concerns. Graph Search allows users to make structured searches to filter through friends, friends of friends, and strangers. This feature relies on your profile information being made widely or publicly available, yet there are some Likes, photos, or other pieces of information that you might not want out there.</p><p>Since Facebook removed the ability to remove yourself from search results altogether, the Electronic Frontier Foundation put together a quick how-to guide to help you take control over what is featured on your Facebook profile and on Graph Search results ? we have outlined it below. (Facebook also has a new <a href=\"https://www.youtube.com/watch?v=bSji6Y66aKo\">video</a> explaining how to control what shows up in Graph Search.)</p><h3>What's public on my profile?</h3><p>Click on the lock in the top menu bar, and under \"Who can see my stuff?\" click \"View As.\" This will take you to the public view of your profile. Here you can see exactly what information, photos, and posts are available to the public. If there's anything you don't want the whole Facebook universe to be able to see, you can change individual settings to hide particular items.</p><img src=\"tool_facebook1.png\"><h3>How do I hide my general information?</h3><p>Go to your profile page and click \"Update Info.\" You can control who is able to see what personal information you've listed?and if they're able to see it, they're able to search it.</p><img src=\"tool_facebook2.png\"><h3>Who can see my posts, both past and future?</h3><p>You can access your <a href=\"https://www.facebook.com/settings?tab=privacy\">privacy settings</a> by clicking on the lock in the top menu bar, then clicking \"See More Settings.\" From here, you can choose your audience for future posts (including photos), and you can also limit who has access to previous posts that were more widely accessible.</p><img src=\"tool_facebook3.png\"><h3>How do I hide my photo albums?</h3><p>Go to your profile page and click on \"Photos,\" then \"Albums.\" You can configure who has access to each album.</p><img src=\"tool_facebook4.png\"><p>Note that tagging others in a photo by default gives their friends the ability to see that photo. Also note that removing a photo from your Timeline does not remove it from being searched, especially if it is someone else's photo.</p><p>In order to make sure that photo is not searchable, you must detag yourself or report the photo. Facebook has another <a href=\"https://www.youtube.com/watch?v=CaJYQXiu3PY\">great video</a> about how to do just this.</p><p>To detag yourself, click on a photo, and on the bottom of the picture click on \"Options.\" Next, click \"Report/Remove Tag.\" This gives you the option to remove your tag, as well as to notify the poster that you'd like the photo to be taken down.</p><img src=\"tool_facebook6.png\"><img src=\"tool_facebook5.png\"><h3>How do I hide my \"Likes\"?</h3><p>Go to your profile page and click on \"Likes.\" Click \"Edit\" on the top right. From there, you can edit who can see your liked pages in each individual category.</p><img src=\"tool_facebook7.png\"><h3>Do I actually \"Like\" these things?</h3><p>While you are configuring your \"Likes,\" we encourage you to take a moment to reassess the pages you have listed. A few years later, you may not like \"Free Booze Fridays\" anymore. Unliking is as simple as going to a particular page, hovering your mouse over \"Liked,\" and clicking \"Unlike.\"</p><img src=\"tool_facebook8.png\"><h3>How do I hide my friends and relationships?</h3><p>Besides locking down your own personal information, it turns out that your friends and relationships can appear in searches associated with you. Because <a href=\"https://www.eff.org/deeplinks/2013/01/facebook-graph-search-privacy-control-you-still-dont-have\">they have no control</a> over how they appear in such searches, we strongly encourage you to do the altruistic thing and lock down your friendship settings. Here's how to set your privacy settings to keep your friendships and relationships?and therefore related search results?limited in visibility to only whom you want.</p><p>First, go to your profile and click on \"Friends.\" On the top right of the page, click on the \"Edit\" button. This allows you to select who can see your friend list.</p><img src=\"tool_facebook9.png\"><p>Next, you should adjust the settings of your relationships and family associations. Go to your profile and click \"Update Info,\" then scroll down to \"Family\" on the bottom left. When you click \"Edit,\" you can choose the specific privacy settings for each relationship.</p><img src=\"tool_facebook10.png\"><h3>Keep it up!</h3><p>The most important think you can do is to check your privacy settings often?especially after new features are released. Facebook has done a better job of making new privacy settings more accessible while also notifying users of any changes. Their explanations, however, can lose sight of bigger picture concerns.</p><h1>HOW TO HOW TO OPT-OUT OF FACEBOOK'S DATA BROKER RELATIONSHIPS</h1><h2>How to opt-out of Facebook's data broker relationships</h2><p><b>Lesson to read: <a href=\"umbrella://lesson/social-media\">Social Media</a></b><br><b>Other reading:</b> <a href=\"https://www.eff.org/deeplinks/2012/04/4-simple-changes-protect-your-privacy-online\">https://www.eff.org/deeplinks/2012/04/4-simple-changes-protect-your-privacy-online</a><br><b>Level:</b> Beginner<br><b>Time required:</b> 30 minutes</p><p>Facebook is teaming up with four of the world?s largest corporate data brokers to ?enhance? the ad experience for users. Datalogix, Epsilon, Acxiom, and BlueKai obtain information gathered about users through online means (such as through cookies when users surf the web) as well as through offline means (such as through loyalty cards at supermarkets and product warranty cards).  Facebook will use this information to tailor its ads. The Electronic Frontier Foundation describes what this means and how you can avoid it.</p><p>In practical terms, this means that limiting how much information you put on Facebook is not enough to limit how ads are targeted to you on Facebook. Your interests, age, shopping history (including offline), web browsing, location, and much more could be stored by these data brokers and utilized to market to you ? even if you?ve been careful not to share this type of information with Facebook.</p><p>So, what can users do? If you?re concerned about this practice, you can opt out of the targeted advertisements by individually visiting each of the data broker partners currently working with Facebook. We've got directions below for opting out of each site.</p><p>We also have two general tips:</p><p><b>1.  Install an add-on to protect your privacy online.</b> Facebook is using \"blind cookie-matching\" to match up users of online marketer BlueKai with specific Facebook accounts. Blocking trackers is a good general practice for stopping this type of tracking. We recommend you use a tool such as <a href=\"http://www.ghostery.com/\">Ghostery</a> (now available on Firefox, Safari, Chrome, Opera and Internet Explorer).</p><p><b>2. Avoid giving your phone number and email address to companies when possible.</b> Facebook and these companies are primarily using hashed email addresses to match users between databases, though they may also use hashed phone numbers. If you?re filling out a survey or signing up to receive email updates from a website, consider creating and using a different email address than the one you associate with your Facebook account. Similarly, consider setting up an alternate phone number you can give to companies apart from the phone number you connect with your social media accounts.</p><h3>Opt Out Instructions:</h3><p>Note that in general, opting out of data brokers will not necessarily result in your data being removed from their lists. Instead, these companies will generally 'suppress' your information from certain uses -- including, hopefully, in the batches of data sent to Facebook. The process below takes a bit of effort, but you really do need to opt out of all four data brokers separately to get out of this program.</p><p><b>Acxiom</b></p><p>1. To get started, visit Acxiom's <a href=\"https://isapps.acxiom.com/optout/optout.aspx\">Opt Out Form</a>. Then scroll down until you see your \"opt-out choices.\" Here there will be a list of the types of media you would like to opt out of (mail, telemarketing, email, and online advertising).  You can check all four, though note that their online advertising opt-out is cookie-based, meaning it will disappear every time you clear your cookies. </p><img src=\"tool_facebook11.png\"><p>2. Certify that you are just a single person.</p><img src=\"tool_facebook12.png\"><p>3. Fill out the form with your personal information. In order to be sure that Acxiom doesn't target advertisements at you through Facebook, you'll want to provide Acxiom with the phone number and email address associated with your Facebook profile. Use the green + signs on the form to add information.</p><img src=\"tool_facebook13.png\"><p>4. Click submit. After you hit submit (and get through a CAPTCHA), you'll be offered a chance to install Acxiom's opt out cookie. You can choose to do this or not, but remember that this is not a persistent method of protecting your privacy: the opt out cookie will disappear as soon as you clear your cookies. See instructions below for opting out of BlueKai for advice on dealing with web tracking.</p><img src=\"tool_facebook14.png\"><p>5.  You will then receive an email with a link in it from Acxiom. You can click on this link or else copy and paste it into a new browser window. Visiting this page will take you to another CAPTCHA. Fill this out.</p><p>Congratulations - you've opted out of Acxiom!</p><p><b>Datalogix</b></p><p>1. To opt out of this program, visit the Datalogix.com <a href=\"https://www.datalogix.com/privacy/\">privacy page</a>. Scroll down to the word ?Choice? and the last sentence in the first paragraph says:</p><p><i>?If you wish to opt out of all Datalogix-enabled advertising across channels including direct mail, online, mobile and analytic products, click here.?</i></p><p>2. Click there and a form will pop up that asks for your name, address, and email address. Fill this out and click submit.</p><img src=\"tool_facebook15.png\"><p>Datalogix promises that the opt-out will take effect within 30 days. Once you?ve been opted out, Datalogix will no longer include your information in the hashed data they provide to Facebook. </p><p><b>Epsilon</b></p><p>As Epsilon explains on their <a href=\"www.epsilon.com/consumer-preference-center\">Consumer Preference Center</a> page, there are several ways to opt out of the Epsilon marketing database: </p><p><b>EMAIL:</b> Email <a href=\"mailto:optout@epsilon.com\">optout@epsilon.com</a> and include the following information:<br>? full name (including middle initial)<br>? current address<br>? previous address if you have been at your current address fewer than six months</p><p><b>PHONE:</b> Phone 1.888.780.3869 and leave the above information.</p><p><b>MAIL:</b> Mail the above information to the below addresses:<br><b>U.S. Consumers:</b> Epsilon<br>?P.O. Box 1478<br>?Broomfield, CO 80036<br><b>Canadian Consumers:</b> Epsilon?<br>41 Metropolitan Rd.?<br>Toronto, Ontario<br>?M1R 2T5</p><p>We note that not all of these methods require you to provide an email address.  Epsilon may have methods to match your name with your email, but you can also provide your email address to be sure.</p><p>Note that opting out doesn't actually remove the data from Epsilon's database but rather just marks it as \"suppressed\" to they will stop sharing it for marketing purposes. This means that if the information is ever re-submitted, you won't be added back to the list.</p><p><b>BlueKai</b></p><p>Unlike the other data brokers Facebook is working with on this new project, BlueKai does not directly collect data from your offline activities. Instead, they use tracking cookies that collect data about your online browsing habits and then use that information to infer what types of products you might like to buy.</p><p><b>The best way to opt out of this is to use a browser add-on to block third-party tracking.</b><br>Rather than try to block only BlueKai, we recommend you block all third-party trackers. You can use a tool such as <a href=\"http://www.ghostery.com/\">Ghostery</a> (now available on Firefox, Safari, Chrome, Opera and Internet Explorer) as noted earlier.</p><p><b>CONGRATULATIONS</b> -- you've managed to get out of Facebook's new data broker-driven targeted marketing, and helped protect yourself from several important data brokers.  </p>\n",
		"category": "Tools"
	}
]