[
	{
		"title": "Kidnap Stages",
		"body": "<p>Your main goal if you have been kidnapped is to survive and regain freedom.</p><p>How you behave during a kidnapping can increase or reduce the likelihood of survival and regaining freedom. You therefore have some control over the outcome of a kidnapping.</p><p>There are five key phases of a kidnap/hostage situation:<ol><li>Surveillance</li><li>Capture</li><li>Transport (This could happen several times)</li><li>Confinement</li><li>Release/ Termination</li></ol></p><p>Prevention measures for stages one and two are dealt with in the Beginner lesson. This lesson will outline survival strategies for capture, transport, confinement and release.</p>",
		"category": "Travel",
		"subcategory": "Kidnapping",
		"difficulty": "Advanced"
	},
	{
		"title": "Capture",
		"body": "<p>The first 15 - 45 minutes are the most dangerous moments in the event; the abductors will be under stress, they are probably armed and most likely to use weapons if resistance is shown. Your objective is to survive, hence:<ul><li>Be calm and cooperative, speak only when spoken to, listen carefully and attentively, avoid sudden moves. Do not behave aggressively or try to be a hero: accept the situation.</li><li>If in a group, try not to be separated. Appoint one person to speak for the group, selected on the basis of ability rather than formal rank.</li><li>Do not attempt to escape and or to physically resist.</li><li>Do not make eye contact it may be mistaken for aggression.</li><li>Recognise that fear and shock are normal reactions.</li></ul></p>",
		"category": "Travel",
		"subcategory": "Kidnapping",
		"difficulty": "Advanced"
	},
	{
		"title": "Transport",
		"body": "<p><ul><li>You may be drugged, blindfolded, restrained and beaten. Do not resist, the main purpose is to make you more submissive.</li><li>If being transported, use the time to compose yourself. Keep your mind active.</li></ul></p>",
		"category": "Travel",
		"subcategory": "Kidnapping",
		"difficulty": "Advanced"
	},
	{
		"title": "Confinement",
		"body": "<p><ul><li>Anticipate periods of isolation and other methods of intimidation and prepare for a long wait. Do not believe everything you are told. Try to persuade your abductors to contact your colleagues or the authorities, find reasons why this would benefit them.</li><li>Try to build a relationship of respect whilst keeping your dignity, do not beg or plead; be cooperative and obey demands without being servile or aggressive; do not discuss politics, keep to mutual subjects such as family and children; encourage your abductors to view you as a person.</li><li>Try to retain personal belongings such as clothes, identification, watch and books unless forced to hand them over; ask for practical things such as toiletries, medicines, or time to exercise; avoid an exchange of clothes with abductors - it may hinder your identification in a rescue attempt.</li><li>Be aware of body language and non-verbal communication styles; do not threaten to testify against abductors; if concealing their identity, do not indicate that you recognise them.</li><li>Eat and drink water even if you have no appetite or it is unpalatable; maintain a routine of rest and activity; try to exercise daily and to keep track of time; maintain personal hygiene and maintain your values.</li><li>Try to remember positive and pleasant memories, meditation techniques or other ways to connect to your personality; mentally reconstruct books or movies; think positively; do not despair; do not allow yourself to be convinced that you have been abandoned ? your colleagues and family will be working on your release.</li><li>Keep a low profile, avoid appearing to study your abductors, although, to the extent possible, make mental notes about mannerisms, behaviour, speech, clothes, ranks, etc, in order to understand their profile, attitude and intentions; it may help in establishing possibilities for communication, the potential risks and may help the authorities after your release.</li><li>Agree to talk on the radio, phone or video: say only what you are asked to, do not try to send signals or messages; if asked to sign notes, or write a confession, do so if not doing so will endanger your, or others, well being. You may be asked for specific details of your personal life and/or family, be aware this may be part of ongoing negotiations regarding your release (known as proof of life). Never get directly involved in the negotiations for your release. This will only complicate matters.</li></ul></p>",
		"category": "Travel",
		"subcategory": "Kidnapping",
		"difficulty": "Advanced"
	},
	{
		"title": "Termination/Release",
		"body": "<p>This will come through release, rescue or escape (as a last resort only).<ul><li>If released; obey all instructions from your abductors.</li><li>If rescue is attempted by force lie on the floor, put hands over your head, do not try to identify yourself until appropriate to do so.</li><li>Escape should only be considered if you are sure it will succeed, or if it is imperative in order to save your life, otherwise it may create more danger. If in a group it may endanger the lives of others and may frustrate rescue activities. If you are caught you are likely to be held in harsher conditions than before.</li></ul></p>",
		"category": "Travel",
		"subcategory": "Kidnapping",
		"difficulty": "Advanced"
	},
	{
		"title": "Aftermath",
		"body": "<p><ul><li>Regardless of the method of freedom, expect to be immediately and thoroughly debriefed. Cooperate with the authorities, giving as much detail as possible.</li><li>You will not immediately get all the quietness and privacy you may want. Being kidnapped is a huge psychological ordeal: expect to feel its impact for months and perhaps even years to come, but feel confident that, with the right help, you can recover and get on with your life. See the Dealing with Stress lesson for more help on this.</li></ul></p>",
		"category": "Travel",
		"subcategory": "Kidnapping",
		"difficulty": "Advanced"
	},
	{
		"title": "What now?",
		"body": "<p>Swipe right for this lesson's checklist</p><p>Go to the Beginner lesson for advice on how to avoid kidnapping.<a href=\"umbrella://lesson/kidnapping/1\" class=\"button green\">Go to Beginner Lesson</a></p><p>Go to the Expert lesson for advice on what to do if a staff member is kidnapped.<a href=\"umbrella://lesson/kidnapping/3\" class=\"button purple\">Go to Expert Lesson</a></p><h3>RELATED LESSONS/TOOLS</h3><p><ul><li><a href=\"umbrella://lesson/preparation\">Travel Prep lesson</a></li></ul></p><h3>FURTHER READING</h3><p><ul><li><a href=\"https://www.eisf.eu/wp-content/uploads/2014/09/0541-MO-2010-Advice-Note-Abduction-Kidnapping.doc\">EISF Abduction Advice Note</a></li><li><a href=\"ngolearning.org/courses/availablecourses/CARE%20Safety%20Course/Shared%20Documents/English_CARE_International_Safety_and_Security_Handbook.pdf\">CARE International: Safety & Security Handbook</a></li><li><a href=\"www.odihpn.org/download/gpr_8_revised2pdf\">Good Practice Review Number 8: Operational security management in violent environments (Revised Ed.)</a></li><li><a href=\"https://www.google.co.uk/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&uact=8&ved=0CCEQFjAA&url=http%3A%2F%2Fec.europa.eu%2Fecho%2Ffiles%2Fevaluation%2Fwatsan2005%2Fannex_files%2FECHO%2FECHO12%20-%20echo_generic_security_guide_en.doc&ei=kLxAVc6LOILuUP2SgbAE&usg=AFQjCNEXEOcbLeV24f3WolHmDwLq7KJzlQ&sig2=hbnI7wfdrGIHS7mmikBRWA\">ECHO Generic Security Guide for Humanitarian Organisations</a></li><li><a href=\"protectioninternational.org/publication/new-protection-manual-for-human-rights-defenders-3rd-edition/\">Protection International: New Protection Manual for Human Rights Defenders (3rd Ed.)</a></li></ul></p>\n",
		"category": "Travel",
		"subcategory": "Kidnapping",
		"difficulty": "Advanced"
	}
]