[
	{
		"title": "Assessment",
		"body": "<p>Many checkpoints have a legitimate purpose, for example to prevent weapons from entering an area. Some checkpoints, however, are designed to harass people or as a cover for ambush, theft or violence. It is important to recognise the difference between a legal, sanctioned checkpoint and one designed for the gain of the checkpoint personnel.</p><p>You first need to rapidly assess the nature of the checkpoint.<ul><li>Where it is located?</li><li>Who is manning it?</li><li>What does their mood appear to be?</li><li>Are there any signs of trouble?</li></ul></p><p> Checkpoints at crossroads, bridges, mountain passes and town entrances and exits are to be expected, and are likely to have been set up for the general monitoring of all passers-by. Checkpoints in the middle of a forest or on a mountain road away from habitation may exist for a more ominous purpose. Checkpoints manned by regular army and police forces may be less problematic than ones manned by irregulars.</p><p>If you suspect that there is a risk of violence or other serious problems, turn round and drive steadily away, if it is safe to do so.</p><p>Before approaching or leaving a checkpoint, inform base by radio. Do so in a discreet way, far enough from the checkpoint to avoid them seeing that you are using the radio</p>",
		"category": "Travel",
		"subcategory": "Checkpoints",
		"difficulty": "Beginner"
	},
	{
		"title": "On Approach",
		"body": "<p><ul><li>Slow down</li><li>Turn radios down low or off</li><li>Keep valuables out of sight</li><li>Roll window down low enough for civil conversation, but difficult to put hand inside car</li><li>During day, remove sunglasses</li><li>After dark, turn light inside the cabin on and headlights off</li><li>Be ready with your ID documents</li><li>Have one person who is prepared to talk on behalf the group: Agree where you have come from/ Where you are going/ Who you work for</li><li>Keep a reasonable distance between vehicles</li><li>Be sure you understand the signals given by checkpoint personnel (e.g. are they waving me on or into the side of the road?). Stop if unsure.</li></ul></p>",
		"category": "Travel",
		"subcategory": "Checkpoints",
		"difficulty": "Beginner"
	},
	{
		"title": "At Checkpoint",
		"body": "<p>You should know the accepted etiquette for passing through a checkpoint in your area. It is always important to stay calm and clearly demonstrate that you are not a threat.</p><p><ul><li>Stop a few meters from the barrier</li><li>Keep engine running unless told otherwise</li><li>Remain in the vehicle unless asked to get out</li><li>If asked to get out release seatbelt slowly so it does not look like you are reaching for a gun</li><li>Avoid any sudden movements in the car ? if moving announce what you are doing before you do it, and move slowly</li><li>Do not laugh or giggle</li><li>Keep hands visible</li><li>If vehicle is searched, comply</li><li>Be friendly, co-operative and alert. Treat the soldiers or police with respect.  They have a boring job to do, and are likely to give you an easier time if you show an interest in them. If appropriate, chat a little, perhaps about their family.</li><li>If they ask you to do things that are inappropriate, be polite but firm in refusing, and use gentle humour if appropriate.</li><li>NB. A soldier asking for money is a negotiation. A solider pointing his gun at you and demanding money is armed robbery. If threatened with a weapon, comply calmly with their instructions.</li><li>If anything stolen, politely ask for it back (use your judgement; if the situation is threatening it may be best to accept the loss). If there is the possibility of violence at a checkpoint report the incident to a more senior officer once your journey is complete.</li><li>If at all possible, refuse lifts to armed or uniformed personnel. Be prepared to be turned back if your organizational policy forbids it.</li><li>Avoid looking back</li><li>Once the checkpoint has been cleared and you are out of view report back in to base that you are continuing on your route.</li></ul></p>",
		"category": "Travel",
		"subcategory": "Checkpoints",
		"difficulty": "Beginner"
	},
	{
		"title": "What now?",
		"body": "<p>Swipe right for this lesson's checklist</p><h3>RELATED LESSONS/TOOLS</h3><p><ul><li><a href=\"umbrella://lesson/preparation\">Preparation lesson</a></li><li><a href=\"umbrella://lesson/arrests\">Arrest lesson</a></li></ul></p><h3>FURTHER READING</h3><p><ul><li><a href=\"www.odihpn.org/download/gpr_8_revised2pdf\">Good Practice Review Number 8: Operational security management in violent environments (Revised Ed.)</a></li><li><a href=\"ngolearning.org/courses/availablecourses/CARE%20Safety%20Course/Shared%20Documents/English_CARE_International_Safety_and_Security_Handbook.pdf\">CARE International: Safety & Security Handbook</a></li></ul></p>",
		"category": "Travel",
		"subcategory": "Checkpoints",
		"difficulty": "Beginner"
	}
]