[
	{
		"title": "Driving Guidelines",
		"body": "<p>Vehicle-related accidents are the major cause of injuries and fatalities among aid personnel. Driving in unfamiliar and sometimes difficult conditions can increase the likelihood of an accident. Other dangers include ambush, robbery and aggressive behaviour of armed personnel at checkpoints. If available and practical, all staff members should receive driver safety training.</p><p>The most important piece of security advice an aid worker or human rights defender can be given is ALWAYS WEAR A SEATBELT.</p><p>Driving Guidelines<ul><li>Park in well-lit, heavily populated areas. Close all windows and lock doors before leaving the vehicle. Have keys ready in hand when returning to vehicle. Check the back seat before entering.</li><li>Immediately lock doors upon entry. Open windows no more than 5 cm and only those windows near occupied seats.</li><li>Do not speed or drive too fast for conditions. Observe local driving laws and regulations.</li><li>Avoid night driving or driving alone where possible.</li><li>Avoid letting the fuel tank fall below half full.</li><li>Keep a spare vehicle key in the office.</li><li>Never voluntarily carry unauthorized passengers, especially soldiers. However, if threatened, provide the transportation. In the event of an attempted carjacking, you should not risk your life to save a vehicle.</li></ul></p>",
		"category": "Travel",
		"subcategory": "Vehicles",
		"difficulty": "Beginner"
	},
	{
		"title": "Journey Guidelines",
		"body": "<p><ul><li>In insecure locations, all staff should be met on first arrival, and on subsequent arrivals if necessary.  Those meeting staff should carry identification.</li><li>Vary the time and route of any regular journeys you make.  If criminals can predict where you will be and when, it is easier for them to target you.</li><li>In remote areas or where threats may be present along the route, select primary and alternate routes.</li><li>Avoid areas with criminal activity or known threats. If possible avoid ?choke points? such as narrow alleys.</li><li> When possible, consult with other agencies and organizations to monitor route conditions and change routes as necessary.</li><li>Notify others of travel times, destination, and steps they should take if you are late.</li><li>Mark official vehicles appropriately for the area.</li><li>Consider posting a decal on your door or window indicating guns are not permitted in the vehicle.</li><li>Avoid transporting sensitive documents or equipment in areas prone to banditry. Arrange proper permits for transporting items that could be interpreted as useful to combatants or terrorists.</li><li>Know how to perform basic vehicle maintenance (changing a flat tire, checking and adding fluids, etc.)</li></ul></p>",
		"category": "Travel",
		"subcategory": "Vehicles",
		"difficulty": "Beginner"
	},
	{
		"title": "Considerations",
		"body": "<p>Important issues to take into consideration when planning a journey include:<ul><li>Recent incidents on the route. *Check the Dashboard for information about your area*</li><li>Weather</li><li>Length of journey ? time of departure/ arrival?</li><li>Should you travel in convoy with another vehicle?</li><li>Communications schedule</li><li>Checkpoints en route ? what is the process for passing through? (See Checkpoints lesson for advice on this)</li><li>Other dangerous points en route (does the route pass through an area controlled by military, a warlord or local leader). Has negotiation been carried out and permissions obtained and understood prior to leaving? Crossings of conflict lines and through insecure areas should be rigorously checked before travelling.</li><li>Safe ?waypoints? en route</li><li>Refuelling stops</li><li>Sustenance/ food stops</li><li>What is your plan in the event of a car accident or breakdown?</li></ul></p>",
		"category": "Travel",
		"subcategory": "Vehicles",
		"difficulty": "Beginner"
	},
	{
		"title": "Journey Preparation",
		"body": "<p>Drivers should:<ul><li>Be given a clear briefing about safe driving procedures before departure</li><li>Consider the length of journey ? do you need more than one driver?</li><li>Factor in prayer or sustenance stops if necessary</li><li>Consider the driver?s ethnicity if going into dangerous areas</li></ul></p><p>Considerations in choosing type of vehicle should include:<ul><li>Urban or rural trip? State of the roads? 4x4 necessary?</li><li>Desirability of vehicle for car-jacking</li><li>High profile or low profile</li></ul></p><p>Road worthiness checks carried out before using a vehicle should include:<ul><li>Tyres</li><li>Seatbelts</li><li>Fuel</li><li>Brakes</li><li>Oil level</li><li>Steering</li><li>Loading</li></ul></p>",
		"category": "Travel",
		"subcategory": "Vehicles",
		"difficulty": "Beginner"
	},
	{
		"title": "What to Have",
		"body": "<p>The following items (location dependant) should be kept in the vehicle at all times.</p><p>Equipment:<ul><li>Communication equipment and key telephone numbers</li><li>Additional fuel & oil</li><li>Water</li><li>Maps</li><li>GPS</li><li>Spare parts for car</li><li>Spare wheel (x2) and jack</li><li>Basic tools</li><li>Fluorescent warning triangle</li><li>Tow rope</li><li>First aid kit</li><li>Torch</li></ul></p><p>Documents:<ul><li>Permission to travel, if required</li><li>Visas</li><li>Car documents</li><li>Driver?s licence & insurance</li><li> Personal ID</li><li>Organisational ID if possible</li><li>Medical vaccination certificates</li></ul></p><p>General items:<ul><li>Food</li><li>Water</li><li>Cold/ hot weather clothing</li><li>Blankets/ shade structure</li></ul></p>",
		"category": "Travel",
		"subcategory": "Vehicles",
		"difficulty": "Beginner"
	},
	{
		"title": "Accidents",
		"body": "<p>Traffic accidents can be minimized by implementing defensive driver training and other precautions, but they can never be avoided entirely. When an accident is mishandled, it can quickly change from an unfortunate occurrence into a security risk. In extreme situations, it can trigger violence or threats of retribution.</p><p>The following procedures are useful when involved in an accident.<ul><li>Quickly discern the attitudes and actions of people around the accident site to ensure that you are not at risk by staying.</li><li>Do not leave the site unless your safety is jeopardized and then only to drive to the nearest police or military post.</li><li>Make site safe and visible to other traffic.</li><li>Provide care and assistance as appropriate.</li><li>As appropriate, contact local authorities immediately and cooperate as required.</li><li>Contact the your office as soon as practical.</li><li>If feasible, take pictures of the scene and record the names and contact information of witnesses, responding authorities, and those involved.</li><li>When approaching an accident involving other vehicles consider safety and security, taking care not to become involved in a second accident while responding.</li></ul></p><p>Vehicle accidents are the main cause of injury and fatality among NGO staff. Avoiding excessive speed, following applicable traffic laws, and wearing seat belts minimize the chances of injury.</p><p>Offices should implement a transportation policy that ensures vehicles are maintained in a state of operational readiness; journeys are planned; and vehicle users are prepared to respond to a range of possible incidents. An accident report format should be placed in the logbook of each vehicle.</p>",
		"category": "Travel",
		"subcategory": "Vehicles",
		"difficulty": "Beginner"
	},
	{
		"title": "What now?",
		"body": "<p>Swipe right for this lesson's checklist</p><h3>RELATED LESSONS/TOOLS</h3><p><ul><li><a href=\"umbrella://lesson/checkpoints\">Checkpoints lesson</a></li><li><a href=\"umbrella://lesson/preparation\">Preparation lesson</a></li></ul></p><h3>FURTHER READING</h3><p><ul><li><a href=\"ngolearning.org/courses/availablecourses/CARE%20Safety%20Course/Shared%20Documents/English_CARE_International_Safety_and_Security_Handbook.pdf\">CARE International: Safety & Security Handbook</a></li><li><a href=\"https://www.google.co.uk/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&uact=8&ved=0CCEQFjAA&url=http%3A%2F%2Fec.europa.eu%2Fecho%2Ffiles%2Fevaluation%2Fwatsan2005%2Fannex_files%2FECHO%2FECHO12%20-%20echo_generic_security_guide_en.doc&ei=kLxAVc6LOILuUP2SgbAE&usg=AFQjCNEXEOcbLeV24f3WolHmDwLq7KJzlQ&sig2=hbnI7wfdrGIHS7mmikBRWA\">ECHO Generic Security Guide for Humanitarian Organisations</a></li></ul></p>",
		"category": "Travel",
		"subcategory": "Vehicles",
		"difficulty": "Beginner"
	}
]