[
	{
		"title": "Strategic Questions",
		"body": "<p><ul><li>Ask some strategic questions before your trip<ul><li>What is the objective of the trip? (ensure clear Terms of Reference)</li><li> What profile are you/your org org taking? High profile/ low profile? Why?</li><li>What is the threshold of acceptable risk your organisation is willing to take?</li><li>What about the risk to partners who you are meeting with?</li><li>What damage could this trip cause potential adversaries? How interested will potential adversaries be in this trip?</li></ul></li>Gather information about destination and partner organisations before deciding whether trip is currently safe and should be undertaken (context assessment)</li><li>Complete a risk assessment</li><li>Discuss trip with regional security focal point to confirm whether trip falls within threshold of acceptable risk</li><li>Where possible, organise post-arrival context/ security briefings from partners</li></ul></p>",
		"category": "Travel",
		"subcategory": "Preparation",
		"difficulty": "Beginner"
	},
	{
		"title": "Communications",
		"body": "<p><ul><li>Traveller to ensure they understand how to operate communications equipment.</li><li>Buy ?burner? sim-card before travel (WorldSim or Libara for example) and disposable phone. Make sure the SIM has funds on it. Often this is better than buying a local sim-card because that often requires registering the sim-card with your passport</li><li>Check phone will function in the country travelled to</li><li>Bring a satellite phone if necessary (e.g. if phone lines are poor or possibility of censorship during high tensions) ? check they are legal in the country you are going to</li><li>Programme essential numbers into your phone, but not sensitive numbers. Put sensitive numbers into the ?notes? section of your phone but need to disguise them effectively.</li><li>Additionally, ensure you have key numbers ? such as embassies - stored remotely or written elsewhere (coded where necessary).</li><li>Note 112/911/999 Emergency number</li></ul></p>",
		"category": "Travel",
		"subcategory": "Preparation",
		"difficulty": "Beginner"
	},
	{
		"title": "Key Documents",
		"body": "<p><ul><li>Ensure passport is valid for at least 6 months with appropriate visas and travel documents. When appropriate, photocopy passport and other documents and carry only the copy, keeping a second copy at home or office. Send a copy of your passport to your email address. Securely email other key information to yourself to ensure it is available if needed.</li><li>Familiarise yourself with your organisation?s relevant security procedures.</li><li>Check insurance is valid.</li><li>Consider getting an identity card from your organisation. This could be a laminated, two-sided photo identification card with English or another UN standard language on one side and the local official language on the reverse.</li><li>Ensure key information is shared with the right people before leaving ? Human Resources? Your family? Your manager? The person responsible for managing the trip?</li></ul></p>",
		"category": "Travel",
		"subcategory": "Preparation",
		"difficulty": "Beginner"
	},
	{
		"title": "Standard Operating Procedures",
		"body": "<p><ul><li>Discuss Standard Operating Procedures prior to departure</li>Pre-agree an itinerary and communication schedule agreed with relevant colleague.</li><li>You should carry your ?constant companion? on your person at all times. A constant companion includes some cash, your key documentation needed for evacuation, and a list of emergency names, addresses, phone numbers, and the names of reputable hotels along the route.</li><li>Only minimal data should be brought with you ? it should be backed up and, if appropriate, encrypted.</li><li>If carrying sensitive information decide how to discreetly carry it in to the country. What?s your story? Prepare to answer questions at airports and elsewhere. (For advice on both of these, see the Borders lesson)</li><li>If any sensitive meetings are to be held, or meetings with vulnerable human rights defenders, follow the advice laid out in the Meeting lesson.</li><li>Have an alternative plan to exit the country. Do you have a ?stand-by? visa for a neighbouring country?</li><li>If driving or being driven in a vehicle, follow the advice laid out in the Vehicles lesson.</li><li>You should understand tools, systems and techniques for good personal security management, counter-surveillance, safe use of email etc. (training might be necessary) This may include making yourself familiar with the advice in the Arrest and Kidnapping lessons.</li><li>Inform authorities and embassies of the trip,</li><li>Will a curfew be respected? Will solo movement be allowed?</li></ul></p>",
		"category": "Travel",
		"subcategory": "Preparation",
		"difficulty": "Beginner"
	},
	{
		"title": "Medical",
		"body": "<p><ul><li>You should carry a medical emergency card. Pre-check the best hospital in the area you will be visiting and also have a medical plan B.</li><li> Make sure you obtain correct health advice, vaccinations and malaria prophylaxis.</li><li>Check that any essential medicines required are carried.</li><li>Inform your organisation and your travel companions if you have heath complaints that could become serious (e.g. Asthma, diabetes etc.) and how they should respond in an emergency.</li></ul></p>",
		"category": "Travel",
		"subcategory": "Preparation",
		"difficulty": "Beginner"
	},
	{
		"title": "Equipment",
		"body": "<p><ul><li>Ensure adequate cash or other payment tools for the trip.</li><li>Take key items of equipment<ul><li>Travel lock</li><li>Computer lock</li><li>Door wedge</li><li>Tamper-proof scotch tape</li><li>Mobile Wi-Fi device</li><li>Solar charger</li><li>Cheap notebook from which you can rip out pages unnoticed</li><li>Mosquito net/ repellent etc.</li></ul></li><li>Ensure any digital equipment you take with you ? phone, computer ? is wiped ?clean?. For more advice on how to do this see the Protecting Files lesson.</li></ul></p>",
		"category": "Travel",
		"subcategory": "Preparation",
		"difficulty": "Beginner"
	},
	{
		"title": "Need to Know",
		"body": "<p><ul><li>Discuss who needs to have advance knowledge of your trip ? minimising the number of people who know about your presence is a good way to increase your security. This needs to be balanced with operational practicalities and the ability to complete the assignment.</li><li>Limit who has information (need to know) on<ul><li>Trip plans</li><li>Movements, patterns, lifestyle</li><li>Travel modes, itineraries, professional arrangements</li><li>Security arrangements & procedures</li><li>Your organisation?s duties, associates and colleague</li></ul></li><li>For more advice, see the Managing Information lesson.</li></ul></p>",
		"category": "Travel",
		"subcategory": "Preparation",
		"difficulty": "Beginner"
	},
	{
		"title": "What now?",
		"body": "<p>Swipe right for this lesson's checklist</p><h3>RELATED LESSONS/TOOLS</h3><p><ul><li><a href=\"umbrella://lesson/borders\">Borders lesson</a></li><li><a href=\"umbrella://lesson/meetings\">Meeting lesson</a></li><li><a href=\"umbrella://lesson/vehicles\">Vehicles lesson</a></li><li><a href=\"umbrella://lesson/arrests\">Arrest lesson</a></li><li><a href=\"umbrella://lesson/kidnapping\">Kidnapping lesson</a></li><li><a href=\"umbrella://lesson/protecting-files\">Protecting Files lesson</a></li><li><a href=\"umbrella://lesson/managing-information\">Managing Information lesson</a></li></ul></p><h3>FURTHER READING</h3><p><ul><li><a href=\"https://www.google.co.uk/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&uact=8&ved=0CCEQFjAA&url=http%3A%2F%2Fec.europa.eu%2Fecho%2Ffiles%2Fevaluation%2Fwatsan2005%2Fannex_files%2FECHO%2FECHO12%20-%20echo_generic_security_guide_en.doc&ei=kLxAVc6LOILuUP2SgbAE&usg=AFQjCNEXEOcbLeV24f3WolHmDwLq7KJzlQ&sig2=hbnI7wfdrGIHS7mmikBRWA\">ECHO Generic Security Guide for Humanitarian Organisations</a></li><li><a href=\"ngolearning.org/courses/availablecourses/CARE%20Safety%20Course/Shared%20Documents/English_CARE_International_Safety_and_Security_Handbook.pdf\">CARE International: Safety & Security Handbook</a></li><li><a href=\"https://cpj.org/reports/2012/04/journalist-security-guide.php\">2012 CPJ - Journalist Security Guide</a></li></ul></p>",
		"category": "Travel",
		"subcategory": "Preparation",
		"difficulty": "Beginner"
	}
]