[
	{
		"title": "Kidnaping",
		"body": "<p>Dealing with the kidnapping of a member of staff is a very sensitive and complex task. This lesson provides only the basic outline for recommended actions.</p><p><b>If one of your staff is kidnapped we highly recommend reading the detailed advice given in the ?Further Reading? links at the end of this lesson.</b></p>",
		"category": "Travel",
		"subcategory": "Kidnapping",
		"difficulty": "Expert"
	},
	{
		"title": "First Steps",
		"body": "<p>If kidnap occurs, the organisation should immediately set up a crisis management team, in HQ if possible. It should be made clear at once which manager has responsibility for managing the incident.  That manager should then consider the following actions, depending on the circumstances and his or her assessment of the best course of action:<ul><li>Inform the local police and other appropriate authorities</li><li>Inform all relevant parties of the name and contact details of the incident manager.  Request that no action be taken in relation to the incident without prior agreement with him or her.</li><li>The incident manager should delegate responsibilities to colleagues as appropriate: e.g.:<ul><li>Contacting Next of Kin.  This should be a top priority.  Failure to do this quickly can damage the relationship of trust with the staff member?s family, particularly if they first hear the news through the media.  This could then make the management of the crisis much more difficult.</li><li>Answering enquiries from the press</li><li>Keeping contact with all relevant staff and other agencies</li><li>Providing 24-hour communications and logging all messages and events</li><li>Marking maps</li><li>Ensuring that the crisis management team has sufficient food, water and rest</li></ul></li></ul></p>",
		"category": "Travel",
		"subcategory": "Kidnapping",
		"difficulty": "Expert"
	},
	{
		"title": "Make a Plan",
		"body": "<p><ul><li>Make a plan. Will you negotiate directly with the kidnappers, if that is possible?  Or will you appoint an intermediary?  (A trusted intermediary is often thought preferable, to give time for decision-makers to consider their responses to any messages from the kidnappers.)</li><li>Decide whether to call in specialist advice, either from the police or from a reputable company specialising in hostage negotiations.  It may help if contact has been made with such a company before any kidnap occurs.  If you are not sure that you have the necessary expertise to handle a kidnapping, specialist advice from a reputable company is strongly recommended.</li><li>Allocate the necessary resources ? human, financial and other ? to ensure that your plan has the best possible chance of success</li></ul></p>",
		"category": "Travel",
		"subcategory": "Kidnapping",
		"difficulty": "Expert"
	},
	{
		"title": "Carry out Plan",
		"body": "<p><ul><li>Carry out your plan.</li><li>While you will naturally desire to conclude the incident safely and as quickly as possible, kidnap negotiations can sometimes last months or even years.  Prepare the crisis management team for this, while encouraging them to remain optimistic.  Keep morale high: enough food and rest are helpful, but possibly the greatest aid to morale is to manage the incident well, keeping everyone fully informed, and taking the best available advice.</li><li>Ensure strict confidentiality from the onset of the crisis.  Information should be shared only on a need to know basis.  This may require the usual management chain to be bypassed, e.g. if someone is part of the crisis management team, he or she should be exempted from reporting to his or her superior on the crisis.</li><li>Ransom should not be paid.  All humanitarian organisations should have a clearly stated policy that ransom will not be paid in case of kidnap, since to do so encourages more kidnapping.</li><li>Throughout the crisis, significant events and decisions should be recorded, and lessons learned wherever possible.</li></ul></p>",
		"category": "Travel",
		"subcategory": "Kidnapping",
		"difficulty": "Expert"
	},
	{
		"title": "Aftermath",
		"body": "<p><ul><li>Attend to the needs of the victim, including making arrangements for them to speak to their loved ones and for their physical reunion.</li><li>Arrange for the authorities to meet and interview the victim.</li><li>Manage the press; organise a short press conference with the victim and/ or their family, and retain control over press contacts.</li><li>Arrange for a debriefing with the organisation.</li><li>Arrange time off, with full insurance coverage and no loss of income.</li><li>Arrange for professional and appropriate counseling and long-term support mechanisms.</li><li>Specific preparations need to be made in case of a negative outcome.</li><li>Once a kidnap incident is resolved, conduct an after-action review, to see what lessons can be learned.</li></ul></p>",
		"category": "Travel",
		"subcategory": "Kidnapping",
		"difficulty": "Expert"
	},
	{
		"title": "What now?",
		"body": "<p>Swipe right for this lesson's checklist</p><p>Go to the Beginner lesson for advice on how to avoid kidnapping.</p><p>Go to the Beginner lesson for advice on how to avoid kidnapping.<a href=\"umbrella://lesson/kidnapping/1\" class=\"button green\">Go to Beginner Lesson</a><p>Go to the Advanced lesson for advice on survival techniques if you are kidnapped.<p>Go to the Beginner lesson for advice on how to avoid kidnapping.<a href=\"umbrella://lesson/kidnapping/2\" class=\"button yellow\">Go to Advanced Lesson</a></p><h3>RELATED LESSONS/TOOLS</h3><p><ul><li><a href=\"umbrella://lesson/preparation\">Travel Prep lesson</a></li></ul></p><h3>FURTHER READING</h3><p><ul><li><a href=\"www.odihpn.org/download/gpr_8_revised2pdf\">Good Practice Review Number 8: Operational security management in violent environments (Revised Ed.)</a></li><li><a href=\"ngolearning.org/courses/availablecourses/CARE%20Safety%20Course/Shared%20Documents/English_CARE_International_Safety_and_Security_Handbook.pdf\">CARE International: Safety & Security Handbook</a></li><li><a href=\"https://www.eisf.eu/wp-content/uploads/2014/09/0541-MO-2010-Advice-Note-Abduction-Kidnapping.doc\">EISF Abduction Advice Note</a></li><li><a href=\"protectioninternational.org/publication/new-protection-manual-for-human-rights-defenders-3rd-edition/\">Protection International: New Protection Manual for Human Rights Defenders (3rd Ed.)</a></li><li><a href=\"https://www.google.co.uk/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&uact=8&ved=0CCEQFjAA&url=http%3A%2F%2Fec.europa.eu%2Fecho%2Ffiles%2Fevaluation%2Fwatsan2005%2Fannex_files%2FECHO%2FECHO12%20-%20echo_generic_security_guide_en.doc&ei=kLxAVc6LOILuUP2SgbAE&usg=AFQjCNEXEOcbLeV24f3WolHmDwLq7KJzlQ&sig2=hbnI7wfdrGIHS7mmikBRWA\">ECHO Generic Security Guide for Humanitarian Organisations</a></li></ul></p>",
		"category": "Travel",
		"subcategory": "Kidnapping",
		"difficulty": "Expert"
	}
]