[
	{
		"title": "Why do People Kidnap?",
		"body": "<p>The best defence against kidnapping is having and practising a high-quality, well-managed security management plan, which is based on a thorough understanding of the general context and risks, and on the context and threat of kidnapping specific to your location. Understanding who carries out kidnappings, and why, will help shape your avoidance and survival strategies.</p><p>The main reasons for kidnappings are:<ul><li>To hold for ransom</li><li>To cause a political effect</li><li>To achieve publicity</li><li>To be used as human shields</li></ul></p><p>The main actors that carry out kidnappings are:<ul><li>Criminals</li><li>Political extremists</li><li>Terrorists</li><li>Militia groups</li><li>Regimes that use terror</li></ul></p><p>Factors which may encourage kidnapping:<ul><li>The state?s ability to provide protection from the crime, and prosecute those who engage in such activity</li><li>A lack of political, legal or military response will encourage more actors to become involved</li><li>Media coverage of successful kidnap attempts</li><li>High financial rewards from kidnapping</li></ul></p>",
		"category": "Travel",
		"subcategory": "Kidnapping",
		"difficulty": "Beginner"
	},
	{
		"title": "The Phases of a Kidnapping",
		"body": "<p><ol><li>Surveillance</li><li>Capture</li><li>Transport (This could happen several times)</li><li>Confinement</li><li>Release/ Termination</li></ol></p><p>This Beginner lesson concentrates on the first 2 phases: how to AVOID kidnap by reducing the incentives and opportunities for kidnap and making it more complex for prospective kidnappers.</p><p>For advice on survival techniques in the event of being kidnapped go to the Advanced lesson, and for advice on what to do if a colleague has been kidnapped go to the Expert lesson.</p>",
		"category": "Travel",
		"subcategory": "Kidnapping",
		"difficulty": "Beginner"
	},
	{
		"title": "Reduce promoting factors",
		"body": "<p><ul><li><b>Stay low profile</b><br>Don?t use big expensive cars; avoid ?no-go? areas in town; don?t display assets etc.</li><li><b>Build key relationships</b><br>Build relationships with key actors who may be of use in the prevention of kidnapping. In environments where a host is responsible for the wellbeing of their guests, it might be a good idea to obtain local protection. Likewise, asking respected elders to join a site visit may offer a form of protection. Only good knowledge of the context will determine whether this tactic will reduce the risk.</li><li><b>Be aware of how work is received</b><br>If the political or conflict situation is putting your work at a heightened risk be prepared to suspend the programme if necessary and leave the country for a period of time if appropriate. (See Evacuation lesson for more advice on this)</li><li><b>Have a public policy of no ransom</b></li></ul></p>",
		"category": "Travel",
		"subcategory": "Kidnapping",
		"difficulty": "Beginner"
	},
	{
		"title": "Reduce Opportunity",
		"body": "<p><ul><li><b>Be cautious</b><br>Don?t make yourself an easy target. This will mean different things depending on the local context but may include avoiding walking to the shops on foot or driving alone at night. See the Vehicle lesson for detailed security advice for vehicles. At times of heightened risk you should restrict movements to minimum necessary.</li><li><b>Avoid predictability</b><br>50% of abductions take place while the victim is in their car. The majority take place in the early morning, within 400 meters of home or office, due to a predictable pattern of behaviour. Roadblocks or car accidents may be staged to create a scene where abductors then have a pretext to operate quickly, disguised as officials. Avoid predictability when moving between residences and offices, as well as in off-hours activities, such as taking children to school and going shopping. It may be difficult but try to vary travel times and routes.</li><li><b>Reduce visibility</b><br>This might mean staff travelling in a trusted taxi rather than an easily identifiable agency vehicle. If there is a suspicion that radio communications may be overheard, staff should not be identified when travelling. Information about movement plans, routes and travel times should be encoded.</li><li><b>Ensure good site security for homes and offices</b><br>Site protection and strict rules governing the identification of strangers and limits on access complicates the situation for potential kidnappers.</li></ul></p>",
		"category": "Travel",
		"subcategory": "Kidnapping",
		"difficulty": "Beginner"
	},
	{
		"title": "Practice counter-surveillance",
		"body": "<p>In simple terms this means ?watch to see if someone is watching you?. A successful kidnapping normally needs planning, and the perpetrators will be watching the residence, office and movements of their identified target for some time before making their move. They may try to find out more about the residence by presenting themselves as servicemen, or checking the locks of doors and windows while staff are away. They may follow a target in a car to establish routines and identify the ideal point at which to strike. Practicing counter-surveillance may also make you aware of an imminent attack.</p><p><ul><li>Be observant and watch for anything unusual</li><li>Note if someone starts asking numerous unexpected questions or takes an unexpected interest in you are or the work that you do.</li><li>Situational awareness is vital</li><li>Know the ?choke points? on your route</li><li>Multiple sightings of the same person, vehicle, or activity may confirm you?re being watched.</li><li>If you are suspicious that you are being followed you can speed up, slow down, make three right turns, stall at a green light and continue just as the lights change back to red, take a one way street, or make a dead stop. Check if any cars following are doing the same thing.</li></ul></p>Practicing counter-surveillance effectively requires constant attention and knowledge about the local environment, including who belongs in the locality and who does not. See the Counter-surveillance lesson for more detailed advice.</p>",
		"category": "Travel",
		"subcategory": "Kidnapping",
		"difficulty": "Beginner"
	},
	{
		"title": "What now?",
		"body": "<p>Swipe right for this lesson's checklist</p><p>Go to the Advanced lesson for advice on survival techniques if you are kidnapped.<a href=\"umbrella://lesson/kidnapping/2\" class=\"button yellow\">Go to Advanced Lesson</a></p><p>Go to the Expert lesson for advice on what to do if a staff member is kidnapped.<a href=\"umbrella://lesson/kidnapping/3\" class=\"button purple\">Go to Expert Lesson</a></p><h3>RELATED LESSONS/TOOLS</h3><p><ul><li><a href=\"umbrella://lesson/evacuation\">Evacuation lesson</a></li><li><a href=\"umbrella://lesson/vehicle\">Vehicle lesson</a></li><li><a href=\"umbrella://lesson/counter-surveillance\">Counter-surveillance lesson</a></li></ul></p><h3>FURTHER READING</h3><p><ul><li><a href=\"ngolearning.org/courses/availablecourses/CARE%20Safety%20Course/Shared%20Documents/English_CARE_International_Safety_and_Security_Handbook.pdf\">CARE International: Safety & Security Handbook</a></li><li><a href=\"www.odihpn.org/download/gpr_8_revised2pdf\">Good Practice Review Number 8: Operational security management in violent environments (Revised Ed.)</a></li><li><a href=\"https://www.google.co.uk/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&uact=8&ved=0CCEQFjAA&url=http%3A%2F%2Fec.europa.eu%2Fecho%2Ffiles%2Fevaluation%2Fwatsan2005%2Fannex_files%2FECHO%2FECHO12%20-%20echo_generic_security_guide_en.doc&ei=kLxAVc6LOILuUP2SgbAE&usg=AFQjCNEXEOcbLeV24f3WolHmDwLq7KJzlQ&sig2=hbnI7wfdrGIHS7mmikBRWA\">ECHO Generic Security Guide for Humanitarian Organisations</a></li><li><a href=\"protectioninternational.org/publication/new-protection-manual-for-human-rights-defenders-3rd-edition/\">Protection International: New Protection Manual for Human Rights Defenders (3rd Ed.)</a></li><li><a href=\"https://www.eisf.eu/wp-content/uploads/2014/09/0541-MO-2010-Advice-Note-Abduction-Kidnapping.doc\">EISF Abduction Advice Note</a></li></ul></p>",
		"category": "Travel",
		"subcategory": "Kidnapping",
		"difficulty": "Beginner"
	}
]